{"id":16310,"date":"2021-01-07T19:50:23","date_gmt":"2021-01-07T19:50:23","guid":{"rendered":"https:\/\/www.sepalika.com\/?page_id=16310"},"modified":"2021-01-07T19:50:50","modified_gmt":"2021-01-07T19:50:50","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/www.sepalika.com\/terms-of-use\/","title":{"rendered":"Terms Of Use"},"content":{"rendered":"\n<p>By using this site, you warrant that you have fully read and understood these Terms of Use and General Disclaimers and you signify your assent to them without any impairment in judgment resulting from (but not limited to) mental illness, mental handicap, intoxication, medication, or any other health or other problem that could impair judgment. By visiting, accessing or registering on this Site, you unconditionally accept to be bound by the terms provided herein below. If you do not agree to these Terms of Service, please do not access or use this Site.<\/p>\n\n\n\n<p>Moonjur Healthcare Pvt Ltd (“Moonjur Healthcare”) may revise and update these Terms of use and General Disclaimers at any time. Your continued usage of this website will mean you accept those changes. This disclaimer applies to all websites managed by Moonjur Healthcare.<br>Moonjur Healthcare, the owner of the Site, and professionals who offer services through the Site accept no responsibility for any medical, legal or financial events or outcomes related to services attained through the use of the Site, which is being provided on an as is basis as a platform to get health information.<\/p>\n\n\n\n<h3>THIS SITE DOES NOT PROVIDE MEDICAL ADVICE<\/h3>\n\n\n\n<p>The content on all websites associated with Moonjur Healthcare including, but not limited to, the text, graphics, images, links, and other materials are for informational purposes only.&nbsp; The content is not intended to be a substitute for professional medical advice, diagnosis, or treatment, and does not constitute medical or other professional advice.&nbsp; Moonjur Healthcare does not recommend or endorse any specific tests, physicians, products, procedures, opinions, or other information that may be mentioned on the website.&nbsp; Reliance on any information provided herein is solely at your own risk.&nbsp; The information provided on this and all our websites, is designed to support, not replace, the relationship that exists between patient\/site visitor and his\/her physician.&nbsp; Never disregard professional medical advice or delay in seeking it because of something you have read or seen on our websites.<\/p>\n\n\n\n<p>MEDICAL DISCLAIMER: IF THIS IS A MEDICAL EMERGENCY, PLEASE IMMEDIATELY CALL\/ VISIT EMERGENCY PERSONNEL TO GET PROMPT MEDICAL ATTENTION. DO NOT RELY ON ELECTRONIC COMMUNICATIONS FOR ASSISTANCE IN REGARD TO YOUR IMMEDIATE, URGENT MEDICAL NEEDS.<\/p>\n\n\n\n<h2>General Terms Of Use<\/h2>\n\n\n\n<p>Moonjur Healthcare provides its content on this website to you, subject to the Terms for Use, which may be updated by Moonjur Healthcare from time to time without notice. You should review the Terms periodically for changes.<\/p>\n\n\n\n<p>By accessing, browsing, and\/or using web pages or other digital content of our websites, you accept, without limitation or qualification, the following terms of use:<\/p>\n\n\n\n<p>Our websites are offered to you, the user, conditioned on acceptance of the terms, conditions, and notices contained herein, without modification.&nbsp; User access and use of these sites constitutes acceptance of these terms and conditions.<\/p>\n\n\n\n<p>Moonjur Healthcare reserves the right to offer websites directly to you or through its authorized agents and contractors.&nbsp; User agrees to use Moonjur Healthcare websites as permitted by applicable local, state and federal laws.&nbsp; User agrees, therefore, not to: 1) knowingly and without authorization, alter, damage, or destroy Moonjur Healthcare’s, its contractors’ or another user’s computer system, network, software, program, documentation or data contained therein; 2) use Moonjur Healthcare websites to conduct or attempt to conduct any business or activity or solicit the performance of any activity that is prohibited by law.&nbsp; In addition, taking action which results in blocking access to Moonjur Healthcare websites by other users will be deemed an unauthorized use.<\/p>\n\n\n\n<p>Anyone using Moonjur Healthcare websites expressly consents to administrative monitoring at all times by Moonjur Healthcare and\/or its authorized agents and\/or contractors. You are further advised that system administrators may provide evidence of possible criminal activity identified during such monitoring to appropriate law enforcement officials. If you do not wish to consent to monitoring, exit these websites immediately.<\/p>\n\n\n\n<h3>Liability And Reliability<\/h3>\n\n\n\n<p>Moonjur Healthcare gathers data from a variety of different sources, public and private. While we strive to provide the most accurate, up-to-date information possible, we can’t guarantee that our listings are completely without error. We and our authorized agents and contractors make no representations or warranties about the quality, content, completeness, suitability, adequacy, sequence, accuracy, or timeliness of said information.&nbsp; In addition, website content has been compiled by our staff from a variety of sources and is subject to change without notice to the User. If you feel some data is missing or inaccurate, you can submit updated information. The materials may not be exhaustive, and the content will not always reflect all the recent research in all areas of medicine. Information presents the more commonly found aspects of medical conditions which are likely to be of general interest, and for editorial reasons may not include certain substantive and commonly found phenomena.<\/p>\n\n\n\n<p>Moonjur Healthcare makes no representation or warranties of any kind, express or implied, on the information content or operation of this site. Moonjur Healthcare makes no representations concerning the quality of the products and services listed on this site for exemplary purposes, and information or links to other websites do not constitute a recommendation or endorsement by us.<\/p>\n\n\n\n<p>Moonjur Healthcare recommends users who find inappropriate content to contact us immediately in order that we may take such action as we in our sole discretion deem fit, including removing any content. In addition, we reserve the right and are authorized to remove any material of which we are aware which infringes these terms of use or which we otherwise consider inappropriate.<\/p>\n\n\n\n<p>THE SERVICES, INFORMATION AND DATA MADE AVAILABLE ON THIS WEBSITE ARE PROVIDED “AS IS” WITHOUT WARRANTIES OF ANY KIND.&nbsp; Moonjur Healthcare AND ITS AUTHORIZED AGENTS AND CONTRACTORS MAKE NO REPRESENTATIONS OR WARRANTIES REGARDING THE CONDITION OR FUNCTIONALITY OF THIS WEBSITE, ITS SUITABILITY FOR USE, OR THAT THIS WEB SERVICE WILL BE UNINTERRUPTED OR ERROR-FREE.<\/p>\n\n\n\n<p>Moonjur Healthcare also reserves the right to temporarily or permanently discontinue its websites, any page, or any functionality on its websites at any time and without notice.<\/p>\n\n\n\n<h3>Third Parties’ Liabilities<\/h3>\n\n\n\n<p>There are links and pointers to third party Internet websites contained in Moonjur Healthcare websites. These sites linked from our websites and may not be under our control.&nbsp; We encourage our users to be aware when they leave our site and to read the privacy statements of each and every website collecting personally identifiable information. Moonjur Healthcare and its authorized agents and contractors do not assume any responsibility or liability for any information, communications or materials available at such linked sites, or at any link contained in a linked site.&nbsp; Moonjur Healthcare and its authorized agents and contractors do not intend any third party links to be referrals or endorsements of the linked entities by Moonjur Healthcare and they are provided for convenience only.&nbsp; Each individual site may have its own set of policies governing the usage of information contained therein.&nbsp; The User assumes sole responsibility for use of third party links and pointers.<\/p>\n\n\n\n<h3>Damages<\/h3>\n\n\n\n<p>Moonjur Healthcare And its authorized agents and contractors shall not in any event be liable for any direct, indirect, punitive, special, incidental, or consequential damages, including, without limitation, lost revenues, or lost profits, arising out of or in any way connected with the use or misuse of the information or lack of information on our websites or with the delay or inability to use this website, or from any information, documents, services, software, or other material obtained through our&nbsp; websites, or otherwise arising out of the use of our websites, whether based on contract, tort, strict liability or otherwise, even if jhs and\/or any of its authorized agents, contractors, employees or affiliates have been advised of the possibility of damages.<\/p>\n\n\n\n<h3>Association With User<\/h3>\n\n\n\n<p>The User acknowledges that no joint venture, partnership, employment or agency relationship exists between the User and Moonjur Healthcare or its authorized agents or contractors as a result of this Agreement or use of Moonjur Healthcare websites. User agrees not to hold himself or herself out as a representative, agent, or employee of Moonjur Healthcare and Moonjur Healthcare and its authorized agents and contractors shall not be liable for any representation, act or omission of the User based on this agreement or use of Moonjur Healthcare websites.<\/p>\n\n\n\n<h3>Trademarks And Copyrights<\/h3>\n\n\n\n<p>All trademarks, service marks, and logos or copyrights displayed and used in this site are the property of their respective owners. Nothing in this site should be construed as granting any right or license to use any Trademark without the written permission of its owner.<\/p>\n\n\n\n<h3>Indemnity<\/h3>\n\n\n\n<p>As a condition of use of Moonjur Healthcare websites, the User agrees to indemnify Moonjur Healthcare their respective commissioners, governing board members, officers, employees and agents, and contractors against any and all liability, expenses (including attorney’s fees) and damages arising out of claims resulting from User’s use of Moonjur Healthcare websites, including without limitation any claims alleging facts that if true would constitute a breach by User of these terms and conditions.<\/p>\n\n\n\n<h3>Jurisdiction<\/h3>\n\n\n\n<p>This Agreement is governed by the laws of India. The User consents to the exclusive jurisdiction and venue of courts in New Delhi, India, in all disputes arising out of or relating to the use of Moonjur Healthcare websites.<\/p>\n\n\n\n<h3>Severability<\/h3>\n\n\n\n<p>If any part of this Agreement is determined to be invalid or unenforceable pursuant to applicable law including, but not limited to, the warranty disclaimers and liability limitation set forth above, then the invalid or unenforceable provision will be deemed superseded by a valid, enforceable provision that most closely matches the intent of the original provision and the remainder of the Agreement shall continue in effect.<\/p>\n\n\n\n<h3>E-Mail<\/h3>\n\n\n\n<p>“Phishing” is a scam designed to steal personal information. If the User receives an e-mail that looks like it is from Moonjur Healthcare asking for your personal information, the User should not respond. Moonjur Healthcare will never request the User’s password, username, or other personal information through e-mail.<\/p>\n\n\n\n<h3>Complete Agreement <\/h3>\n\n\n\n<p>Except as expressly provided in a particular “legal notice” on the website, these Terms of Use and Disclaimers and the&nbsp;<a href=\"https:\/\/www.sepalika.com\/privacy-policy\/\">Privacy Policy<\/a>&nbsp;constitute the entire agreement between you and Moonjur Healthcare with respect to the use of its websites and content. Any rights not expressly granted herein are reserved.<\/p>\n\n\n\n<p>our contact details and certain other information about you are subject to our Privacy Policy. For more information, please see our Privacy Policy.<br>Thank you for your cooperation. We hope you find the Moonjur Healthcare helpful and convenient to use! Questions or comments regarding this website, including any reports of non-functioning links, should be submitted using contact@sepalika.com.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>By using this site, you warrant that you have fully read and understood these Terms of Use and General Disclaimers and you signify your assent to them without any impairment in judgment resulting from (but not limited to) mental illness, mental handicap, intoxication, medication, or any other health or other problem that could impair judgment. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"inline_featured_image":false},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms Of Use - Sepalika<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/terms-of-use\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms Of Use - Sepalika\" \/>\n<meta property=\"og:description\" content=\"By using this site, you warrant that you have fully read and understood these Terms of Use and General Disclaimers and you signify your assent to them without any impairment in judgment resulting from (but not limited to) mental illness, mental handicap, intoxication, medication, or any other health or other problem that could impair judgment. [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/terms-of-use\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-07T19:50:50+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/terms-of-use\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/terms-of-use\/\",\"name\":\"Terms Of Use - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"datePublished\":\"2021-01-07T19:50:23+00:00\",\"dateModified\":\"2021-01-07T19:50:50+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/terms-of-use\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/terms-of-use\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/terms-of-use\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Terms Of Use\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms Of Use - Sepalika","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/terms-of-use\/","og_locale":"en_US","og_type":"article","og_title":"Terms Of Use - Sepalika","og_description":"By using this site, you warrant that you have fully read and understood these Terms of Use and General Disclaimers and you signify your assent to them without any impairment in judgment resulting from (but not limited to) mental illness, mental handicap, intoxication, medication, or any other health or other problem that could impair judgment. [&hellip;]","og_url":"https:\/\/www.sepalika.com\/terms-of-use\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_modified_time":"2021-01-07T19:50:50+00:00","twitter_card":"summary_large_image","twitter_site":"@SepalikaHealth","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/terms-of-use\/#webpage","url":"https:\/\/www.sepalika.com\/terms-of-use\/","name":"Terms Of Use - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"datePublished":"2021-01-07T19:50:23+00:00","dateModified":"2021-01-07T19:50:50+00:00","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/terms-of-use\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/terms-of-use\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/terms-of-use\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Terms Of Use"}]}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages\/16310"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=16310"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages\/16310\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=16310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}