{"id":1189,"date":"2016-05-12T10:57:46","date_gmt":"2016-05-12T17:57:46","guid":{"rendered":"http:\/\/www.sepalika.com\/?post_type=gain-awareness&#038;p=1189"},"modified":"2021-12-03T18:05:59","modified_gmt":"2021-12-03T12:35:59","slug":"seasonal-allergies-remedies","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/","title":{"rendered":"Natural Remedies For Seasonal Allergies"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#What_Causes_Allergies\"><span class=\"toc_number toc_depth_1\">1<\/span> What Causes Allergies?<\/a><\/li><li><a href=\"#The_Drugs_Are_Not_The_Cure\"><span class=\"toc_number toc_depth_1\">2<\/span> The Drugs Are Not The Cure<\/a><\/li><li><a href=\"#Dont_Ignore_The_Gut\"><span class=\"toc_number toc_depth_1\">3<\/span> Don’t Ignore The Gut<\/a><\/li><li><a href=\"#Healthy_Bacteria\"><span class=\"toc_number toc_depth_1\">4<\/span> Healthy Bacteria<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_1_Exercise_For_The_Win\"><span class=\"toc_number toc_depth_1\">5<\/span> Spring Allergies Tip # 1: Exercise For The Win<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_2_Take_Care_Of_Stress\"><span class=\"toc_number toc_depth_1\">6<\/span> Spring Allergies Tip #2: Take Care Of Stress<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_3_Adapt_to_Stress_Using_Adaptogens\"><span class=\"toc_number toc_depth_1\">7<\/span> Spring Allergies Tip #3: Adapt to Stress Using Adaptogens<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_4_Get_to_Sleep\"><span class=\"toc_number toc_depth_1\">8<\/span> Spring Allergies Tip # 4: Get to Sleep!<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_5_C_The_Light\"><span class=\"toc_number toc_depth_1\">9<\/span> Spring Allergies Tip #5: C The Light<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_6_Stinging_Nettles\"><span class=\"toc_number toc_depth_1\">10<\/span> Spring Allergies Tip #6. Stinging Nettles<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_7_Quercetin\"><span class=\"toc_number toc_depth_1\">11<\/span> Spring Allergies Tip #7: Quercetin<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_8_Bromelain\"><span class=\"toc_number toc_depth_1\">12<\/span> Spring Allergies Tip #8: Bromelain<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_9_Support_The_Liver\"><span class=\"toc_number toc_depth_1\">13<\/span> Spring Allergies Tip #9: Support The Liver<\/a><\/li><li><a href=\"#Spring_Allergies_Tip_10_Milk_Thistle\"><span class=\"toc_number toc_depth_1\">14<\/span> Spring Allergies Tip #10: Milk Thistle<\/a><\/li><\/ul><\/div>\n<p>The birds are chirping, the flowers are blooming, and tree buds are sprouting everywhere… it’s what you’ve been waiting for all winter. Then a sneeze comes on, your eyes and throat start itching wildly, and you know they’re here… the dreaded spring allergies!<\/p>\n<p>You start popping Zyrtec, Claritin, Allegra, or Benadryl, eye drops, nasal sprays—whatever you need to do to control your annoying symptoms. But you’re tired and groggy from all the meds and from the constant allergen assault on your immune system. You might start to wonder, is there a better way to deal with seasonal allergies? We hope so!<\/p>\n<p>Let’s take a look at why allergies, including spring and seasonal allergies happen in the first place to see if there’s an opportunity for us to intervene and help make our symptoms—and our lives—a little more comfortable.<\/p>\n<h2><span id=\"What_Causes_Allergies\">What Causes Allergies?<\/span><\/h2>\n<p>Allergies stem from a weak yet over-active immune system. It’s true that our immune system is our defense system, but it isn’t supposed to be launching an attack against the foods we eat and the world we live in—we shouldn’t be allergic to life!<\/p>\n<p>When the immune system is strong, it launches appropriate attacks only when necessary. According to John Hopkins Medicine, its purpose is to defend and protect us against genuinely dangerous and foreign substances like certain bacteria, fungi, and viruses. If an infectious agent does get into the body, the immune system’s job is to attack and destroy it before it wreaks havoc on our system.<\/p>\n<p>But when our immune system is weak, it starts to malfunction and recognize innocuous substances (e.g., pollen, dander, food) as a threat. Obviously this is not ideal. The goal is to balance the immune system—not weaken or strengthen it—so that it functions as it should in each given situation.<\/p>\n<h2><span id=\"The_Drugs_Are_Not_The_Cure\">The Drugs Are Not The Cure<\/span><\/h2>\n<p>Antihistamines like Benaryl, Zyrtec, Claritin and others are the most common drugs used for seasonal allergies. They work by blocking or opposing the activity of histamine receptors in the body, masking the symptoms (until it’s time for another dose) but doing nothing to help heal the condition itself. In fact, these so-called “aids” may even push the body further into dysfunction, weakening your immune system more so that the next time we’re exposed to that allergen, our system reacts even more poorly.<\/p>\n<p>Why are the allergic reactions happening in the first place? Why is the immune system weak and over-zealous? These are questions we need to examine for ourselves to attack the problem at its source. The answers may be different for each person, but highlighting some common patterns among those who suffer from allergies may shine the light on some good places to start to bring the body into better balance.<\/p>\n<h2><span id=\"Dont_Ignore_The_Gut\">Don’t Ignore The Gut<\/span><\/h2>\n<p>Our digestive tract is home to 70–80% of our immune tissue, so this is an area not to be ignored. Home to trillions of bacterial cells, researchers have discovered that it’s a <em>lack<\/em> of diversity in gut bacteria that can be a driving force in developing allergies. Having enough healthy bacteria is essential for a strong immune system.<\/p>\n<p>And when you consider the unhealthy foods we eat, as well as the unavoidable stress, the GMOs damaging our intestinal walls, and all the pesticides and toxins we constantly come into contact with, it’s no wonder our immunity is taking a big hit!<\/p>\n<h2><span id=\"Healthy_Bacteria\">Healthy Bacteria<\/span><\/h2>\n<div id=\"attachment_18462\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18462\" class=\"size-full wp-image-18462\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Probiotics-and-Diabetes-Yogurt.webp\" alt=\"natural remedies for seasonal allergies - don't ignore healthy bacteria\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18462\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; don&#8217;t ignore healthy bacteria<\/p><\/div>\n<p>Clearly, probiotics would be of good use here to increase healthy bacteria in the digestive tract to boost immunity and ward off the not-so-nice pathogenic bacteria. Look for a high-quality probiotic that ideally has more than just 1 or 2 strains, as more strains may be better to attain more diversity of bacteria. But find what works for you—we’re all different, and some may do better with a couple specific strands instead of many.<\/p>\n<ul>\n<li>What seems to work for many: 1–2 probiotic capsules per day, preferably one with several different strains. Follow instructions on the bottle or talk to a healthcare provider for specific instructions for that product—some strains, like saccharomyces boulardii (great for allergies and yeast overgrowth), work better on an empty stomach, whereas others are best after a meal.<\/li>\n<\/ul>\n<p>Traditional fermented foods like sauerkraut or pickles are another way to get natural probiotics without having to take a pill. But all pickles are not created equal! It’s important that the foods are found in the refrigerated section of your grocery store. If they’re not refrigerated or have vinegar listed as an ingredient (to mimic the taste of natural fermentation), then it’s not truly fermented! The fermentation process is what yields all the great probiotic strains your gut and immune system need, so don’t be fooled by those imitators.<\/p>\n<p>If high quality, yogurt can be great too. But make sure you find one that says it contains live cultures, and search for one without added sugar (including artificial sweeteners!) or junky, unnecessary ingredients. Look for full-fat dairy too—as fat, 1 of the 3 main macronutrients we need in our diets, is necessary for proper digestion and assimilation of nutrients. And it will keep you satiated and satisfied for longer so that you’re not reaching for a snack an hour or two later.<\/p>\n<ul>\n<li>What seems to work for many: Fermented vegetable products can be strong if you’re not used to them, so try a small amount at first—maybe 1 tsp or so, and work your way up from there. As your gut bacteria balances back out, taking too much at once can be too much for your system! Low and slow is the way to go with probiotics and fermented foods until you know how your system will respond. Yogurt isn’t as strong, so the serving size is less important. Aim for a serving daily of yogurt.<\/li>\n<\/ul>\n<p>Once we realize that seasonal allergies stem from a weak immune system, as well as one that is a hyper-reactive and over-zealous, we can look at things to help strengthen and boost our defense system, as well as things to calm it down so it will quit misfiring against anything and everything.<\/p>\n<h2><span id=\"Spring_Allergies_Tip_1_Exercise_For_The_Win\">Spring Allergies Tip # 1: Exercise For The Win<\/span><\/h2>\n<div id=\"attachment_18463\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18463\" class=\"size-full wp-image-18463\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Exercise-and-diabetes.webp\" alt=\"natural remedies for seasonal allergies - exercise\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18463\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; exercise<\/p><\/div>\n<p>Exercise strengthens the immune system, so that’s a good place to start. If being outside is not a good idea due to environmental allergens, then stick to working out in a gym or indoors with the windows closed to keep allergens out. Walking, running, lifting weights, swimming, yoga—anything will do! Just find something you enjoy—that way you’ll be more likely to keep at it. <em>What seems to work for many: Aim for 30 minutes of activity 5 days a week.<\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_2_Take_Care_Of_Stress\">Spring Allergies Tip #2: Take Care Of Stress<\/span><\/h2>\n<div id=\"attachment_18464\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18464\" class=\"size-full wp-image-18464\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Meditation-Depression.webp\" alt=\"natural remedies for seasonal allergies - take care of stress\" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18464\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; take care of stress<\/p><\/div>\n<p>Stress is linked to a compromised immune system; so clearly, stress is bad! Stress damages the intestinal wall, where 70–80% of our immune system lives. It also clogs up the lymphatic drainage system, resulting in a buildup of undesirable toxins and system-wide inflammation. Along with strengthening the immune system, exercise can also help with stress management.<\/p>\n<p>Other tools to help with stress include yoga, meditation, mindfulness, counseling, and more. It really can be as simple as: what do you enjoy doing? Go do that! When we’re engaged in something that is genuinely enjoyable to us, like painting, walking, reading, or talking with a friend, we turn off the stress, which is nothing but good news. <em>What seems to work for many: Try to spend at least 30 minutes per day doing something enjoyable or relaxing.<\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_3_Adapt_to_Stress_Using_Adaptogens\">Spring Allergies Tip #3: Adapt to Stress Using Adaptogens<\/span><\/h2>\n<div id=\"attachment_18465\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18465\" class=\"size-full wp-image-18465\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Gerd-TCM.jpg\" alt=\"natural remedies for seasonal allergies \" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18465\" class=\"wp-caption-text\">natural remedies for seasonal allergies<\/p><\/div>\n<p>But sometimes no matter what we do, the stress seems to win. To help your body cope with the demands of life, adaptogenic herbs like ashwgandha can be a godsend. Rhodiola, licorice, cordyceps, ginseng, and reishi mushroom are other adaptogens that may help modulate the immune system to function better and help the body cope with changing stress levels.<\/p>\n<h2><span id=\"Spring_Allergies_Tip_4_Get_to_Sleep\">Spring Allergies Tip # 4: Get to Sleep!<\/span><\/h2>\n<div id=\"attachment_18466\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18466\" class=\"size-full wp-image-18466\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Avoid-sleeping-on-your-right.webp\" alt=\"natural remedies for seasonal allergies - sleep\" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18466\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; sleep<\/p><\/div>\n<p>According to Dr. Josh Axe, certified doctor of natural medicine and a clinical nutritionist, “A lack of sleep can even make you more prone to allergies; not getting enough sleep weakens your immune system.” The message is clear—get to bed! The earlier the better, too. Going to bed by 10 pm is ideal for your stress hormones and for rejuvenating your whole system, instead of staying up until 11 pm or 12 am (or later!), and then sleeping later into the morning. <em>What seems to work for many: Aim for 8–9 hours of sleep every night.<\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_5_C_The_Light\">Spring Allergies Tip #5: C The Light<\/span><\/h2>\n<div id=\"attachment_18467\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18467\" class=\"size-full wp-image-18467\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Benefits-of-Vitamin-C.webp\" alt=\"natural remedies for seasonal allergies - try vitamin c\" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18467\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; try vitamin c<\/p><\/div>\n<p>One thing we can’t fail to mention when talking about allergies and immunity is vitamin C. According to a review published in the journal of Subcellular Biochemistry, this wonder vitamin plays a role in the deactivation of histamine.  It also supports the body during times of stress and helps to produce collagen, “which may help heal the gut wall from the ravages of stress,” according to Ayurvedic expert Dr. John Douillard. And when you think back to so much of our immunity being in the gut, it makes sense that rebuilding a strong, healthy intestinal wall is just plain smart. <em>What seems to work for many: 1,000 mg per day.<\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_6_Stinging_Nettles\">Spring Allergies Tip #6. Stinging Nettles<\/span><\/h2>\n<div id=\"attachment_18468\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Stinging-Nettle-Header.webp\"><img aria-describedby=\"caption-attachment-18468\" class=\"wp-image-18468 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Stinging-Nettle-Header.webp\" alt=\"natural remedies for seasonal allergies - stinging nettle\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-18468\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; stinging nettle<\/p><\/div>\n<p>Nettle leaf contains anti-histamine and anti-inflammatory properties, as well as regulating an over-active immune system. You can brew it in a tea on its own or with peppermint for better taste. <em>What seems to work for many: 300 mg of freeze-dried nettle leaf twice per day.<\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_7_Quercetin\">Spring Allergies Tip #7: Quercetin<\/span><\/h2>\n<div id=\"attachment_18469\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Onions.webp\"><img aria-describedby=\"caption-attachment-18469\" class=\"size-full wp-image-18469\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Onions.webp\" alt=\"natural remedies for seasonal allergies - Quercetin\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-18469\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; Quercetin<\/p><\/div>\n<p>This star bioflavanoid is a staple ingredient in supplements for seasonal allergies especially those that fight the condition naturally. Quercetin is a natural mast cell stabilizer (mast cells produce histamine); it moderates inflammation pathways and supports antioxidant protection within the cell, as well as supports the activities of other antioxidants. According to a 2013 study published in the international journal of immunopharmacology, “Quercetin… possesses many biological activities including anti-allergic activity.”<em>What seems to work for many: 400­–600 mg three times per day <\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_8_Bromelain\">Spring Allergies Tip #8: Bromelain<\/span><\/h2>\n<div id=\"attachment_18470\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/pineapple.webp\"><img aria-describedby=\"caption-attachment-18470\" class=\"size-full wp-image-18470\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/pineapple.webp\" alt=\"natural remedies for seasonal allergies - Bromelain\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-18470\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; Bromelain<\/p><\/div>\n<p>The powerful enzyme found in pineapple, bromelain is anti-inflammatory and helps with swelling in the nose and sinuses, easing hay fever symptoms. Instead of taking the supplemental form of bromelain, you can also just eat pineapple, which is loaded with it. That way you also get additional vitamins and nutrients like b vitamins, vitamin C, and more. And, let’s be honest—it’s a lot tastier! <em>What seems to work for many: 1,000 mg of bromelain per day. <\/em>However, it may be worthwhile searching for something with quercetin in it as well, as the combination of quercetin and bromelain is more effective as a natural remedy for seasonal allergies than single doses of bromelain alone.<\/p>\n<h2><span id=\"Spring_Allergies_Tip_9_Support_The_Liver\">Spring Allergies Tip #9: Support The Liver<\/span><\/h2>\n<div id=\"attachment_18471\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/NAC.webp\"><img aria-describedby=\"caption-attachment-18471\" class=\"size-full wp-image-18471\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/NAC.webp\" alt=\"natural remedies for seasonal allergies - Support the liver with NAC\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-18471\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; Support the liver with NAC<\/p><\/div>\n<p>NAC (n-acetylcysteine) is a great supplement to support the liver, which plays a role in the breaking down of histamines. NAC is important for phase 2 detoxification—of which there are 2 main phases—and it’s a precursor to glutathione, the body’s master antioxidant. It plays a vital role in detoxification, as well as in antioxidant protection. <em>What seems to work for many: 400 mg per day, taken in 2 divided doses of 200 mg.<sup> <\/sup><\/em><\/p>\n<h2><span id=\"Spring_Allergies_Tip_10_Milk_Thistle\">Spring Allergies Tip #10: Milk Thistle<\/span><\/h2>\n<div id=\"attachment_18472\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18472\" class=\"size-full wp-image-18472\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/Broccoli-for-T2D.webp\" alt=\"natural remedies for seasonal allergies - Try Milk Thistle\" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18472\" class=\"wp-caption-text\">natural remedies for seasonal allergies &#8211; Try Milk Thistle<\/p><\/div>\n<p>Milk thistle is another great liver-loving herb. Foods that support the liver are also a good idea here. Cruciferous vegetables like broccoli (broccoli sprouts are even better!), as well as lemon juice, beets, artichoke, asparagus, and leafy greens are all superstars. Most fruits and vegetables are a good idea though; you can’t go wrong with fresh, organic produce to heal and balance the body from the inside out. <em>What seems to work for many: 250–500 mg of milk thistle (with at least 80% silymarin) per day.<\/em><\/p>\n<p>Let nature be thy medicine when it comes to seasonal allergies, and let the healing begin!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8221;<br \/>\nThe birds are chirping, the flowers are blooming, and tree buds are sprouting… it’s what you’ve been waiting for all winter. Then a sneeze comes on, your eyes and throat start itching wildly, and you know they’re here… the dreaded spring allergies! Here is how to manage allergy symptoms through natural remedies.&#8221;<\/p>\n","protected":false},"author":29,"featured_media":16799,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[88],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Natural Remedies For Seasonal Allergies - Sepalika<\/title>\n<meta name=\"description\" content=\"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Natural Remedies For Seasonal Allergies - Sepalika\" \/>\n<meta property=\"og:description\" content=\"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/kristin.muckerheide\" \/>\n<meta property=\"article:published_time\" content=\"2016-05-12T17:57:46+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-03T12:35:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"779\" \/>\n\t<meta property=\"og:image:height\" content=\"309\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@Kristin Muckerheide\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Kristin Muckerheide\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg\",\"width\":779,\"height\":309},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/\",\"name\":\"Natural Remedies For Seasonal Allergies - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#primaryimage\"},\"datePublished\":\"2016-05-12T17:57:46+00:00\",\"dateModified\":\"2021-12-03T12:35:59+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/ef6d53e1a52534a1d78d5e3627f8af11\"},\"description\":\"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Natural Remedies For Seasonal Allergies\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/ef6d53e1a52534a1d78d5e3627f8af11\",\"name\":\"Kristin Muckerheide\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Kristin Muckerheide\"},\"description\":\"Kristin is a Board-Certified Holistic Health Practitioner and Functional Medicine Practitioner. She has graduated from the world's largest nutrition school, the Institute for Integrative Nutrition. Kristin loves helping people get happy and healthy, and encouraging and supporting those with chronic illness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/kristin.muckerheide\",\"https:\/\/twitter.com\/Kristin Muckerheide\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/kristin-1\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Natural Remedies For Seasonal Allergies - Sepalika","description":"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/","og_locale":"en_US","og_type":"article","og_title":"Natural Remedies For Seasonal Allergies - Sepalika","og_description":"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief","og_url":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/kristin.muckerheide","article_published_time":"2016-05-12T17:57:46+00:00","article_modified_time":"2021-12-03T12:35:59+00:00","og_image":[{"width":779,"height":309,"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@Kristin Muckerheide","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Kristin Muckerheide","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/Article_banner-1.jpg","width":779,"height":309},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#webpage","url":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/","name":"Natural Remedies For Seasonal Allergies - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#primaryimage"},"datePublished":"2016-05-12T17:57:46+00:00","dateModified":"2021-12-03T12:35:59+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/ef6d53e1a52534a1d78d5e3627f8af11"},"description":"Pesky seasonal allergies affect about 1 in 5 people, and can completely ruin your day.Try these natural remedies for seasonal allergies to find some relief","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/allergies\/seasonal-allergies-remedies\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Natural Remedies For Seasonal Allergies"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/ef6d53e1a52534a1d78d5e3627f8af11","name":"Kristin Muckerheide","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Kristin Muckerheide"},"description":"Kristin is a Board-Certified Holistic Health Practitioner and Functional Medicine Practitioner. She has graduated from the world's largest nutrition school, the Institute for Integrative Nutrition. Kristin loves helping people get happy and healthy, and encouraging and supporting those with chronic illness.","sameAs":["https:\/\/www.facebook.com\/kristin.muckerheide","https:\/\/twitter.com\/Kristin Muckerheide","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/kristin-1\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1189"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=1189"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1189\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16799"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=1189"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=1189"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=1189"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}