{"id":12284,"date":"2017-07-12T20:00:27","date_gmt":"2017-07-12T20:00:27","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12284"},"modified":"2022-01-21T16:06:35","modified_gmt":"2022-01-21T10:36:35","slug":"social-media-and-depression","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/","title":{"rendered":"Social Media and Depression: Is Social Media Making You Sad?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Social_Media_Depression_Whats_That\"><span class=\"toc_number toc_depth_1\">1<\/span> Social Media Depression: What’s That?<\/a><\/li><li><a href=\"#When_Social_Media_Becomes_a_Problem\"><span class=\"toc_number toc_depth_1\">2<\/span> When Social Media Becomes a Problem<\/a><ul><li><a href=\"#You_become_Addicted\"><span class=\"toc_number toc_depth_2\">2.1<\/span> You become Addicted<\/a><\/li><li><a href=\"#You_have_Too_Many_Accounts\"><span class=\"toc_number toc_depth_2\">2.2<\/span> You have Too Many Accounts<\/a><\/li><li><a href=\"#You_Get_Envious\"><span class=\"toc_number toc_depth_2\">2.3<\/span> You Get Envious<\/a><\/li><li><a href=\"#You_Set_Unrealistic_Expectations\"><span class=\"toc_number toc_depth_2\">2.4<\/span> You Set Unrealistic Expectations<\/a><\/li><li><a href=\"#You_Feel_Neglected\"><span class=\"toc_number toc_depth_2\">2.5<\/span> You Feel Neglected<\/a><\/li><li><a href=\"#Your_Relationships_Cause_You_Pain\"><span class=\"toc_number toc_depth_2\">2.6<\/span> Your Relationships Cause You Pain<\/a><\/li><li><a href=\"#You_get_Stalked\"><span class=\"toc_number toc_depth_2\">2.7<\/span> You get Stalked<\/a><\/li><li><a href=\"#You_are_Fooled_to_Believe_Something_Thats_Not_Real\"><span class=\"toc_number toc_depth_2\">2.8<\/span> You are Fooled to Believe Something That’s Not Real<\/a><\/li><li><a href=\"#You_are_Subjected_to_Cyberbullying\"><span class=\"toc_number toc_depth_2\">2.9<\/span> You are Subjected to Cyberbullying<\/a><\/li><li><a href=\"#Your_Oversharing_Backfired\"><span class=\"toc_number toc_depth_2\">2.10<\/span> Your Oversharing Backfired<\/a><\/li><\/ul><\/li><li><a href=\"#8_Signs_You_May_Be_Prone_To_Social_Media_Depression\"><span class=\"toc_number toc_depth_1\">3<\/span> 8 Signs You May Be Prone To Social Media Depression<\/a><\/li><li><a href=\"#Tips_To_Manage_Social_Media_Depression\"><span class=\"toc_number toc_depth_1\">4<\/span> Tips To Manage Social Media Depression<\/a><ul><li><a href=\"#Heres_what_you_can_do_to_enjoy_social_media_without_the_risk_of_associated_depression\"><span class=\"toc_number toc_depth_2\">4.1<\/span> Here’s what you can do to enjoy social media without the risk of associated depression:<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p>Is there a connection between social media and depression?<\/p>\n<p>Social media sure has changed lives. It’s easier than ever today to stay in touch with family and old friends and even make new friends everyday with Facebook, Twitter, Snapchat, Reddit and Instagram. In many ways, social media has made the world smaller and allowed us to connect with numerous people &#8212;- bridging gaps, expounding new possibilities, exposing us to new ideas every day and even letting us feel less isolated.<\/p>\n<p>However, mental health experts warn against social media overuse, especially when it can generate a slew of overwhelming negative emotions like anxiety, jealousy, stress, rejection, pressure and the need to compare your life with those of others only to find shortcomings. ‘Social Media Depression’ is very real, and it’s time to take it more seriously.<\/p>\n<h2><span id=\"Social_Media_Depression_Whats_That\">Social Media Depression: What’s That?<\/span><\/h2>\n<p>When you compulsively start off your day by scrolling through Twitter, Instagram, Vine, Reddit and Facebook, it can start to have an effect on your mental health. This is particularly true for those who have negative experiences on social media, for example – cyberbullying, attack by trolls, unwanted or inappropriate social contact and gaffes. In fact, adolescents and young adults are most susceptible to social media depression because there are significant emotional risks associated with social media usage.<\/p>\n<p>According to<a href=\"http:\/\/onlinelibrary.wiley.com\/doi\/10.1002\/da.22466\/abstract\"> research from the University of Pittsburgh School of Medicine<\/a>, the more time young adults spend using social media, the more likely they are to be depressed. There are many reasons for this. One could be that individuals who are more prone to depression and hence less keen on building real life relationships spend more time on the internet to fill a void. However, spending large amounts of time on social media can fuel “internet addiction,” which is a closely associated with depression. Social media also increases exposure to highly idealized representations of peers which can elicit feelings of envy and the distorted belief that others lead happier, more successful lives. Researchers studied this phenomenon in greater detail at Department of Behavioral Science, Utah Valley University, to find that spending a lot of time on Facebook can skew user perception. Their multivariate analysis indicated that subjects who spent more time on Facebook each week strongly believed that other people were happier and had better lives. Furthermore, many of them did not personally know their Facebook &#8220;friends&#8221;, even though they agreed these friends had better lives.<\/p>\n<p>Researchers at Michigan State University have found that multitasking on social media is associated with depression and social anxiety. According to them, multitasking on various social media platforms is a growing trend and represents a unique risk factor for mental health problems related to mood and anxiety. Another <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/23967061\">study at University of Michigan<\/a> found that the more young people used Facebook at one time point, the worse they felt as their satisfaction levels declined over time. Their research revealed that while Facebook provides an invaluable resource for fulfilling the basic human need for social connection, it can undermine the feeling of wellbeing rather than enhancing it, especially in young adults.<\/p>\n<h2><span id=\"When_Social_Media_Becomes_a_Problem\">When Social Media Becomes a Problem<\/span><\/h2>\n<div id=\"attachment_19682\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/When-Social-Media-Becomes-a-Problem.webp\"><img aria-describedby=\"caption-attachment-19682\" class=\"wp-image-19682 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/When-Social-Media-Becomes-a-Problem.webp\" alt=\"Social media and depression\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19682\" class=\"wp-caption-text\">When Social Media Becomes a Problem<\/p><\/div>\n<p>No, just because you like to check up on what’s happening on your social media accounts once a day doesn’t mean that you’re going to become afflicted with social media depression. There’s nothing wrong with being active on social media and enjoying everyday interactions as long as they don’t hamper with your well-being.<\/p>\n<p><strong>However, social media can pose a problem when:<\/strong><\/p>\n<h3><span id=\"You_become_Addicted\">You become Addicted<\/span><\/h3>\n<p>Studies have strongly linked internet addiction with depression. Those who regard themselves as dependent on the internet report high levels of depressive symptoms. These people are likely to engage a lot more on social media as compared to the normal population; for them interactions on the internet can serve as a replacement for real-life socializing.<\/p>\n<h3><span id=\"You_have_Too_Many_Accounts\">You have Too Many Accounts<\/span><\/h3>\n<p>Researchers from University of Pittsburgh’s Center for Research on Media, Technology, and Health found that using multiple social-media platforms may put you at increased risk of depression and anxiety. The study found that those who used 7-10 social-media platforms are three times more likely to be depressed or anxious compared to those using no more than two.<\/p>\n<h3><span id=\"You_Get_Envious\">You Get Envious<\/span><\/h3>\n<p>The problem begins when you start comparing yourself to others and feel worse about your life. A <a href=\"http:\/\/www.sciencedirect.com\/science\/article\/pii\/S0747563214005767?via%3Dihub\">survey<\/a> of 736 college students found that Facebook use can trigger feelings of envy. Feelings of envy were found to predict depression symptoms.<\/p>\n<h3><span id=\"You_Set_Unrealistic_Expectations\">You Set Unrealistic Expectations<\/span><\/h3>\n<p>Celebrities on social media platforms live a glamorous life that you may try to emulate, and then feel depressed when your own life doesn’t measure up. If you follow Instagrammers who are fashion\/health\/nutrition experts, you can start to feel like a failure when your life doesn’t turn out like theirs.<\/p>\n<h3><span id=\"You_Feel_Neglected\">You Feel Neglected<\/span><\/h3>\n<p>So no one messaged you or mentioned you today on social media. Many people can start to feel neglected when no one comments on their posts and updates, because they start to feel like no one likes them anymore.<\/p>\n<h3><span id=\"Your_Relationships_Cause_You_Pain\">Your Relationships Cause You Pain<\/span><\/h3>\n<p>It’s not uncommon for people to friend their exes on social media. And that leads to romantic drama that WILL cause anyone pain! Additionally, it can feel devastating when you find out your favorite person ‘unfriended’ or blocked you.<\/p>\n<h3><span id=\"You_get_Stalked\">You get Stalked<\/span><\/h3>\n<p>It’s not uncommon for stalkers and trolls to target gullible strangers. No one wants to feel unsafe, and especially in their private social media space that can almost feel like REAL life to some.<\/p>\n<h3><span id=\"You_are_Fooled_to_Believe_Something_Thats_Not_Real\">You are Fooled to Believe Something That’s Not Real<\/span><\/h3>\n<p>You met a handsome guy from Italy and now you’re in love. But the truth is that he’s an aging pedophile from Wisconsin with a fake social media account. Being fooled into believing something that’s not true is always depressing.<\/p>\n<h3><span id=\"You_are_Subjected_to_Cyberbullying\">You are Subjected to Cyberbullying<\/span><\/h3>\n<p>As if being bullied in real life isn’t hard enough, increased social media use exposes you to the dangers of cyberbullying. Studies have found that cyberbullying is strongly linked to depression. There are higher chances of cyberbullying and depression in those who also suffer from internet addiction, according to research.<\/p>\n<h3><span id=\"Your_Oversharing_Backfired\">Your Oversharing Backfired<\/span><\/h3>\n<p>For those who treat the internet as their “real world”, it’s not uncommon to share everything. While there’s nothing wrong with sharing your daily updates, achievements, and funny stories, oversharing on the internet about your job, family, relationships and illegal activities can get you in a lot of trouble. Sometimes it’ll cause you embarrassment when someone will find out something not meant for their eyes, and at other times you could lose out on relationships and even privileges.<\/p>\n<h2><span id=\"8_Signs_You_May_Be_Prone_To_Social_Media_Depression\">8 Signs You May Be Prone To Social Media Depression<\/span><\/h2>\n<p>If you are spending way too much time on social media and are constantly feeling inadequate as a result, read on to identify signs that you’re prone to ‘Social Media Depression’.<\/p>\n<ol>\n<li>You can’t go a single hour without scrolling through your social media accounts.<\/li>\n<li>You’re constantly interacting with people on the internet and start to believe these are the only friends that matter. You prefer these relationships over real life relationships.<\/li>\n<li>It’s not uncommon for you to stay hooked on to your social media accounts all day and night on weekends. You don’t know where the day disappeared!<\/li>\n<li>You feel really horrible after a bad interaction on social media. It ruins your day and interferes with your normal routine.<\/li>\n<li>A bad experience on social media (negative comment or cyberbullying) makes you stay home in bed, sulking, all day long. You feel unsafe and even scared.<\/li>\n<li>You saw a picture of three friends at a lunch meetup that you weren’t invited to, and now you feel horribly neglected.<\/li>\n<li>A Snapchat with your girlfriend has you feeling lonely. She has a ton of things planned for her Saturday and all you’ve got to do is browse through your social media accounts. While social media connections are great, they CANNOT replace real-life social connections.<\/li>\n<li>After you’ve spent hours scrolling through your social media accounts, you feel sad. Your life simply doesn’t measure up….you don’t have hourly pictures to post or updates in life to boast about. Surely your life isn’t as fulfilling, right?<\/li>\n<\/ol>\n<h2><span id=\"Tips_To_Manage_Social_Media_Depression\">Tips To Manage Social Media Depression<\/span><\/h2>\n<div id=\"attachment_19683\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Tips-To-Manage-Social-Media-Depression.webp\"><img aria-describedby=\"caption-attachment-19683\" class=\"wp-image-19683 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Tips-To-Manage-Social-Media-Depression.webp\" alt=\"Social media and depression\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19683\" class=\"wp-caption-text\">Tips To Manage Social Media Depression<\/p><\/div>\n<p>No, we are not going to tell you to delete all your social media accounts stat!! Because social media has become such an integrated component of human interaction, it is important to learn how to strike the perfect balance.<\/p>\n<p>The internet CAN have a positive effect on your mental health, especially when you choose who you interact with correctly. As proven by <a href=\"http:\/\/onlinelibrary.wiley.com\/doi\/10.1002\/da.20805\/full\" target=\"_blank\" rel=\"noopener noreferrer\" data-wplink-edit=\"true\">researchers from University of Wisconsin<\/a>, given the frequency of depression symptom displays on public profiles, social networking sites could be an innovative avenue for combating stigma surrounding mental health conditions or for identifying students at risk for depression.<\/p>\n<h3><span id=\"Heres_what_you_can_do_to_enjoy_social_media_without_the_risk_of_associated_depression\">Here’s what you can do to enjoy social media without the risk of associated depression:<\/span><\/h3>\n<ol>\n<li>Limit your use. Check your accounts couple times a day when you’re free and stop obsessing over the lives of social-media celebs.<\/li>\n<li>It’s wise to limit usage to three platforms, since having accounts on several social media platforms is associated with symptoms of depression and anxiety, even when controlling for overall time spent on social media.<\/li>\n<li>Don’t compare your life to those of online ‘friends’. Not everything you see and read on social media is real!<\/li>\n<li>Avoid negative content on social media. If someone attacks you, simply block them and tell yourself that it’s nothing personal. In all probability, the person doesn’t even know you in real life.<\/li>\n<li>It’s best to avoid intense and negative discussions on the internet, as these can often get out of hand. Why must you prove a point to strangers, right?!<\/li>\n<li>Remove all toxic people from your life. If someone makes you feel unworthy or inadequate, it’s time to unfriend\/unfollow them.<\/li>\n<li>Don’t waste your time on useless content. Life’s too short to watch crazy videos that don’t even make sense! Go out; enjoy the sunshine and the fresh air instead.<\/li>\n<li>Only follow people you can genuinely relate to; who add some value to your life. Don’t feel pressured into following 10K people so that they follow you back. You don’t need that many worthless relationships in your life.<\/li>\n<li>Seek positive content. Surround yourself with people and pages who make you feel good, even on the internet.<\/li>\n<li>If you’re feeling overwhelmed with all that gossip\/content\/information, it’s time to take a break.<\/li>\n<\/ol>\n<p>Your Social Media interaction MUST be positive. Think of it as a way to stay in touch with your friends; it’s not your whole life. That’s the best way to enjoy social media and not let it cause depression.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you compulsively start off your day by scrolling through Twitter, Instagram, Vine, Reddit and Facebook, it can start to have an effect on your mental health<\/p>\n","protected":false},"author":24,"featured_media":19684,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[133],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Social media and Depression: Is Social Media Making You Sad? | Sepalika<\/title>\n<meta name=\"description\" content=\"We explore social media and depression and tell you how to prevent social media from making you sad.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Can Social Media Lead To Depression?\" \/>\n<meta property=\"og:description\" content=\"How can you prevent social media from making you sad?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-07-12T20:00:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-21T10:36:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Social-media-2nd-image.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/\",\"name\":\"Social media and Depression: Is Social Media Making You Sad? | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#primaryimage\"},\"datePublished\":\"2017-07-12T20:00:27+00:00\",\"dateModified\":\"2022-01-21T10:36:35+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"We explore social media and depression and tell you how to prevent social media from making you sad.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Social Media and Depression: Is Social Media Making You Sad?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Social media and Depression: Is Social Media Making You Sad? | Sepalika","description":"We explore social media and depression and tell you how to prevent social media from making you sad.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/","og_locale":"en_US","og_type":"article","og_title":"Can Social Media Lead To Depression?","og_description":"How can you prevent social media from making you sad?","og_url":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-07-12T20:00:27+00:00","article_modified_time":"2022-01-21T10:36:35+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Social-media-2nd-image.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#webpage","url":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/","name":"Social media and Depression: Is Social Media Making You Sad? | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#primaryimage"},"datePublished":"2017-07-12T20:00:27+00:00","dateModified":"2022-01-21T10:36:35+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"We explore social media and depression and tell you how to prevent social media from making you sad.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/mental-health\/social-media-and-depression\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Social Media and Depression: Is Social Media Making You Sad?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12284"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12284"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12284\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19684"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12284"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12284"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12284"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}