{"id":12476,"date":"2017-07-21T21:00:32","date_gmt":"2017-07-21T21:00:32","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12476"},"modified":"2022-01-24T12:16:58","modified_gmt":"2022-01-24T06:46:58","slug":"gastric-bypass-diabetes","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/","title":{"rendered":"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#What_is_Gastric_Bypass\"><span class=\"toc_number toc_depth_1\">1<\/span> What is Gastric Bypass?<\/a><\/li><li><a href=\"#Gastric_Bypass_Could_Bacteria_Be_The_Real_Change\"><span class=\"toc_number toc_depth_1\">2<\/span> Gastric Bypass: Could Bacteria Be The Real Change?<\/a><\/li><li><a href=\"#So_Is_Gastric_Bypass_the_Best_Way_to_Cure_Diabetes\"><span class=\"toc_number toc_depth_1\">3<\/span> So, Is Gastric Bypass the Best Way to Cure Diabetes?<\/a><\/li><li><a href=\"#Bariatric_Surgery_for_Weight_Loss_and_Bariatric_Surgery_for_Reversing_Diabetes_Are_Not_the_Same\"><span class=\"toc_number toc_depth_1\">4<\/span> Bariatric Surgery for Weight Loss and Bariatric Surgery for Reversing Diabetes Are Not the Same<\/a><\/li><li><a href=\"#Who_is_a_Good_Candidate_for_Bariatric_Surgery_to_Reverse_Diabetes\"><span class=\"toc_number toc_depth_1\">5<\/span> Who is a Good Candidate for Bariatric Surgery to Reverse Diabetes?<\/a><\/li><li><a href=\"#What_Does_The_Future_Hold\"><span class=\"toc_number toc_depth_1\">6<\/span> What Does The Future Hold?<\/a><\/li><li><a href=\"#The_Final_Verdict\"><span class=\"toc_number toc_depth_1\">7<\/span> The Final Verdict<\/a><\/li><\/ul><\/div>\n<p>If you are diabetic, you must have heard that losing weight is crucial for diabetes management and can even make blood sugar levels get back to normal. And let’s be honest here – who doesn’t like shortcuts, right? To some of us, gastric bypass surgery seems like a good option to cure or reverse diabetes.<\/p>\n<p>It’s true that weight loss is good for diabetes, and a surgery that guarantees weight loss can make a big difference for people with Type 2 Diabetes. Gastric bypass reduces size of stomach which leads to weight loss and eventually reverses diabetes. Some patients find that blood sugar levels return to normal within days after surgery. That means you could lead the rest of your life taking less or no medication at all for diabetes.<\/p>\n<p>However, gastric bypass surgery will severely restrict your life. Not only will you have to seriously limit how much food you eat, you also have to eat from a very restricted food list. So the question is &#8212; is gastric bypass the right method to cure diabetes for most of us? OR is it a rather extreme course of action, one that is only suitable for the morbidly obese? Let’s explore bariatric surgery as a method to reverse diabetes in detail.<\/p>\n<h2><span id=\"What_is_Gastric_Bypass\">What is Gastric Bypass?<\/span><\/h2>\n<p>Gastric Bypass or Bariatric Surgery is a weight-loss surgery that changes the digestive system. Commonly, the surgeon makes a small stomach pouch by dividing the top of the stomach from the rest of it. As a result, you can only eat or drink small quantities at a time, as you feel full sooner and hence absorb fewer calories. The food you eat goes to the small pouch and bypasses the top of the small intestine. There are other kind of bariatric surgeries too that make changes to your small intestine where calories and nutrients are absorbed from foods you eat.<\/p>\n<p>It’s not uncommon for overweight patients of Type 2 diabetes to wonder if bariatric surgery could be the answer to their woes. Yes, bariatric surgery and diabetes remission go hand in hand; but how does it put Type 2 Diabetes into remission?<\/p>\n<h2><span id=\"Gastric_Bypass_Could_Bacteria_Be_The_Real_Change\">Gastric Bypass: Could Bacteria Be The Real Change?<\/span><\/h2>\n<p>Latest research suggests that a gastric bypass patient’s weight loss isn’t caused by the stomach not being able to hold as much food, but rather because the surgery changes the types of microbes in the gut.<\/p>\n<p>Bariatric surgery could result in long-term changes in gut bacteria that contribute to weight loss following the procedure, studies suggest. A <a href=\"http:\/\/diabetes.diabetesjournals.org\/content\/59\/12\/3049.short\" target=\"_blank\" rel=\"noopener noreferrer\">French study<\/a> found that components of the dominant gut microbiota rapidly adapt in a starvation-like situation induced by bypass surgery, where gut bacteria species, which are directly linked to low-grade inflammation state in obesity and diabetes reduce in number. Simply put – bariatric surgery changes gut microbial due to bypass cutting off food to parts of the intestine and starving the bad bacteria there, leading to weight loss and diabetes control.<\/p>\n<p>Researchers from Imperial College London, UK found a profound co-dependence of mammalian and microbial metabolism, which is systematically altered after bariatric surgery, suggesting that gastric bypass surgery exerts local and global metabolic effects. “<em>The effect of bariatric surgery on the host metabolic–microbial cross-talk augments our understanding of the metabolic phenotype of bariatric procedures and can facilitate enhanced treatments for obesity-related diseases<\/em>”, says Professor Elaine Holmes who works at Department of Surgery and Cancer at the Imperial College London. These findings have also been confirmed by a team of researchers at Arizona State University who studied human stool samples to find similar results.<\/p>\n<h2><span id=\"So_Is_Gastric_Bypass_the_Best_Way_to_Cure_Diabetes\">So, Is Gastric Bypass the Best Way to Cure Diabetes?<\/span><\/h2>\n<p>Not necessarily. We, at Sepalika, believe that gastric bypass is only suitable for morbidly obese patients after all attempts to correct blood sugar levels without surgery have been exhausted.<\/p>\n<p>As studies have revealed, healthy population of microflora in the gut is the key to losing weight and adiposity, which in turn stabilizes blood sugar levels. When researchers analyzed the data collated in greater detail, they found that intestinal pH decreases while bile acid concentration increases post bypass surgery. Bile acid is crucial to assimilate fat while the correct pH is necessary for the digestion of protein. Both these processes are necessary for energy production.<\/p>\n<p>Fact is: the human body is always trying to reach a state of energy homeostasis or balance. This occurs when the energy derived from food intake balances energy expenditure. Any imbalances in this delicate process, even as much as 1% extra calorie intake as opposed to calories expended will result in weight gain.<\/p>\n<p>If you want to <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-weight-loss-type-2\/\">lose excess fat <\/a>and maintain proper weight (which will also help reverse diabetes naturally) one of the key factors is to make your body efficiently and effectively absorb nutrition and energy from the foods you eat. Consume nutrient-dense natural foods like nuts, seeds, eggs, meat, avocados, dairy products and beans which provide high nutritional value and energy while guaranteeing satiation. Fried, fatty, processed, and packaged foods aren’t naturally balanced, but worse, they contain high levels of sugar, sodium, and preservatives. They aren’t energy efficient and leave your body craving more food to fill in the nutritional gaps. The end result is fat storage and weight gain.<\/p>\n<p>Additionally, while there are no direct studies linking probiotics to reversing diabetes, probiotics positively modify metabolic disturbance. There is strong scientific evidence that probiotic ingestion and supplementation might decrease serum cholesterol level and improve insulin sensitivity. Present research data proves that <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/probiotics-and-diabetes\/\">probiotics may improve glucose metabolism<\/a>, and this effect is magnified when treatment continues for at least 8 weeks, or when multiple species of probiotics are consumed.<\/p>\n<h2><span id=\"Bariatric_Surgery_for_Weight_Loss_and_Bariatric_Surgery_for_Reversing_Diabetes_Are_Not_the_Same\">Bariatric Surgery for Weight Loss and Bariatric Surgery for Reversing Diabetes Are Not the Same<\/span><\/h2>\n<p>This is the one thing we really want to stress upon – <strong><em>bariatric surgery for weight loss and bariatric surgery to reverse diabetes is not the same thing. <\/em><\/strong><\/p>\n<p>Say for example – you are 20 pounds overweight and have recently been diagnosed with Type 2 Diabetes. Is bariatric surgery the right option for you? Absolutely not! The right course of action would be to modify your diet and work with a nutritionist to chart out the right <a href=\"https:\/\/www.sepalika.com\/living-well\/healthy-fats-why-everyone-must-eat-them\/\">LCHF diet<\/a>, along with moderate physical activity every day. Together, these help stabilize your blood sugar levels, lose those extra pounds and eventually <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/can-you-reverse-type-2-diabetes\/\">reverse diabetes<\/a>.<\/p>\n<h2><span id=\"Who_is_a_Good_Candidate_for_Bariatric_Surgery_to_Reverse_Diabetes\">Who is a Good Candidate for Bariatric Surgery to Reverse Diabetes?<\/span><\/h2>\n<p>Bariatric surgery is often the only course of action for patients who are severely and morbidly overweight, and have been unable to lose weight or keep from gaining back weight through lifestyle and diet modifications. For the morbidly obese, bariatric surgery can help lose weight and improve obesity related health problems, like:<\/p>\n<ul>\n<li>High Blood Pressure<\/li>\n<li>High Cholesterol Levels<\/li>\n<li>Type 2 Diabetes<\/li>\n<li>Sleep Apnea<\/li>\n<li>Joint Pains<\/li>\n<li>Urinary Inconsistence<\/li>\n<\/ul>\n<p>However, bear in mind that bariatric surgery can never replace healthy habits. All it does is make it feasible for you to eat fewer calories and live a more physically active lifestyle. It’s crucial that you eat a healthy, nutritious diet and exercise regularly post-surgery to keep the weight off in the long term.<\/p>\n<p>However, bariatric surgery is not without its own set of cons. These include:<\/p>\n<ul>\n<li>After surgery, the food you eat passes through the digestive tract relatively quickly, making it harder for your body to absorb enough nutrients. Patients have to take <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/vitamins-for-diabetics\/\">supplements<\/a> for life to prevent calcium, iron, and vitamin deficiencies.<\/li>\n<li>Like all other surgeries, bariatric surgery comes with its own surgery related complications and risks.<\/li>\n<li>You need to eat differently for life, as your stomach will not be able to handle large portions of food at any point of time.<\/li>\n<li>It increases risk for gallstones<\/li>\n<li>It’s expensive<\/li>\n<\/ul>\n<h2><span id=\"What_Does_The_Future_Hold\">What Does The Future Hold?<\/span><\/h2>\n<p>So, keeping in mind the above-mentioned cons of bariatric surgery, what lies in the future for morbidly obese patients who require surgical intervention to prevent life-threatening diseases like diabetes type 2, hypertension and cardiovascular diseases? Fecal transplants from thin people could help obese people achieve weight reduction!<\/p>\n<p>Researchers have linked bacteria in feces with the build-up of visceral abdominal fat. This sheds further light on the role of gut microbial in the development of obesity and suggesting possible treatment.<\/p>\n<p>Research done at King&#8217;s College London that was <a href=\"http:\/\/genomebiology.biomedcentral.com\/\" target=\"_blank\" rel=\"noopener noreferrer\">published in the journal Genome Biology<\/a> establishes a link between gut bacteria and visceral fat. Researchers at University of Gothenburg in Sweden, led by Fredrik Bäckhed, conducted a clinical study on mice. Fecal transplant from mice who underwent bypass-surgery patients was transferred into germ-free mice. These mice experienced a number of metabolic changes, including improved fat oxidation. Over the course of two weeks, these mice also gained 43% less body fat. “<em>Our findings are important in light of the growing epidemic of obesity and associated diseases,<\/em>” Bäckhed said in a statement. “<em>Since surgery always confers a risk, it is critical to identify non-surgical strategies. One potential strategy would be to devise novel probiotics based on our findings that can be supplied to obese individuals<\/em>.”<\/p>\n<h2><span id=\"The_Final_Verdict\">The Final Verdict<\/span><\/h2>\n<p>Reversing diabetes and gastric sleeve surgery doesn’t have to go hand in hand always. For some people, bariatric surgery might really be the only way to a healthier lifestyle. It’s important to remember, however, that surgery is simply a tool — it will not cure all problems. The only way to reverse diabetes is by modifying your lifestyle, changing your diet and getting more <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-does-exercise-help-diabetes\/\">physically active<\/a>. Bariatric surgery must be the last resort.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Let’s be honest here – who doesn’t like shortcuts, right? To some of us, gastric bypass surgery seems like a good option to cure or reverse diabetes.<\/p>\n","protected":false},"author":24,"featured_media":19796,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[116,112],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?<\/title>\n<meta name=\"description\" content=\"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?\" \/>\n<meta property=\"og:description\" content=\"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-07-21T21:00:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-24T06:46:58+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp\",\"width\":400,\"height\":309,\"caption\":\"Gastric bypass\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/\",\"name\":\"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#primaryimage\"},\"datePublished\":\"2017-07-21T21:00:32+00:00\",\"dateModified\":\"2022-01-24T06:46:58+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?","description":"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/","og_locale":"en_US","og_type":"article","og_title":"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?","og_description":"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.","og_url":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-07-21T21:00:32+00:00","article_modified_time":"2022-01-24T06:46:58+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/admin-ajax-2-2.webp","width":400,"height":309,"caption":"Gastric bypass"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#webpage","url":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/","name":"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#primaryimage"},"datePublished":"2017-07-21T21:00:32+00:00","dateModified":"2022-01-24T06:46:58+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Gastric bypass surgery can severely restrict your life. Gastric bypass is only suitable for morbidly obese people with diabetes.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/gastric-bypass-diabetes\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Is Gastric Bypass Surgery Your Best Choice For Reversing Diabetes?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12476"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12476"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12476\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19796"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12476"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12476"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12476"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}