{"id":1255,"date":"2016-05-25T05:44:50","date_gmt":"2016-05-25T12:44:50","guid":{"rendered":"http:\/\/www.sepalika.com\/?post_type=gain-awareness&#038;p=1255"},"modified":"2021-12-04T13:41:39","modified_gmt":"2021-12-04T08:11:39","slug":"how-to-reverse-insulin-resistance","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/","title":{"rendered":"Weight Loss Struggle After Forty – Insulin Resistance Could Be The Culprit!"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Diet_A_Calorie_Is_Not_Just_A_Calorie\"><span class=\"toc_number toc_depth_1\">1<\/span> Diet: A Calorie Is Not Just A Calorie!<\/a><\/li><li><a href=\"#So_What_Should_I_Eat\"><span class=\"toc_number toc_depth_1\">2<\/span> So What Should I Eat?<\/a><\/li><li><a href=\"#What_Should_I_avoid_If_Its_In_A_Packet_Think_Twice_Before_Eating_It\"><span class=\"toc_number toc_depth_1\">3<\/span> What Should I avoid?  “If It’s In A Packet – Think Twice Before Eating It!”<\/a><ul><li><a href=\"#Avoid_Eating_After_7_pm_for_Weight_Loss\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Avoid Eating After 7 pm for Weight Loss<\/a><\/li><li><a href=\"#Practice_Intermittent_Fasting\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Practice “Intermittent Fasting”<\/a><\/li><li><a href=\"#Eat_Smaller_Meals_for_Weight_Loss\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Eat Smaller Meals for Weight Loss<\/a><\/li><li><a href=\"#Drink_Water_first-Weight_Loss\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Drink Water first-Weight Loss<\/a><\/li><li><a href=\"#Exercise_Build_Muscle\"><span class=\"toc_number toc_depth_2\">3.5<\/span> Exercise, Build Muscle<\/a><\/li><li><a href=\"#Sleep_Well_Weight_Loss\"><span class=\"toc_number toc_depth_2\">3.6<\/span> Sleep Well, Weight Loss<\/a><\/li><li><a href=\"#De-stress\"><span class=\"toc_number toc_depth_2\">3.7<\/span> De-stress<\/a><\/li><\/ul><\/li><li><a href=\"#Dietary_Supplements_to_Support_Weight_Loss\"><span class=\"toc_number toc_depth_1\">4<\/span> Dietary Supplements to Support Weight Loss<\/a><ul><li><a href=\"#Calcium\"><span class=\"toc_number toc_depth_2\">4.1<\/span> Calcium <\/a><\/li><li><a href=\"#Vitamin_D\"><span class=\"toc_number toc_depth_2\">4.2<\/span> Vitamin D<\/a><\/li><li><a href=\"#Fish_Oil\"><span class=\"toc_number toc_depth_2\">4.3<\/span> Fish Oil<\/a><\/li><li><a href=\"#Chromium\"><span class=\"toc_number toc_depth_2\">4.4<\/span> Chromium<\/a><\/li><li><a href=\"#Zinc\"><span class=\"toc_number toc_depth_2\">4.5<\/span> Zinc<\/a><\/li><li><a href=\"#Magnesium\"><span class=\"toc_number toc_depth_2\">4.6<\/span> Magnesium<\/a><\/li><li><a href=\"#Chocolate_And_Green_Tea\"><span class=\"toc_number toc_depth_2\">4.7<\/span> Chocolate And Green Tea<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p>You hit forty. The new thirty, you say. But it also brings an expanding waistline and weighing machines programmed to give bad news. You no longer fit into your favorite clothes. The more you exercise, it seems, the more your weight refuses to budge. Insulin resistance could be at the core of it all. Fixing it may be the simplest way to weight loss.<\/p>\n<p>Our bodies and lifestyle do change as we get older, but this doesn’t have to mean we have to lose health and vitality. If  you’re already carrying a few extra pounds, being 40+ doesn’t mean the weight can’t be lost.<\/p>\n<p>It’s just about being more conscious about our health and daily behaviors and by stepping up healthy diet and lifestyle habits.<\/p>\n<p>It’s vital to maintain a healthy weight, as according to the <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK44206\/\" target=\"_blank\" rel=\"noopener noreferrer\">U.S. Department of Health and Human Services<\/a> “overweight and obesity are risk factors for type 2 diabetes, heart disease, high blood pressure, fatty liver, arthritis and cancer”.<\/p>\n<p>Following these tips can help you lose weight, lessen your risk of weight gain and age-related disorders and set the stage for healthy, energized and vital later years.<\/p>\n<h2><span id=\"Diet_A_Calorie_Is_Not_Just_A_Calorie\">Diet: A Calorie Is Not Just A Calorie!<\/span><\/h2>\n<p>Calories are not created equally – different foods go through different metabolic pathways and have varying effects on hunger, hormones, health and weight. The impact of different foods on your body’s insulin resistance is key to weight loss.<\/p>\n<h2><span id=\"So_What_Should_I_Eat\">So What Should I Eat?<\/span><\/h2>\n<p><b>EVERY<\/b><b> meal should include a protein, healthy fat and vegetables.<\/b>  Across the day you can also include a small amount of whole grains such as brown rice or whole wheat, fruit and starchy vegetables such as potatoes if you wish.<\/p>\n<p>Just like constructing a house, our body needs the building blocks to be able to manufacture all the parts that make it up and keep it functioning optimally – “proteins, healthy fats and complex carbohydrates” – preferably ALL from an unprocessed source will provide all the building blocks you need.<\/p>\n<ul>\n<li><b>Proteins<\/b> include meats, fish, seafood, eggs, nuts, seeds, dairy and legumes.  Eating protein can boost your metabolic rate and reduce appetite compared to eating the same number of calories from carbohydrates.  It can also increase muscle mass, which burns calories around the clock.<\/li>\n<li><b>Healthy fats<\/b> – don’t be scared of these, they provide huge benefits; small amounts of fat at each meal increases satiety and improves hormonal, skin and cellular health and can actually aid in weight loss &#8211; include olive oil, olives, fish, eggs, avocado, nuts\/seeds and their oils and butters, coconut oil, butter and ghee. Healthy fats also play a key role in reducing insulin resistance and inflammation in the body.<\/li>\n<li><b>Complex<\/b><b> Carbohydrates<\/b> include vegetables (lots), fruit (a small amount), whole grains, nuts\/seeds and legumes.  Complex carbohydrates provide good amounts of nutrients and fibre for regularity and bowel health.<\/li>\n<\/ul>\n<h2><span id=\"What_Should_I_avoid_If_Its_In_A_Packet_Think_Twice_Before_Eating_It\">What Should I avoid?  “If It’s In A Packet – Think Twice Before Eating It!”<\/span><\/h2>\n<p>If you want to lose weight it is vital to reduce and preferably eliminate ALL sugary foods, white processed foods, sweet drinks, and alcohol. Yes, this also includes white rice, pasta, bread, cereals and crackers which all break down into glucose (blood sugar) rapidly. Limiting these heavily processed products will aid in reducing the overall sugar load in your diet, will minimize weight gain and will reduce the insulin resistance in your body cells.  Remember, sugar is the big problem when it comes to insulin resistance, inflammation, increased risk of disease, weight gain, difficulty losing weight and gaining weight back quickly after weight loss stops.<\/p>\n<h3><span id=\"Avoid_Eating_After_7_pm_for_Weight_Loss\">Avoid Eating After 7 pm for Weight Loss<\/span><\/h3>\n<p>Allow the time between 7 pm and 7 am (and occasionally 11 am) to be your time for detoxifying and healing and not digesting. Allow at least a 12-hour “fasting” period overnight so your body has time to rest from digesting food. Make time for detoxifying, rebuilding and healing.  Water or herbal tea is fine to have during this period.<\/p>\n<h3><span id=\"Practice_Intermittent_Fasting\">Practice “<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-weight-loss-type-2\/\">Intermittent Fasting<\/a>”<\/span><\/h3>\n<p>Fasting lowers insulin resistance and ignites the flames of fat burning. Allowing your body 12-16 hours fasting a day will help your body to adjust from burning carbohydrates to burning fat (and reducing your waistline). But only practice longer periods of fasting once your diet has the processed foods OUT…addressing the quality of your diet is crucial before you venture into fasting.<\/p>\n<h3><span id=\"Eat_Smaller_Meals_for_Weight_Loss\">Eat Smaller Meals for Weight Loss<\/span><\/h3>\n<p>So, you’ve reduced the amount of sugary and starchy foods on your plate and included protein, fat and vegetables at each meal, which is great. Now it’s also important to reduce the portion sizes.<\/p>\n<p>Eat smaller meals, on a smaller plate, at each meal of the day.<\/p>\n<p>Over-eating converts surplus nutrients to fat, so eat until you feel satisfied (not full).  Spread meals out but avoid becoming too hungry; starving often leads to reaching for quick, sweet calorie-laden snacks or breads, cereals and crackers. If you snack in between meals make sure these are small and nutrient dense &#8211; like a handful of nuts and seeds or raw vegetables.<\/p>\n<h3><span id=\"Drink_Water_first-Weight_Loss\">Drink Water first-Weight Loss<\/span><\/h3>\n<div id=\"attachment_18380\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18380\" class=\"wp-image-18380 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/03\/Drinkng-water.webp\" alt=\"weight loss after 40 before and after\" width=\"706\" height=\"340\" \/><p id=\"caption-attachment-18380\" class=\"wp-caption-text\">finally lost weight at 40<\/p><\/div>\n<p>Every time you feel like snacking, you may want to have a glass of water first. We can misread dehydration and the body’s need for water as a feeling of hunger.  If you still feel hungry after the water, then eat. Often, however, the ‘false hunger’ sensation will go away and you won’t have to overeat to satisfy thirst.<\/p>\n<p>The importance of water can’t be emphasized enough – drink at least 1½ &#8211; 2 liters a day and more if it’s hot or you’re training. The old adage of “8 glasses of water a day” (if each glass is one oz., that adds up to 1.9 liters) is easy to remember. Remember: A hydrated body is a clean, energized body! Put slices of lemon or other fruit, ginger, mint etc into your water if you find water bland.<\/p>\n<h3><span id=\"Exercise_Build_Muscle\">Exercise, Build Muscle<\/span><\/h3>\n<p>Implement a well-rounded exercise regimen that includes strength training to build muscle (for every pound of muscle that you gain, your body burns 50-70 calories more per day), as well as high intensity interval training (HIT), which has been demonstrated to lower insulin resistance and significantly increase fat loss.<\/p>\n<h3><span id=\"Sleep_Well_Weight_Loss\">Sleep Well, Weight Loss<\/span><\/h3>\n<p>Sleep deprivation can throw off your internal clock—and your eating habits. In a recent study, sleep researches from the University of Colorado found that “people who sleep less tend to eat more calories than their well-rested counterparts”.  As we sleep, our bodies secrete growth hormone, which builds and repairs muscle. If you don’t sleep enough, that muscle mass breaks down. What’s more, if you stay awake at the time that you should be sleeping, your body is forced to keep insulin levels higher, contributing to the insulin resistance and inflammation.<\/p>\n<p>Make it a non-negotiable part of your day to get to bed early and rise early after having 7-9 hours sleep every day.<\/p>\n<h3><span id=\"De-stress\">De-stress<\/span><\/h3>\n<p>Minimize stress as much as possible. The hormone cortisol is produced when you are in a stressed state and this directly affects fat storage and weight gain.  Vitamin C and B Vitamins can aid in supporting the adrenals and minimizing the stress response and subsequent potential weight gain.<\/p>\n<h2><span id=\"Dietary_Supplements_to_Support_Weight_Loss\">Dietary Supplements to Support Weight Loss<\/span><\/h2>\n<h3><span id=\"Calcium\">Calcium<strong> <\/strong><\/span><\/h3>\n<p>Studies have shown that calcium, supplemented at 1100 – 1200mg per day, results in central fat loss, improvements in blood pressure, insulin sensitivity and retention of lean tissue. Remember: Calcium must always be balance by magnesium and Vitamin K.<\/p>\n<h3><span id=\"Vitamin_D\">Vitamin D<\/span><\/h3>\n<p>It’s been known for some time that vitamin D deficiency is associated with developing obesity and with health problems linked to obesity. A study presented at the 2015 European Congress on Obesity demonstrated that correcting levels of vitamin D (at 2000-5000IU a day) can help with weight loss, reducing waist circumference and improving blood sugar control in Vitamin D-deficient individuals. Testing for vitamin D levels once every 6 months may be advisable for those supplementing at healthy doses.<\/p>\n<h3><span id=\"Fish_Oil\">Fish Oil<\/span><\/h3>\n<p>Excess weight is associated with increased inflammation and fish oil is a major player when it comes to dampening this internal flame; thus improving insulin sensitivity, lowering triglyceride levels and supporting weight loss. 1-4grams a day are often found to work for many. Do remember: If you have any health condition that leads to low platelets in your blood, fish oil, rich in Omega 3 and with the ability to thin the blood, must be used with caution.<\/p>\n<h3><span id=\"Chromium\"><a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/chromium-for-diabetes-type-2\/\">Chromium<\/a><\/span><\/h3>\n<p>Chromium can reduce sugar cravings, which is a benefit when trying to lose weight. Chromium is an essential nutrient for normal carbohydrate metabolism; it enhances the action of insulin and reduces insulin resistance.  Doses of supplemental chromium ranging from 200 mcg\/day to 1,000 mcg\/day improve blood sugar by enhancing the effects of insulin.<\/p>\n<h3><span id=\"Zinc\">Zinc<\/span><\/h3>\n<p>Zinc is an essential mineral known to play a part in all human living cells and, important to weight loss, plays a key role in thyroid health and metabolism.  Zinc deficiency is known to be associated with insulin resistance in obese individuals and zinc supplementation reduces insulin levels and insulin resistance in both diabetics and non-diabetics. According to clinical studies, zinc supplementation of 30mg per day is beneficial in reducing insulin resistance and therefore, as a flow on, is beneficial to weight loss. Please note: Long term zinc supplementation must be accompanied by copper supplementation as these two minerals need to be balanced in the body.<\/p>\n<h3><span id=\"Magnesium\">Magnesium<\/span><\/h3>\n<p>Magnesium plays an essential role in most biological process in the body, many of which concern glucose disposal and insulin sensitivity.  Magnesium is required to reduce insulin resistance and improve metabolic control, which positively impacts weight loss.  It also helps with constipation and regularity, which will again have an impact on the ability to lose weight, detoxify, gain energy and function optimally.<\/p>\n<h3><span id=\"Chocolate_And_Green_Tea\">Chocolate And Green Tea<\/span><\/h3>\n<p>Polyphenols, found in green tea and cocoa, are powerful factors to reduce insulin resistance and are potent anti-inflammatory compounds.  A study comparing the effects of 90% dark chocolate, containing beneficial cocoa polyphenols, with white chocolate (non-cocoa), at a 100 grams per day for 15 days, showed that only dark chocolate improved insulin sensitivity.  There’s a delicious way to weight loss! Green tea consumption reduces food intake, decreases leptin levels, waist circumference and body weight and increases thermogenesis.<\/p>\n<p>Know more about our program: <a href=\"https:\/\/www.sepalika.com\/our-programs\/weight-loss\/\">We take the guesswork out of weight loss<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Age forty is a milestone that many of us dread; the number conjures up thoughts of ever increasing waistlines. So what should you eat to keep your weight in check?<\/p>\n","protected":false},"author":25,"featured_media":18481,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[56,90,36,43,46,39],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Struggling With Weight Loss? Insulin Resistance Could be The Culprit!<\/title>\n<meta name=\"description\" content=\"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Struggling With Weight Loss? Insulin Resistance Could be The Culprit!\" \/>\n<meta property=\"og:description\" content=\"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/karena.oldham.98\" \/>\n<meta property=\"article:published_time\" content=\"2016-05-25T12:44:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-04T08:11:39+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Karena Tonkin, Health Coach\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp\",\"width\":400,\"height\":159,\"caption\":\"how to reverse insulin resistance and lose weight\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/\",\"name\":\"Struggling With Weight Loss? Insulin Resistance Could be The Culprit!\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#primaryimage\"},\"datePublished\":\"2016-05-25T12:44:50+00:00\",\"dateModified\":\"2021-12-04T08:11:39+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/2546aa7ad27870a4de017cd30fcb96ec\"},\"description\":\"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Weight Loss Struggle After Forty – Insulin Resistance Could Be The Culprit!\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/2546aa7ad27870a4de017cd30fcb96ec\",\"name\":\"Karena Tonkin, Health Coach\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Karena Tonkin, Health Coach\"},\"description\":\"Karena is a clinical nutritionist, health coach, writer and presenter.  She runs a private practice dedicated to the integrative and holistic treatment of adults and children with chronic physical and mental conditions and is passionate about educating individuals in health and wellbeing. Karena feels that education through speaking and writing helps prevent chronic illness and directly influences the success of individuals, families and communities as a whole.\",\"sameAs\":[\"https:\/\/www.karenatonkin.com\/\",\"https:\/\/www.facebook.com\/karena.oldham.98\"],\"url\":\"https:\/\/www.sepalika.com\/author\/karena-tonkin\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Struggling With Weight Loss? Insulin Resistance Could be The Culprit!","description":"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/","og_locale":"en_US","og_type":"article","og_title":"Struggling With Weight Loss? Insulin Resistance Could be The Culprit!","og_description":"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.","og_url":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/karena.oldham.98","article_published_time":"2016-05-25T12:44:50+00:00","article_modified_time":"2021-12-04T08:11:39+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Karena Tonkin, Health Coach","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/05\/admin-ajax-12.webp","width":400,"height":159,"caption":"how to reverse insulin resistance and lose weight"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/","name":"Struggling With Weight Loss? Insulin Resistance Could be The Culprit!","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#primaryimage"},"datePublished":"2016-05-25T12:44:50+00:00","dateModified":"2021-12-04T08:11:39+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/2546aa7ad27870a4de017cd30fcb96ec"},"description":"With insulin resistance, your body is unable to convert food to energy. The extra energy is now turned into fat and weight loss becomes a big struggle.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-insulin-resistance\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Weight Loss Struggle After Forty – Insulin Resistance Could Be The Culprit!"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/2546aa7ad27870a4de017cd30fcb96ec","name":"Karena Tonkin, Health Coach","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Karena Tonkin, Health Coach"},"description":"Karena is a clinical nutritionist, health coach, writer and presenter.  She runs a private practice dedicated to the integrative and holistic treatment of adults and children with chronic physical and mental conditions and is passionate about educating individuals in health and wellbeing. Karena feels that education through speaking and writing helps prevent chronic illness and directly influences the success of individuals, families and communities as a whole.","sameAs":["https:\/\/www.karenatonkin.com\/","https:\/\/www.facebook.com\/karena.oldham.98"],"url":"https:\/\/www.sepalika.com\/author\/karena-tonkin\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1255"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=1255"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1255\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18481"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=1255"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=1255"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=1255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}