{"id":12694,"date":"2017-08-02T08:00:44","date_gmt":"2017-08-02T15:00:44","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12694"},"modified":"2022-01-26T11:27:28","modified_gmt":"2022-01-26T05:57:28","slug":"heart-rate-variability","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/","title":{"rendered":"Heart Rate Variability Measurement: The Secret Test for Impending Heart Attacks?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#A_Refresher_On_The_Theory_Weve_all_Grown_Up_Believing\"><span class=\"toc_number toc_depth_1\">1<\/span> A Refresher On The Theory We’ve all Grown Up Believing<\/a><\/li><li><a href=\"#An_Alternative_and_more_Plausible_Theory\"><span class=\"toc_number toc_depth_1\">2<\/span> An Alternative (and more Plausible) Theory<\/a><\/li><li><a href=\"#So_what_is_Heart_Rate_Variability_after_all_and_how_is_it_connected\"><span class=\"toc_number toc_depth_1\">3<\/span> So what is Heart Rate Variability after all and how is it connected?<\/a><\/li><li><a href=\"#How_is_Heart_Rate_Variability_Measured\"><span class=\"toc_number toc_depth_1\">4<\/span> How is Heart Rate Variability Measured?<\/a><\/li><li><a href=\"#Implications_of_HRV_Measurement_for_Athletes\"><span class=\"toc_number toc_depth_1\">5<\/span> Implications of HRV Measurement for Athletes<\/a><\/li><li><a href=\"#Parting_Thoughts\"><span class=\"toc_number toc_depth_1\">6<\/span> Parting Thoughts<\/a><\/li><\/ul><\/div>\n<p>Col. Gene Montague came to the Ironman 70.3 Chattanooga Triathlon in May last year. In spite of spending days in preparing for the event, he wasn’t able to complete the competition. Because while swimming the Tennessee River during the swim portion of the triathlon, he <a href=\"http:\/\/www.wrcbtv.com\/story\/32034995\/update-athlete-dies-from-heart-attack-during-ironman-703-chattanooga\" target=\"_blank\" rel=\"noopener noreferrer\">suffered a massive heart attack and died<\/a> on the spot. Col. Montague was still on active duty in the United States Army and a war veteran in Kosovo and Afghanistan. Prior to joining the army, he was a New York City Police Officer. So how did an active army officer suffer from a heart attack when he was cleared medically to take part in a grueling competition?<\/p>\n<p>Co. Montague isn’t the only “apparently healthy” athlete to have suffered a heart attack while playing a sport. Many elite athletes as well as healthy and active sport hobbyists have died while competing in a marathon or a triathlon after being declared as fit to participate. Before competing in such grueling competitions, every athlete is required to undergo, among other tests, a CT scan to check if their coronary arteries are healthy enough to provide sufficient blood to the heart during the competition. Only if the arteries are clean and without blockages does the doctor certify an athlete as healthy and permits them to participate in the sport.<\/p>\n<p>A heart attack is a medical emergency caused by a blockage in one or more coronary arteries (vessels that supply fresh blood to the heart muscles.) The heart is like a device that pumps fresh blood to the whole body, including to itself. During a heart attack, the blockage prevents the main tissue of the heart from receiving oxygenated blood. This lack of blood and oxygen supply can damage the heart muscle, especially when the supply of blood stops for more than 20 minutes. Failure of a part of muscle tissue to get blood can lead to its death (necrosis). The blockage of blood supply to the heart muscle is known as ischemia that results in a heart attack.<\/p>\n<p>This is the conventional thought behind the cause of a heart attack. But if the athletes who died had no blockages, how did they suffer from a heart attack? Is there another reason for a heart attack, a reason most people are not aware of? The answer is yes. And the reason is <strong>heart rate variability<\/strong>.<\/p>\n<h2><span id=\"A_Refresher_On_The_Theory_Weve_all_Grown_Up_Believing\">A Refresher On The Theory We’ve all Grown Up Believing<\/span><\/h2>\n<p>According to conventional medical wisdom, the most common cause of a heart attack is <a href=\"https:\/\/www.nhlbi.nih.gov\/health\/health-topics\/topics\/heartattack\/causes\" target=\"_blank\" rel=\"noopener noreferrer\">coronary artery blockage<\/a>. In this condition, coronary arteries (arteries that supply blood to the heart) become hard and narrow due to atherosclerosis (the build-up of fatty plaques or atheroma within the walls of arterial blood vessels.) These plaques are comprised of platelets, clots, and cholesterol.<\/p>\n<p>With time, thickened walls reduce blood circulation through the coronary artery or even completely block the artery. This causes myocardial infarction (commonly known as heart attack.) Another reason for heart attacks is spasm or even sudden severe tightening of the coronary artery, which impedes blood supply. This can occur even when coronary artery disease is not present. Coronary artery spasm may appear due to severe psychological stress, smoking, exposure to extreme cold, or use of harmful drugs.<\/p>\n<p>To avoid the risks of a heart attack, drugs like statins and beta blockers are prescribed in standard medical practice. The objective is to reduce cholesterol content in the body in order to prevent formation of plaque and reduce heart fatigue by slowing down the heart rate. Also, surgical procedures like stenting and cardiac bypass are used to open up the cardiac arteries, especially after a heart attack.<\/p>\n<h2><span id=\"An_Alternative_and_more_Plausible_Theory\">An Alternative (and more Plausible) Theory<\/span><\/h2>\n<div id=\"attachment_19905\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/An-Alternative-and-more-Plausible-Theory.webp\"><img aria-describedby=\"caption-attachment-19905\" class=\"wp-image-19905 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/An-Alternative-and-more-Plausible-Theory.webp\" alt=\"Heart rate variability measurement\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19905\" class=\"wp-caption-text\">An Alternative (and more Plausible) Theory<\/p><\/div>\n<p>When the coronary blockage theory was suggested during the 1940s, a vast majority of cardiologists did not accept it. Their argument: There are many arteries in the body that get blocked due to plaque buildup, and yet only the coronary arteries suffered from decreased blood flow during a heart attack. They said that even arteries supplying blood to major organs like spleen and kidneys are affected by plaque deposition, but people never suffer from a kidney attack or a spleen attack.<\/p>\n<p>Studies and research into the way conventional medication works led scientists to believe that there is something different and deeper at work here. Dr. Quintiliano H. D. Mesquita proposed an alternative theory called the “<a href=\"http:\/\/www.infarctcombat.org\/MyogenicTheoryExplains.html\" target=\"_blank\" rel=\"noopener noreferrer\">Myogenic Theory of Myocardial Infarction<\/a>” in 1972 to explain the real <strong>causes of heart attack<\/strong>. According to this theory, the real cause of a heart attack is not blockage of coronary arteries but a chemical process within the heart muscles that lead to their failure. The theory was built upon further by Dr. Knut Sroka and Dr. Thomas Cowan.<\/p>\n<p>Simply put, the events leading to an MI (myocardial infarction, or heart attack) start with a stress on the heart muscles. This stress, which can either be physical or emotional, increases the production of adrenaline. Subsequently, this results in an increased heart rate. To meet this excess demand, heart muscle cells start breaking down glucose instead of its preferred energy sources – ketones and fatty acids. This increases lactic acidosis (accumulation of lactic acid) in heart muscle cells.<\/p>\n<p>The resulting acidosis does not allow a vital mineral – calcium – to enter the heart muscle cells. In the absence of calcium, the cells are unable to contract easily. The inability of cells to contract causes edema (exudation of liquid), dysfunction of cell walls, and eventually necrosis. The edema causes pressure build up, which ruptures the unstable plaques causing further blockage. This is <strong>what causes angina <\/strong>or the pain in the chest and down the left arm, which usually accompanies a heart attack.<\/p>\n<h2><span id=\"So_what_is_Heart_Rate_Variability_after_all_and_how_is_it_connected\">So what is Heart Rate Variability after all and how is it connected?<\/span><\/h2>\n<p>Dr. Thomas Cowan, one of the advocates of the myogenic theory, has done a great deal of research on how heart rate variability is the perfect measure of heart health. Here’s a gist of his<a href=\"http:\/\/www.faim.org\/sites\/default\/files\/documents\/What-Causes-Heart-Attacks-Cowan-reprint.pdf\" target=\"_blank\" rel=\"noopener noreferrer\"> thoughts <\/a>on the subject.<\/p>\n<p>Our nervous system is divided into two branches – the central nervous system (CNS) and the autonomic nervous system (ANS). The CNS controls conscious functions whereas the ANS controls functions of the internal organs.<\/p>\n<p>The ANS is further divided into sympathetic and parasympathetic nervous systems. The sympathetic nervous system controls the fight-or-flight response of our body. It tells the body if and when it is at risk and prepares it to deal with threats. It triggers biochemical reactions that hasten the breaking down of glucose to produce sufficient energy to either run from or fight the danger. The parasympathetic nervous system, on the other hand, controls the rest-and-digest response, which tells the body to relax. The main nerve of this system is the vagus nerve, which passes through the heart and indicates it to relax.<\/p>\n<p>Normally, both the sympathetic and parasympathetic branches of the ANS are in a state of balance. An imbalance in these branches is what causes the majority of heart diseases. Heart rate variability (HRV) monitoring provides an accurate and real-time depiction of the status of these two systems. In simple terms, it measures how well your system is ready to return back to rest after being subject to stress.<\/p>\n<p>Research proves that depressed heart rate variability is an independent predictor of death in patients with congestive heart failure and idiopathic dilated cardiomyopathy (around 50% of cases of heart failure in which cause remains unknown initially.)<\/p>\n<h2><span id=\"How_is_Heart_Rate_Variability_Measured\">How is Heart Rate Variability Measured?<\/span><\/h2>\n<div id=\"attachment_19906\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/How-is-Heart-Rate-Variability-Measured.webp\"><img aria-describedby=\"caption-attachment-19906\" class=\"wp-image-19906 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/How-is-Heart-Rate-Variability-Measured.webp\" alt=\"Heart rate variability measurement\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19906\" class=\"wp-caption-text\">How is Heart Rate Variability Measured?<\/p><\/div>\n<p>Contrary to popular thinking, our heart does not beat in a perfect rhythm. There is slight variation between beats, and this beat-to-beat variation is known as Heart Rate Variability. In general, the more relaxed the body, the more variable is the time between beats. When the body is under stress, HRV is reduced.<\/p>\n<p>The picture shows a typical ECG. Heart Rate Variability is calculated by measuring the time between consecutive R spikes on the ECG trace. Heart Rate Variability is measured using a sensor and a monitor. The sensor is usually a patch-like device that can be worn on the finger or on the chest. It captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.<\/p>\n<p>Using the HRV monitoring system, you set a baseline over a few days by measuring your HRV every morning during a one-minute test. Once you’ve built up a baseline, you can compare your daily measurements with your baseline values to determine if there are any significant changes.<\/p>\n<h2><span id=\"Implications_of_HRV_Measurement_for_Athletes\">Implications of HRV Measurement for Athletes<\/span><\/h2>\n<p>If only Col. Gene Montague had measured his HRV prior to participating in the competition, he would probably have been alive. HRV measurements are now increasingly being used by athletes and trainers. This helps them in understanding how much stress their bodies can take and avoid overtraining, because it can put athletes out of action for days or even weeks before they can get back to full fitness. Vincenzo Manzi and colleagues found that daily HRV monitoring can help avoid overtraining and can also make training more effective.<\/p>\n<p>If your HRV readings drop significantly, it means you are overloading your system and it is time to stop. A small drop is expected, because training is a physical stressor and can (and should) activate the sympathetic nervous system. But after sufficient rest, your HRV readings should increase and get back to normal. If they are still low even after rest, you could be in trouble and need to check with your physician.<\/p>\n<h2><span id=\"Parting_Thoughts\">Parting Thoughts<\/span><\/h2>\n<p>HRV is a measurement that can warn you of an impending danger – a heart failure. By monitoring your heart beats, you can heed the warning signals better and can be prepared to deal with unforeseen eventualities related to your heart. Technological advancements have made it easy for anyone to measure their HRV in the cozy confines of their homes and stay in tune with their heart beats.<\/p>\n<p>The human body is more complicated than what we were made to believe. The idea that the heart is a simple pump comes from our attempt to see the body as a mere collection of moving parts. There are mysteries in this fascinating creation that can keep us hooked for generations to come. With newer discoveries around how our body works, traditional theories are coming under scrutiny. The human body is a holistic creation, and problems in one part can affect a completely unrelated part. Rigorous studies are required to unearth vital information that will help us in understanding how and when our body fails and what signals it provides to warn us of an impending calamity. Such insights can save us from unpleasant surprises and allow us to live a life full of lasting health and wellness.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 A Refresher On The Theory We’ve all Grown Up Believing2 An Alternative (and more Plausible) Theory3 So what is Heart Rate Variability after all and how is it connected?4 How is Heart Rate Variability Measured?5 Implications of HRV Measurement for Athletes6 Parting Thoughts Col. Gene Montague came to the Ironman 70.3 Chattanooga [&hellip;]<\/p>\n","protected":false},"author":85,"featured_media":19907,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[106],"tags":[107],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Heart Rate Variability Measurement: The Secret Test for Heart Attacks<\/title>\n<meta name=\"description\" content=\"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Heart Rate Variability Measurement: The Secret Test for Heart Attacks\" \/>\n<meta property=\"og:description\" content=\"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\" \/>\n<meta property=\"article:published_time\" content=\"2017-08-02T15:00:44+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-26T05:57:28+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jitendra Rathod\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp\",\"width\":706,\"height\":340,\"caption\":\"Heart rate variability measurement\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/\",\"name\":\"Heart Rate Variability Measurement: The Secret Test for Heart Attacks\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#primaryimage\"},\"datePublished\":\"2017-08-02T15:00:44+00:00\",\"dateModified\":\"2022-01-26T05:57:28+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\"},\"description\":\"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Heart Rate Variability Measurement: The Secret Test for Impending Heart Attacks?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\",\"name\":\"Jitendra Rathod\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Jitendra Rathod\"},\"description\":\"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.\",\"sameAs\":[\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\"],\"url\":\"https:\/\/www.sepalika.com\/author\/jitendra\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Heart Rate Variability Measurement: The Secret Test for Heart Attacks","description":"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/","og_locale":"en_US","og_type":"article","og_title":"Heart Rate Variability Measurement: The Secret Test for Heart Attacks","og_description":"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.","og_url":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs","article_published_time":"2017-08-02T15:00:44+00:00","article_modified_time":"2022-01-26T05:57:28+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Jitendra Rathod","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Heart-Rate-Variability-Measurement-Header-1.webp","width":706,"height":340,"caption":"Heart rate variability measurement"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#webpage","url":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/","name":"Heart Rate Variability Measurement: The Secret Test for Heart Attacks","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#primaryimage"},"datePublished":"2017-08-02T15:00:44+00:00","dateModified":"2022-01-26T05:57:28+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d"},"description":"Heart rate variability measurement captures data from heart beats and transfers it to a monitor, which is usually a smartphone app.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/heart\/heart-rate-variability\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Heart Rate Variability Measurement: The Secret Test for Impending Heart Attacks?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d","name":"Jitendra Rathod","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Jitendra Rathod"},"description":"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.","sameAs":["https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs"],"url":"https:\/\/www.sepalika.com\/author\/jitendra\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12694"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/85"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12694"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12694\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19907"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12694"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12694"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12694"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}