{"id":12956,"date":"2017-08-11T20:00:12","date_gmt":"2017-08-11T20:00:12","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12956"},"modified":"2022-01-27T16:55:46","modified_gmt":"2022-01-27T11:25:46","slug":"antibiotics-for-kids","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/","title":{"rendered":"Antibiotics for Kids: Know The Dangers &#038; Health Tips When They Are Unavoidable"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Antibiotics_Are_Not_Magic_Pills\"><span class=\"toc_number toc_depth_1\">1<\/span> Antibiotics Are Not Magic Pills<\/a><\/li><li><a href=\"#Repeated_Antibiotic_Use_Can_Have_Serious_Long-Term_Consequences\"><span class=\"toc_number toc_depth_1\">2<\/span> Repeated Antibiotic Use Can Have Serious Long-Term Consequences <\/a><ul><li><a href=\"#Antibiotics_Wipe_Out_Healthy_Gut_Bacteria\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Antibiotics Wipe Out Healthy Gut Bacteria<\/a><\/li><li><a href=\"#Overuse_May_Make_Your_Child_Resistant_To_Antibiotics\"><span class=\"toc_number toc_depth_2\">2.2<\/span> Overuse May Make Your Child Resistant To Antibiotics<\/a><\/li><li><a href=\"#Antibiotics_Can_Make_Your_Child_Obese\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Antibiotics Can Make Your Child Obese<\/a><\/li><li><a href=\"#Antibiotics_Can_Cause_Long-Term_Damage_To_Intestines\"><span class=\"toc_number toc_depth_2\">2.4<\/span> Antibiotics Can Cause Long-Term Damage To Intestines<\/a><\/li><li><a href=\"#Antibiotics_Make_Your_Child_Vulnerable_To_Allergies\"><span class=\"toc_number toc_depth_2\">2.5<\/span> Antibiotics Make Your Child Vulnerable To Allergies<\/a><\/li><\/ul><\/li><li><a href=\"#When_Your_Child_Doesnt_Need_Antibiotics\"><span class=\"toc_number toc_depth_1\">3<\/span> When Your Child Doesn’t Need Antibiotics?<\/a><\/li><li><a href=\"#Sometimes_Antibiotics_Are_Necessary\"><span class=\"toc_number toc_depth_1\">4<\/span> Sometimes Antibiotics Are Necessary<\/a><\/li><li><a href=\"#5_Health_Tips_When_Antibiotics_Are_Unavoidable_For_Kids\"><span class=\"toc_number toc_depth_1\">5<\/span> 5 Health Tips When Antibiotics Are Unavoidable For Kids<\/a><ul><li><a href=\"#Take_special_care_of_your_childs_diet\"><span class=\"toc_number toc_depth_2\">5.1<\/span> Take special care of your child’s diet<\/a><\/li><li><a href=\"#Probiotics_are_your_childs_best_friends\"><span class=\"toc_number toc_depth_2\">5.2<\/span> Probiotics are your child’s best friends!<\/a><\/li><li><a href=\"#Supplement_with_Vitamin_K\"><span class=\"toc_number toc_depth_2\">5.3<\/span> Supplement with Vitamin K<\/a><\/li><li><a href=\"#Ensure_Your_Child_Practices_Good_Hygiene\"><span class=\"toc_number toc_depth_2\">5.4<\/span> Ensure Your Child Practices Good Hygiene<\/a><\/li><li><a href=\"#Always_complete_the_course_of_antibiotics\"><span class=\"toc_number toc_depth_2\">5.5<\/span> Always complete the course of antibiotics<\/a><\/li><\/ul><\/li><li><a href=\"#The_Takeaway\"><span class=\"toc_number toc_depth_1\">6<\/span> The Takeaway<\/a><\/li><\/ul><\/div>\n<p>Your kid is running a fever and is too sick to eat, and you’ve called your paediatrician ten times to check when he’s coming into office so you can get a prescription for some ‘’magic pills’’, a.k.a antibiotics. You do this in the hopes that your child will bounce back quicker as the antibiotics wipe out all the bad bugs. But antibiotics are not always the answer — and when it comes to kids, they can sometimes do more harm than good.<\/p>\n<h2><span id=\"Antibiotics_Are_Not_Magic_Pills\">Antibiotics Are Not Magic Pills<\/span><\/h2>\n<p>These days, antibiotics are prescribed to kids recklessly. And while antibiotics save lives when you’re dealing with a serious bacterial infection, they are often completely ineffective and unnecessary for treating viral infections.<\/p>\n<blockquote><p>The reality is many common childhood illnesses are caused by viruses that are completely resistant to antibiotics.<\/p><\/blockquote>\n<p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/22065263?dopt=Abstract&amp;holding=npg\" target=\"_blank\" rel=\"noopener noreferrer\">Research data<\/a> reveals that antibiotics are commonly prescribed for children with conditions for which they provide no benefit, including viral respiratory infections. And giving your kid these ‘magic pills’ is doing nothing but wiping out healthy gut bacteria, reducing immunity and wreaking havoc on metabolism.<\/p>\n<p>We’re guessing that’s NOT what you want, right?! So let’s discuss how overuse of antibiotics is actually detrimental to your <a href=\"https:\/\/www.sepalika.com\/living-well\/vaccines-good-or-bad\/\" data-wplink-edit=\"true\">child’s health<\/a>, and learn strategies to reduce the need for antibiotics as well as minimizing gut microbiome damage when your little one does need an antibiotic course.<strong> <\/strong><\/p>\n<h2><span id=\"Repeated_Antibiotic_Use_Can_Have_Serious_Long-Term_Consequences\">Repeated Antibiotic Use Can Have Serious Long-Term Consequences<strong> <\/strong><\/span><\/h2>\n<p>Your pediatrician may have warned you against antibiotic-associated diarrhea, colitis, thrush and other skin allergies in children. But did you know that repeated antibiotic use during childhood is associated with more serious long-term health repercussions?<\/p>\n<h3><span id=\"Antibiotics_Wipe_Out_Healthy_Gut_Bacteria\">Antibiotics Wipe Out Healthy Gut Bacteria<\/span><\/h3>\n<p>The human microbiome consists of millions of healthy gut bacteria that play an important role in not only proper digestion, but also immune function, detoxification, inflammation, weight management and metabolism. Sadly, antibiotics don’t just target bad bacteria making us sick; they also wipe out all the healthy gut bacteria, creating an imbalance which may be particularly damaging for children because their immunity isn’t yet developed fully. Studies have revealed that antibiotic use in children produced long-term changes to gut microbiome.<\/p>\n<div class=\"arti-addon\">Related: <a href=\" https:\/\/www.sepalika.com\/living-well\/how-are-good-bacteria-beneficial-to-the-body\/\">How Are Good Bacteria Beneficial To The Body<\/a><\/div>\n<p>A study published in 2006 in American Academy of Pediatrics found that antibiotic use during infancy was associated with decreased numbers of beneficial gut bacteria (namely bifidobacteria and <em>Bacteroides<\/em>). A Finnish study found that early-life antibiotic use is associated with increased risk for metabolic and immunological diseases and concluded that the impact on the intestinal microbiota should be considered when prescribing antibiotics, without compromising clinical practice. The study found antibiotic use in childhood is associated with marked changes in the intestinal microbiota composition which persist for over 6 months and up till 2 years after a course of antibiotics.<\/p>\n<blockquote><p>This impact of antibiotics on gut bacteria could be the culprit behind many other childhood problems like allergies and childhood obesity.<\/p><\/blockquote>\n<h3><span id=\"Overuse_May_Make_Your_Child_Resistant_To_Antibiotics\">Overuse May Make Your Child Resistant To Antibiotics<\/span><\/h3>\n<p>Antibiotic overuse results in pathogenic bacteria becoming resistant to antibiotics. Some of these potentially dangerous bacteria which become immune to antibiotics could become “super bugs” with no known cure.<\/p>\n<p><a href=\"http:\/\/www.bmj.com\/content\/313\/7054\/387?linkType=FULL&amp;ck=nck&amp;resid=313\/7054\/387&amp;journalCode=bmj\" target=\"_blank\" rel=\"noopener noreferrer\">Scientists conducted a cross-sectional study<\/a> across five different communities in Iceland to find that antimicrobials increase the carriage rate of penicillin resistant pneumococci in children. They concluded that reducing the usage of antimicrobials, especially in children, is likely to be effective in preventing or reducing the spread of penicillin resistant and multi-resistant pneumococci.<\/p>\n<h3><span id=\"Antibiotics_Can_Make_Your_Child_Obese\">Antibiotics Can Make Your Child Obese<\/span><\/h3>\n<p>We mentioned above that antibiotics cause changes in gut microbiome, which may be a reason why children who are given antibiotics often tend to become overweight.<\/p>\n<p>This has been proven by a <a href=\"http:\/\/www.nature.com\/ijo\/journal\/v40\/n4\/abs\/ijo2015218a.html\" target=\"_blank\" rel=\"noopener noreferrer\">study done at Johns Hopkins Bloomberg School of Public Health, Baltimore<\/a> that found evidence of reversible, persistent and progressive effects of antibiotic use on BMI trajectories, with different effects by age, among mainly healthy children. The results suggest that antibiotic use may influence weight gain throughout childhood and not just during the earliest years, as suggested by most prior studies.<\/p>\n<h3><span id=\"Antibiotics_Can_Cause_Long-Term_Damage_To_Intestines\">Antibiotics Can Cause Long-Term Damage To Intestines<\/span><\/h3>\n<p>Antibiotics have been linked to gut inflammation, leading to long-term ramifications. A <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/20966024\" target=\"_blank\" rel=\"noopener noreferrer\">study done at Statens Serum Institut, Copenhagen, Denmark<\/a> warns against antibiotic use in childhood and its potential as an environmental risk factor for Inflammatory Bowel Diseases (IBD.) In fact, the study found that children who took up to 7 courses of antibiotics during their childhood were 3 times more likely to develop Crohn’s disease, a type of IBD, which causes inflammation of the digestive tract.<\/p>\n<h3><span id=\"Antibiotics_Make_Your_Child_Vulnerable_To_Allergies\">Antibiotics Make Your Child Vulnerable To Allergies<\/span><\/h3>\n<p>Several studies have been conducted to investigate the associations between the use of antibiotics and symptoms of allergies in children. Research done in New Zealand found a clear link between antibiotic use in the first year of life and current symptoms of asthma, rhinoconjunctivitis, and eczema in children 6 and 7 years old. Another <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/17413050\" target=\"_blank\" rel=\"noopener noreferrer\">Canadian study<\/a> found that antibiotic use in early life was associated with the development of childhood asthma, a risk that may be reduced by avoiding the use of broad-spectrum antibiotics like cephalosporins.<\/p>\n<p>Related article: https:\/\/www.sepalika.com\/asthma\/2-revolutionary-methods-for-treating-kids-with-asthma\/<\/p>\n<h2><span id=\"When_Your_Child_Doesnt_Need_Antibiotics\">When Your Child Doesn’t Need Antibiotics?<\/span><\/h2>\n<div id=\"attachment_19944\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/When-Your-Child-Doesnt-Need-Antibiotics.webp\"><img aria-describedby=\"caption-attachment-19944\" class=\"wp-image-19944 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/When-Your-Child-Doesnt-Need-Antibiotics.webp\" alt=\"antibiotics for kids\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19944\" class=\"wp-caption-text\">When Your Child Doesn’t Need Antibiotics?<\/p><\/div>\n<p>The real villains behind most childhood illnesses are viruses, not bacteria. And as you already know now, antibiotics only work against bacteria and are completely ineffective at treating viral infections. Your child doesn’t need any antibiotics if he\/she has:<\/p>\n<ul>\n<li><u>The Flu<\/u> – It’s caused by viral infection and antibiotics will only make your child feel more tired. While some pediatricians recommend antibiotics to prevent secondary infections, these do more harm than good (<em>unless of course, a secondary bacterial infection has been identified already<\/em>).<\/li>\n<li><u>Upper Respiratory Tract Infectio<\/u>ns – In the USA, only 27.4% of respiratory tract infections are bacterial and it’s <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25225144\" target=\"_blank\" rel=\"noopener noreferrer\">estimated that antibiotics are prescribed<\/a> almost twice as often as expected during outpatient visits, representing an important target for ongoing antimicrobial stewardship interventions.<\/li>\n<li><u>Mild Ear Infections <\/u>– Not all ear infections benefit from antibiotics. Scientists believe that antibiotics are most useful in children below two years of age with bilateral Acute Otitis Media (AOM), or AOM with discharge. For older children with mild disease, an expectant observational approach seems justified. If your child’s ear infection is not better within 2-3 days, antibiotics may be needed.<\/li>\n<li><u>Croup<\/u> – Most cases of croup, which is caused by viral infection, can be treated at home by taking simple steps to help open congested pathways. Using a humidifier or sitting with the child in a steamy bathroom are more effective strategies for managing croup than giving your child antibiotics.<\/li>\n<\/ul>\n<blockquote><p>For all of these illnesses, an antibiotic won’t do your child any good. In fact, what it will most definitely do is kill of all healthy bacteria in the gut and increase chances for more resistant bacterial infections in the future.<\/p><\/blockquote>\n<h2><span id=\"Sometimes_Antibiotics_Are_Necessary\">Sometimes Antibiotics Are Necessary<\/span><\/h2>\n<p>Sometimes antibiotics cannot be avoided, but they are best saved for more serious infections. If your child has a bacterial infection, antibiotics, when chosen carefully and given in the right dose become necessary.<\/p>\n<ul>\n<li><u>Strep Throat<\/u> – While most respiratory infections are viral, this is caused by bacteria called group A Streptococcus and a course of antibiotics is often recommended.<\/li>\n<li><u>Some Ear Infections <\/u>– If your child has not taken any antibiotics in the last 30 days and has a severe bacterial ear infection that doesn’t resolve itself within 2-3 days, a mild antibiotic like liquid amoxicillin may be needed.<\/li>\n<li><u>UTI <\/u>– Urinary Tract Infections are common in children. Those under the age of 2 years need antibiotics as UTIs can cause kidney damage. However, wait for a urine culture report so that your doctor can prescribe the right antibiotic.<\/li>\n<li><u>Impetigo<\/u> – A bacterial skin infection, impetigo needs antibiotics.<\/li>\n<li><u>Big wounds<\/u> with pus formation need to be treated with antibiotics to prevent sepsis.<\/li>\n<\/ul>\n<h2><span id=\"5_Health_Tips_When_Antibiotics_Are_Unavoidable_For_Kids\">5 Health Tips When Antibiotics Are Unavoidable For Kids<\/span><\/h2>\n<div id=\"attachment_19943\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/5-Health-Tips-When-Antibiotics-Are-Unavoidable-For-Kids.webp\"><img aria-describedby=\"caption-attachment-19943\" class=\"wp-image-19943 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/5-Health-Tips-When-Antibiotics-Are-Unavoidable-For-Kids.webp\" alt=\"antibiotics for kids\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19943\" class=\"wp-caption-text\">5 Health Tips When Antibiotics Are Unavoidable For Kids<\/p><\/div>\n<blockquote><p>The best way to prevent antibiotic overuse is to prevent the need for them in the first place. A healthy, nutritious diet composed of dense, whole, nutrient-enriched foods is your child’s best defense against illness.<\/p><\/blockquote>\n<p>Practicing good hygiene also goes a long way towards preventing the spreading of germs.<\/p>\n<p>While it’s a good idea to let milder infections run their course, there are times when your child must take antibiotics. Here are some things you can do to ensure that your child bounces back quickly from his\/her antibiotic medication course:<\/p>\n<h3><span id=\"Take_special_care_of_your_childs_diet\">Take special care of your child’s diet<\/span><\/h3>\n<p>This is the time to ensure your child eats highly nutritious foods like plenty of fruits, vegetables, healthy fats and lean meats. Do no give into your child’s requests for fast foods, as these don’t offer sufficient nutrition. A healthy diet boosts immunity and will give your child the strength he\/she needs to fight off the infection and feel better soon.<\/p>\n<h3><span id=\"Probiotics_are_your_childs_best_friends\">Probiotics are your child’s best friends!<\/span><\/h3>\n<p>They help replenish healthy gut bacteria which may have been wiped out by antibiotics. Give your child probiotic foods like yogurt, kefir, kimchi and sauerkraut.<\/p>\n<p>Related article: How to pick a probiotic?<\/p>\n<h3><span id=\"Supplement_with_Vitamin_K\">Supplement with Vitamin K<\/span><\/h3>\n<p>This may be necessary if your child is on antibiotics for extended amounts of time. This is because antibiotics attack gut bacteria which help make vitamin K, so your child might become deficient. Leafy green vegetables, asparagus, green tea and beef liver are good food sources of vitamin K.<\/p>\n<h3><span id=\"Ensure_Your_Child_Practices_Good_Hygiene\">Ensure Your Child Practices Good Hygiene<\/span><\/h3>\n<p>This becomes particularly important when your child is on antibiotics as their immune system is weak during this time. Have children wash hands frequently so that spread of germs is restricted, and you don’t have to deal with recurrent bacterial infections.<\/p>\n<h3><span id=\"Always_complete_the_course_of_antibiotics\">Always complete the course of antibiotics<\/span><\/h3>\n<p>This is crucial even if your child is feeling better. If you don’t, the bacteria will become resistant to the drug and when your child falls sick again, the drug will simply not work. As a result, you will need stronger antibiotics next time round, which is not something you want.<\/p>\n<h2><span id=\"The_Takeaway\">The Takeaway<\/span><\/h2>\n<p>We are not trying to tell you that antibiotics are evil. Of course, they are important, lifesaving medications and no one can refute their use. However, it’s also important to be aware of the dangers of antibiotic overuse in children, considering that antibiotic-resistant bugs are evolving as a faster rate than drugs to treat them are being developed. Let’s make a conscious effort to use antibiotics wisely in order to help ensure that they&#8217;ll be useful when our children really need them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While antibiotics save lives when you’re dealing with a serious bacterial infection, they are often completely ineffective and unnecessary for treating viral infections.<\/p>\n","protected":false},"author":24,"featured_media":19945,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Antibiotics for Kids: The Dangers &amp; Health Tips | Sepalika<\/title>\n<meta name=\"description\" content=\"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they&#039;ll be useful when our children really need them.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Health Tips Every Mother Must Know Before Giving Kids Antiobiotics\" \/>\n<meta property=\"og:description\" content=\"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they&#039;ll be useful when our children really need them.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-08-11T20:00:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-27T11:25:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Antibiotics-and-kids.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/\",\"name\":\"Antibiotics for Kids: The Dangers & Health Tips | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#primaryimage\"},\"datePublished\":\"2017-08-11T20:00:12+00:00\",\"dateModified\":\"2022-01-27T11:25:46+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they'll be useful when our children really need them.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Antibiotics for Kids: Know The Dangers &#038; Health Tips When They Are Unavoidable\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Antibiotics for Kids: The Dangers & Health Tips | Sepalika","description":"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they'll be useful when our children really need them.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/","og_locale":"en_US","og_type":"article","og_title":"Health Tips Every Mother Must Know Before Giving Kids Antiobiotics","og_description":"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they'll be useful when our children really need them.","og_url":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-08-11T20:00:12+00:00","article_modified_time":"2022-01-27T11:25:46+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Antibiotics-and-kids.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/","name":"Antibiotics for Kids: The Dangers & Health Tips | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#primaryimage"},"datePublished":"2017-08-11T20:00:12+00:00","dateModified":"2022-01-27T11:25:46+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Antibiotics are sometimes unavoidable for kids. Find out how to use antibiotics wisely to ensure that they'll be useful when our children really need them.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/antibiotics-for-kids\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Antibiotics for Kids: Know The Dangers &#038; Health Tips When They Are Unavoidable"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12956"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12956"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12956\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19945"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12956"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12956"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12956"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}