{"id":13283,"date":"2017-08-28T20:00:35","date_gmt":"2017-08-29T03:00:35","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=13283"},"modified":"2022-01-29T17:56:04","modified_gmt":"2022-01-29T12:26:04","slug":"how-to-fast-safely","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/","title":{"rendered":"How To Fast Safely: A Personal Guide to Making It Easier"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Fasting_And_Religions_Everyones_Got_Their_Own_Brand\"><span class=\"toc_number toc_depth_1\">1<\/span> Fasting And Religions: Everyone’s Got Their Own Brand<\/a><\/li><li><a href=\"#The_Easy_Season_to_Fast_Ayurvedic_Wisdom\"><span class=\"toc_number toc_depth_1\">2<\/span> The Easy Season to Fast: Ayurvedic Wisdom<\/a><\/li><li><a href=\"#More_Than_Two_Days_Without_Food_Are_You_Mad\"><span class=\"toc_number toc_depth_1\">3<\/span> More Than Two Days Without Food: Are You Mad???<\/a><\/li><li><a href=\"#Benefits_of_Fasting\"><span class=\"toc_number toc_depth_1\">4<\/span> Benefits of Fasting<\/a><\/li><li><a href=\"#Fasting_Safely_My_experiences_During_57_And_Half_Hours_of_No_Food_or_Water\"><span class=\"toc_number toc_depth_1\">5<\/span> Fasting Safely: My experiences During 57 And Half Hours of No Food or Water<\/a><\/li><li><a href=\"#Breaking_The_Fast_Safely_A_Fine_Art\"><span class=\"toc_number toc_depth_1\">6<\/span> Breaking The Fast Safely: A Fine Art<\/a><\/li><li><a href=\"#Fasting_Safe_Even_For_Patients_With_Chronic_Disease\"><span class=\"toc_number toc_depth_1\">7<\/span> Fasting: Safe Even For Patients With Chronic Disease<\/a><\/li><li><a href=\"#How_Can_I_Make_Fasting_Easier\"><span class=\"toc_number toc_depth_1\">8<\/span> How Can I Make Fasting Easier?<\/a><\/li><li><a href=\"#Fasting_Safely_Who_Should_Not_Try_It_By_Themselves\"><span class=\"toc_number toc_depth_1\">9<\/span> Fasting Safely: Who Should Not Try It By Themselves<\/a><\/li><li><a href=\"#Fasting_The_Last_Bite\"><span class=\"toc_number toc_depth_1\">10<\/span> Fasting: The Last Bite<\/a><\/li><\/ul><\/div>\n<p>57 and a half hours. That’s how long my latest fast lasted. My wife is a Jain and this is the period of holy fasting for followers of this religion. I decided to join in, as much for the health benefits as for the spiritual calmness it brings.<\/p>\n<h2><span id=\"Fasting_And_Religions_Everyones_Got_Their_Own_Brand\">Fasting And Religions: Everyone’s Got Their Own Brand<\/span><\/h2>\n<p>Like most religions in the world, Jainism has an annual period of diet restrictions and fasting. The Christians have <a href=\"https:\/\/www.sepalika.com\/living-well\/easter-feast-amazing-health-benefits-observed-lent\/\">Lent<\/a>, the Muslims have Ramzaan and so on. The Jains call it “chau-masa” or “chatur-maas”, the four-month period when the already vegetarian Jains abstain from eating all tubers and many green vegetables too. Fasts are observed regularly too, for periods ranging from 12 hours to even several months!<\/p>\n<p>The belief is that life is most abundant in India during these monsoon months. Plants and microbes on them are thriving. Jainism is built on the core principle on non-violence or Ahimsa. Therefore, followers refrain from killing too many microscopic living things by unintentionally eating them during this period. Or so goes the modern explanation for the fasts.<\/p>\n<h2><span id=\"The_Easy_Season_to_Fast_Ayurvedic_Wisdom\">The Easy Season to Fast: Ayurvedic Wisdom<\/span><\/h2>\n<p>I find it fascinating that Ayurveda notes a fall in “Jatar-agni” or digestive fire in all people during the monsoons. That is why light, warming, nutritious foods like soups and fresh vegetables are prescribed in this season. The fact that the Jains fast during this time, giving their digestion a rest, seems too apt to be a mere coincidence. I feel the health benefits may have been woven into the religion, to ensure better compliance.<\/p>\n<h2><span id=\"More_Than_Two_Days_Without_Food_Are_You_Mad\">More Than Two Days Without Food: Are You Mad???<\/span><\/h2>\n<p>When most people hear about fasts longer than a few hours, they balk. Most feel it is unscientific, that putting the body through this kind of trouble is foolish torture. We’re told to eat 6-times a day, literally every few waking hours, by nutritionists and doctors alike. Especially when a person is unwell, she is advised to eat, to have “energy to recover”. And yet, the human body has evolved to fast, as much as it is meant to feast.<\/p>\n<h2><span id=\"Benefits_of_Fasting\">Benefits of Fasting<\/span><\/h2>\n<div id=\"attachment_20099\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Benefits-of-Fasting.webp\"><img aria-describedby=\"caption-attachment-20099\" class=\"wp-image-20099 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Benefits-of-Fasting.webp\" alt=\"how to fast safely\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20099\" class=\"wp-caption-text\">Benefits of Fasting<\/p><\/div>\n<p>Jason Fung, M.D., explains this in his new book, ‘The Complete Guide to Fasting: Heal Your Body Through Intermittent, Alternate-Day, and Extended Fasting’.<\/p>\n<p>“Fasting’s most obvious benefit is weight loss. However, there are a myriad of benefits beyond this, many of which were widely known before the modern era.<\/p>\n<p>Benefits of Fasting: He goes on to list the following body-wide advantages of fasting:<\/p>\n<ul>\n<li>Improves mental clarity and concentration<\/li>\n<li>Induces weight and body fat loss<\/li>\n<li>Lowers blood sugar levels<\/li>\n<li>Improves insulin sensitivity<\/li>\n<li>Increases energy<\/li>\n<li>Improves fat-burning<\/li>\n<li>Lowers blood cholesterol<\/li>\n<li>Prevents Alzheimer’s disease<\/li>\n<li>Extends life<\/li>\n<li>Reverses the aging process<\/li>\n<li>Decreases inflammation<\/li>\n<\/ul>\n<p>Anyone who’s ever had a pet knows that animals stop eating when they’re unwell. Human beings are animals too. Mark Twain, one of America’s foremost writers and philosophers, once wrote, “A little starvation can really do more for the average sick man than can the best medicines and the best doctors.”<\/p>\n<h2><span id=\"Fasting_Safely_My_experiences_During_57_And_Half_Hours_of_No_Food_or_Water\">Fasting Safely: My experiences During 57 And Half Hours of No Food or Water<\/span><\/h2>\n<p><em>0-12 hours of fasting<\/em>: No problems at all. I was asleep. I ate dinner at around 8.30 pm on Thursday night. Friday morning, I did not brush my teeth. That’s something that most people who fast regularly will tell you to follow. If you’re used to a cup of tea after the morning brushing, you’re more likely to crave it on Day 1 of the fast if you brush.<\/p>\n<p><u>Stuff happening inside my body (<\/u>0-12 hours of fasting<em>)<\/em>: Nothing out of the ordinary. Every night, as we sleep, the body switches from using glucose from food for energy, to pulling out stored glucose from the liver. That’s why we don’t usually die of starvation in our sleep.<\/p>\n<p><em>12-24 hours of fasting<\/em>: It takes a clear mental resolve – that you will not eat anything (in my case, not drink water either). The first proper hunger pangs hit me around 11 am. I knew they would come, since I had skipped tea and breakfast. I kept myself busy at that time. In fact, I ensured that I was at my work desk at 9 am and stayed there pretty much through the day, except for washroom breaks. Incidentally, expect less washroom “output”, considering input has gone down to zero.<\/p>\n<p>Surprisingly, at my usual lunchtime of around 1:30 pm, there was hardly any hunger. I made it a point to get up and walk about a little every two hours or so, just to keep the blood flowing. Luckily, it was a cool day, so I wasn’t feeling particularly thirsty either.<\/p>\n<p>I have always had some form of meditation in my life since the year 2000. I used one of the extra hours I suddenly had, to “sit” in contemplation. The body and mind felt light, making it easy to sit undisturbed.<\/p>\n<p>By 8:30 pm on Friday, as I touched 24-hours, I decided to hit the sack. This was just out of abundant caution, to not over-strain myself. It had been a hugely productive day at work. We don’t realize how energy and mind space eating takes up. Figuring out what to eat, then actually eating it and then digesting it – it all adds up to time, energy and focus spent, that could have been used to do other stuff.<\/p>\n<p>Don’t get me wrong. I like food as much as the next person. In fact, I think I might like desserts more that most other people next to me. But during the fast, I was surprised by the amount of time and energy I suddenly had during the day to get things done.<\/p>\n<p><u>Stuff happening inside my body during this time (<\/u>12-24 hours of fasting): The body continues to use glycogen stores in the liver to meet energy needs. With no food coming its way, this process, called gluco-neo-genesis (glucose-new-create) will go on till stored glucose is available in the liver.<\/p>\n<p><em>24-36 hours of fasting<\/em>: Like the previous night, a good eight hours were spent sleeping. I must note here that although I forced myself to hit the sack at 9.30 pm, I did not feel tired enough to sleep. Sleep was light, not because of hunger, but because I still felt energetic! Note to self: Don’t go to bed early on the next fast unless you really feel sleepy.<\/p>\n<p><u>Stuff happening inside my body during this time (<\/u>24-36 hours of fasting): This is roughly the point at which body begins to break down some protein for its energy needs. Some people worry that this is terrible – you’re losing muscle instead of fat. This is not true. The proteins that you lose are often the junky, broken proteins that the body wants to dispose anyway. It’s called autophagy, the process of digesting old, unnecessary cells. New cells will take their place. This happens before the body switches over to fat-burning.<\/p>\n<p><em>36-48 hours of fasting: <\/em>8:30 am on Saturday. Still no brushing, so you may want to keep away from close encounters J. I worked at my desk again for a couple of hours, finding the mental clarity as bright as the previous day. Today, I also had chores to run. It helped again that the day was nice and cool. I kept myself busy through the car ride, listening to a podcast. Staying occupied and not allowing the mind to wander to food is a critical part of fasting, at least during the first few days.<\/p>\n<p>By 1:30 pm, I was back home. A lot had again been accomplished by the first half of the day. I now felt the need to rest and fell into a deep nap. When I woke up a couple of hours later, I felt an amazing lightness and freshness. It was as if someone had turned on a couple of extra lights in my head!<\/p>\n<p>I used this energy to get some more focussed work done. There were other family members fasting, both at home and in other cities. One more person was doing a two-day fast like me and when I heard she was doing okay too, I realized that fasting with others can also be a source of camaraderie and strength.<\/p>\n<p>Saturday was also the annual day the Jains seek forgiveness of others for all transgressions of the past year. It’s called Paryushan. In a fasted state, with lightness of body and mind, the act somehow felt more genuine, as I sought forgiveness from several people.<\/p>\n<p><u>Stuff happening inside my body during this time (<\/u>36-48 hours of fasting): The body now switches to burning fat to produce ketones. This is what ketosis means. The body begins to burn ketones instead of sugar, as it feeds on its own body fat. Hello, real weight loss! If I had a blood test at this stage, I would likely have seen elevated fatty acid levels. This is the holy grail of athletes and weight loss seekers. Fat is a far steadier source of energy, without the yo-yo highs and lows that sugar typically brings. Believe me, it’s fun to be in ketosis. You feel calm, steady and energetic.<\/p>\n<p><em>48-57.5 hours of fasting: <\/em>Sleep was elusive on Saturday night. I expected this from my experience the previous night. I used this time to meditate again. I had also lined up some watching and reading material. I stayed up, till about 1:30 am on Sunday morning going through this. When I finally got to bed, I knew the fast would be over at sunrise, which was less than five hours away. Hand on heart, I knew that I could easily go on for longer, maybe a day or more, without any trouble.<\/p>\n<p><u>Stuff happening inside my body during this time (<\/u>48-57.5 hours of fasting): The body continues in ketosis. It will stay in this state till the fast is not broken. At some point, around the 3<sup>rd<\/sup> or the 4<sup>th<\/sup> day of the fast, several people have reported feeling a huge rush of energy, coupled with high mental clarity.<\/p>\n<p>Researchers like Dr.Fung figure that this may be because the body wants to give you additional energy to go look for food. It assumes that you need to hunt or gather. It’s an ancient preservation response. Since you’re fasting voluntarily and can get food whenever you want, you can simply use this as a hack to burn more fat till you’re ready to break your fast.<\/p>\n<p>Some experts suggest you must get the basic vitamins and minerals through supplements during fasts longer than 3 or 4 days. The Jains prefer to go fully Spartan and shun even these. Considering they’ve been doing all this for hundreds of years, I wouldn’t be surprised if research eventually discovers the science behind this thinking too.<\/p>\n<h2><span id=\"Breaking_The_Fast_Safely_A_Fine_Art\">Breaking The Fast Safely: A Fine Art<\/span><\/h2>\n<div id=\"attachment_20101\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Breaking-The-Fast-Safely.webp\"><img aria-describedby=\"caption-attachment-20101\" class=\"wp-image-20101 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Breaking-The-Fast-Safely.webp\" alt=\"how to fast safely\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20101\" class=\"wp-caption-text\">Breaking The Fast Safely<\/p><\/div>\n<p>At 6 am on Sunday, 57 and a half hours after I stopped eating and drinking, I broke my fast. I began the fast at 70.8 kg and ended it at 68.8 kg. Of course, I would have likely lost twice as much in water weight as I must have in actual fat burnt.<\/p>\n<p><strong>Brush With Salt and Mustard Oil:<\/strong> In the Jain tradition followed by my wife’s family, the morning brushing is done with salt and mustard oil. I’m sure there’s some science behind that too, but I’m yet to figure that one out.<\/p>\n<p><strong>Eat almonds with black pepper and sugar crystals:<\/strong> The fast is broken with almonds that had been soaked overnight and peeled. It is meant to be eaten with whole black peppers and sugar crystals (called Mishri). Almonds are rich in good fats and are a nice source of potassium. Pepper acts as a digestive stimulant and the sugar helps blunt the sharp edge of the pepper.<\/p>\n<p><strong>Drink Digestive Water: <\/strong>A special drink, called Dhanagra, which is prepared by boiling kitchen herbs in water, is also drunk. The primary ingredients in this are coriander seeds, cinnamon and cardamom. A generous helping of ghee or clarified butter is added on top. I figured that this is a way to bring the digestive juices back on line, gently.<\/p>\n<p><strong>The first real foods to break the fast:<\/strong> In my wife’s home, they then go on to eat a wheat halva (carbs) cooked in ghee (clarified butter fat), and some cooked green gram lentils (mung dal) with lime sprinkled liberally on it, to aid digestion. I suspect that is the latter is the first protein being introduced back into the system.<\/p>\n<p>Breaking fasts, especially those that are beyond 48 hours, is a bit of a tricky art, something that the Jains have mastered. Hardly surprising, considering there are Jains who fast for months at a time!<\/p>\n<p><strong>Reintroduce foods gently:<\/strong> Re-introducing foods is done very gradually, with strict portion. Foods that spike blood sugar and insulin are carefully introduced, only in low quantities. Dr.Fung cautions about a phenomenon called re-feeding in his book. When you break a long fast, if you have too much sugar rushing into the system suddenly, insulin also peaks, to escort this sugar into the cells. While this is good, it also pushes in all the phosphorus in the blood into the cells, leading to a crazy drop in phosphorus levels. This can lead to irregular heart beats, palpitations and the like.<\/p>\n<p>To prevent this, the Jains again have very clear guidelines evolved over time, on do’s and don’ts to observe when coming out of a long fast. Foods are brought back gradually and almost always with spices and herbs that support digestion.<\/p>\n<h2><span id=\"Fasting_Safe_Even_For_Patients_With_Chronic_Disease\">Fasting: Safe Even For Patients With Chronic Disease<\/span><\/h2>\n<p><strong>Reverse Type 2 diabetes and PCOD:<\/strong> Dr.Fung has used longer fasts with his patients, like the one I did, going all the way up to weeks in some cases. He does this to completely reverse Type 2 Diabetes, even in insulin dependent patients. The logic is simple. No food = no sugar = no insulin needed. Needless to say, these patients are often severely overweight and lose dramatic amounts of weight during the fasts.<\/p>\n<p>Of course, if they go back to their old habits of six meals a day and gorging on processed foods, the weight and diabetes will come right back. Polycystic Ovary Disease or PCOD is another condition where Dr.Fung has seen fantastic results in his practice.<\/p>\n<p><strong>Heart Disease, Cancer, RA, Thryoid benefits:<\/strong> The scientific literature is full of people with serious chronic diseases who manage to make miraculous recoveries when they fast. Everything from serious heart disease to rheumatoid arthritis to hypothyroidism and cancer seem to respond to the ancient therapeutic practice of fasting. People go off medications that they have been on for years.<\/p>\n<p>Yet, the irony is that other than naturopaths and a few other such holistic medicine practitioners, few doctors are willing to make their patients fast, even under supervision.<\/p>\n<h2><span id=\"How_Can_I_Make_Fasting_Easier\">How Can I Make Fasting Easier?<\/span><\/h2>\n<div id=\"attachment_20102\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/sdvsdg.webp\"><img aria-describedby=\"caption-attachment-20102\" class=\"wp-image-20102 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/sdvsdg.webp\" alt=\"how to fast safely\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20102\" class=\"wp-caption-text\">How Can I Make Fasting Easier?<\/p><\/div>\n<ul>\n<li><strong>Don’t brush on the first morning<\/strong>: you might crave that cup of tea or coffee more<\/li>\n<li><strong>Prepare yourself mentally: <\/strong>Block out all thought of food<\/li>\n<li><strong>Keep yourself occupied<\/strong>: especially at your usual meal times. Read or watch something interesting or do chores through such times<\/li>\n<li><strong>Don’t over-exert yourself<\/strong>: Give your body a chance to ease into the fast<\/li>\n<li><strong>Don’t force yourself to sleep:<\/strong> If you try to go to bed when you’re not tired, you may toss and turn and your mind may wander to food<\/li>\n<li><strong>Fast with someone<\/strong>; Where possible, fast with friends or family. There is strength in numbers<\/li>\n<li><strong>Meditate<\/strong>: Meditation and deep breathing can help you get spiritual benefits of fasting<\/li>\n<li><strong>Have a goal: <\/strong>Having a clear goal for why you’re fasting can help you when you dither<\/li>\n<li><strong>Notice fasting benefits: <\/strong>When you feel light and energetic, note this mentally. Positive reinforcement helps<\/li>\n<li><strong>Pick the right season:<\/strong> While fasting can be done all year round, winter is a time to feed and store, whereas monsoons are a good choice since digestive power is lower.<\/li>\n<li><strong>Stay away from the kitchen: <\/strong>Make sure you avoid places in the home that you normally associate with food like the kitchen and the dining table.<\/li>\n<\/ul>\n<h2><span id=\"Fasting_Safely_Who_Should_Not_Try_It_By_Themselves\">Fasting Safely: Who Should Not Try It By Themselves<\/span><\/h2>\n<p>Dr.Fung and other medical experts echo some common sense rules followed by tradition and culture too.<\/p>\n<p>Absolutely DO NOT fast if you are:<\/p>\n<ul>\n<li>Malnourished or severely underweight<\/li>\n<li>Pregnant<\/li>\n<li>Breastfeeding<\/li>\n<li>A child under the age of 18<\/li>\n<\/ul>\n<p>This last point is often a huge bone of contention between religious folks and others. There have been several instances in India, especially in the Jain religion, where minor children undertake extremely long and arduous fasts.<\/p>\n<p>We can only say that medically, since the human body is still growing even past 18, long fasts may not be advisable for children. That said, given junk food and obesity epidemic in kids everywhere these days, shorter therapeutic fasts may well be called for, under medical supervision.<\/p>\n<p>Additionally, Dr.Fung cautions the following people to fast only with medical advice:<\/p>\n<ul>\n<li>People with gout<\/li>\n<li>People on any medications<\/li>\n<li>People with type 1 or type 2 diabetes<\/li>\n<li>People with GERD or serious acid reflux<\/li>\n<\/ul>\n<h2><span id=\"Fasting_The_Last_Bite\">Fasting: The Last Bite<\/span><\/h2>\n<p>I’ve enjoyed this latest fast as much as several others in the past. This one came after a few years and it has renewed my personal faith in fasting as a therapeutic practice.<\/p>\n<p>I believe almost everyone can fast (other than the exceptions listed above). It rejuvenates the entire human being – body, mind and spirit. That may well be why every religion in the world prescribes fasts.<\/p>\n<p>If you have a chronic disease and want to see fast results that can last (under medical guidance, of course), you may want to just fast. Wish you vibrant health and well being!<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/Y83k8Ir3mB0?rel=0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Fasting And Religions: Everyone’s Got Their Own Brand2 The Easy Season to Fast: Ayurvedic Wisdom3 More Than Two Days Without Food: Are You Mad???4 Benefits of Fasting5 Fasting Safely: My experiences During 57 And Half Hours of No Food or Water6 Breaking The Fast Safely: A Fine Art7 Fasting: Safe Even For [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":20103,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Fast Safely: A Personal Guide to Making It Easier<\/title>\n<meta name=\"description\" content=\"How to fast safely and easily? Can people with illnesses fast and regain health? Personal experience confirms medical science to produce practical tips.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Fast Safely And Its Amazing Health Benefits\" \/>\n<meta property=\"og:description\" content=\"Can people with illnesses fast and regain health?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\" \/>\n<meta property=\"article:published_time\" content=\"2017-08-29T03:00:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-29T12:26:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Fasting-and-weight-loss.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mahesh Jayaraman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"14 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/\",\"name\":\"How To Fast Safely: A Personal Guide to Making It Easier\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#primaryimage\"},\"datePublished\":\"2017-08-29T03:00:35+00:00\",\"dateModified\":\"2022-01-29T12:26:04+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\"},\"description\":\"How to fast safely and easily? Can people with illnesses fast and regain health? Personal experience confirms medical science to produce practical tips.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How To Fast Safely: A Personal Guide to Making It Easier\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\",\"name\":\"Mahesh Jayaraman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"caption\":\"Mahesh Jayaraman\"},\"description\":\"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.\",\"sameAs\":[\"http:\/\/sepalika.com\",\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Fast Safely: A Personal Guide to Making It Easier","description":"How to fast safely and easily? Can people with illnesses fast and regain health? Personal experience confirms medical science to produce practical tips.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/","og_locale":"en_US","og_type":"article","og_title":"How To Fast Safely And Its Amazing Health Benefits","og_description":"Can people with illnesses fast and regain health?","og_url":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/profile.php?id=100009879845215","article_published_time":"2017-08-29T03:00:35+00:00","article_modified_time":"2022-01-29T12:26:04+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Fasting-and-weight-loss.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Mahesh Jayaraman","Est. reading time":"14 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/","name":"How To Fast Safely: A Personal Guide to Making It Easier","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#primaryimage"},"datePublished":"2017-08-29T03:00:35+00:00","dateModified":"2022-01-29T12:26:04+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4"},"description":"How to fast safely and easily? Can people with illnesses fast and regain health? Personal experience confirms medical science to produce practical tips.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-fast-safely\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How To Fast Safely: A Personal Guide to Making It Easier"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4","name":"Mahesh Jayaraman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","caption":"Mahesh Jayaraman"},"description":"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.","sameAs":["http:\/\/sepalika.com","https:\/\/www.facebook.com\/profile.php?id=100009879845215","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13283"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=13283"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13283\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/20103"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=13283"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=13283"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=13283"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}