{"id":13348,"date":"2017-09-01T08:00:37","date_gmt":"2017-09-01T08:00:37","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=13348"},"modified":"2022-02-19T15:03:51","modified_gmt":"2022-02-19T09:33:51","slug":"diet-for-pcos","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/","title":{"rendered":"8 Diet Tips For PCOS From Personal Experience"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Why_Diet_Matters_For_PCOS\"><span class=\"toc_number toc_depth_1\">1<\/span> Why Diet Matters For PCOS?<\/a><\/li><li><a href=\"#My_Top_8_Diet_Tips_For_PCOS\"><span class=\"toc_number toc_depth_1\">2<\/span> My Top 8 Diet Tips For PCOS<\/a><ul><li><a href=\"#Give_Up_Sugar\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Give Up Sugar<\/a><\/li><li><a href=\"#Choose_Carbohydrates_Wisely\"><span class=\"toc_number toc_depth_2\">2.2<\/span> Choose Carbohydrates Wisely<\/a><\/li><li><a href=\"#Eliminate_All_Processed_Foods\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Eliminate All Processed Foods<\/a><\/li><li><a href=\"#Adopt_A_Whole_Foods_Diet\"><span class=\"toc_number toc_depth_2\">2.4<\/span> Adopt A Whole Foods Diet<\/a><\/li><li><a href=\"#Know_Your_Fats\"><span class=\"toc_number toc_depth_2\">2.5<\/span> Know Your Fats<\/a><\/li><li><a href=\"#Rethink_The_Way_You_Cook\"><span class=\"toc_number toc_depth_2\">2.6<\/span> Rethink The Way You Cook<\/a><\/li><li><a href=\"#Drink_Enough_Water\"><span class=\"toc_number toc_depth_2\">2.7<\/span> Drink Enough Water<\/a><\/li><li><a href=\"#Add_Dietary_Probiotics\"><span class=\"toc_number toc_depth_2\">2.8<\/span> Add Dietary Probiotics<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p>In an earlier article, I have shared my experience on how I reversed my <a href=\"https:\/\/www.sepalika.com\/pcos\/treat-pcos-naturally-inspiring-success-story\/\">Polycystic Ovarian Syndrome (PCOS)<\/a> naturally. Diet played a key role in helping me overcome the condition.<\/p>\n<p>When I was first diagnosed with <a href=\"https:\/\/www.sepalika.com\/pcos\/treat-pcos-naturally-inspiring-success-story\/\">Polycystic Ovarian Syndrome (PCOS)<\/a>, my gynecologist recommended a ‘healthy ‘diet’ to treat the symptoms. The idea was to make my menstrual cycle more regular and help me lose weight. As Indians, we already eat a seemingly healthy diet.  My diet comprised of whole-wheat rotis, rice, an assortment of vegetables, healthy legumes and lentils, paneer and dairy and more. What was I doing wrong?<\/p>\n<p>I started researching on what is a healthy diet plan for PCOS. I found out that our standard Indian diet has various pitfalls which can be easily prevented. And that is what I would like to talk about today.<\/p>\n<h2><span id=\"Why_Diet_Matters_For_PCOS\">Why Diet Matters For PCOS?<\/span><\/h2>\n<p>Before I discuss the recommended diet for PCOS, I want to first talk about why these diet changes are so important. If you have PCOS, chances are that you also suffer from insulin resistance. This happens when the body produces insulin (which is necessary to turn sugars into energy) but it is not efficiently used. This leads to high levels of sugar in your blood. The body pumps out more and more insulin to normalize these high blood glucose levels. And as a result, the ovaries produce more androgens like testosterone. These excess androgens then cause hormonal imbalance, which is what leads to PCOS.<\/p>\n<p>Once you understand this mechanism, it’s easy to imagine how a diet that stabilizes insulin levels helps for PCOS. A diet that is low in refined carbohydrates, sugars and processed foods will help keep insulin levels as well as your weight under control. However, there is more to PCOS than just insulin resistance. Some women can be diagnosed with PCOS even when their fasting glucose levels come out to be normal. This is because a lot of other factors can cause over-production of testosterone. Nevertheless, a healthy diet that stabilizes blood sugar and insulin levels helps ALL women diagnosed with PCOS. <a href=\"http:\/\/ajcn.nutrition.org\/content\/92\/1\/83.short\">Studies<\/a> have found that a low glycemic index (GI) diet can help in management of PCOS.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/flaxseeds-excess-hair-growth\/\">Flax Seeds: An All Natural Remedy for Excess Hair Growth<\/a><\/div>\n<h2><span id=\"My_Top_8_Diet_Tips_For_PCOS\">My Top 8 Diet Tips For PCOS<\/span><\/h2>\n<p>As I did more research into the right diet plan for PCOS, I found out where I was making mistakes. One of the most interesting things I read was that <a href=\"https:\/\/academic.oup.com\/jcem\/article\/86\/6\/2453\/2848804\/Low-Grade-Chronic-Inflammation-in-Women-with\">low grade inflammation and PCOS<\/a> go hand in hand. And that is why I was suffering from cystic acne, PMS, headaches and bloating. My aim was to adopt a more anti-inflammatory diet that healed my body from within. At the same time, such a diet would help in normalizing my blood sugar and hormone levels. Here are my top 8 diet tips for PCOS.<\/p>\n<h3><span id=\"Give_Up_Sugar\">Give Up Sugar<\/span><\/h3>\n<div id=\"attachment_20131\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Dessert.webp\"><img aria-describedby=\"caption-attachment-20131\" class=\"size-full wp-image-20131\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Dessert.webp\" alt=\"Give Up Sugar\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-20131\" class=\"wp-caption-text\">Give Up Sugar<\/p><\/div>\n<p>Insulin resistance is one of your biggest battles with PCOS. For this reason, giving up sugar makes complete sense for those affected by PCOS. With insulin resistance, your blood glucose levels spike up dramatically as soon as you ingest sugar or any sugary foods.  The first thing I did was to give up sugar completely. Cakes, doughnuts, cookies, ice-cream, all Indian desserts (<em>gulab jamun, rasagulla, barfi, etc.<\/em>) and even packaged fruit juices &#8212; everything. I even learnt how to enjoy my morning cup of tea sans sugar, and it wasn’t that bad. You can use sugar alternatives like Stevia, honey or jaggery <em>(gud)<\/em> powder to make the transition easier.<\/p>\n<p>However, the tough part was that there are hidden sugars in so many unexpected things. Bottled salad dressings, peanut butter, pasta sauces, sandwich spreads and more. It took me some time to get used to <a href=\"https:\/\/www.sepalika.com\/living-well\/reading-nutrition-labels\/\">reading ingredients <\/a>very carefully on every packet\/bottle\/box of food.  I would say it’s well worth the effort too. Also, I didn’t switch to artificial sugars that most diabetics turn too when they give up sugar. These are even WORSE than sugar, and best avoided completely on a healthy diet plan.<\/p>\n<h3><span id=\"Choose_Carbohydrates_Wisely\">Choose Carbohydrates Wisely<\/span><\/h3>\n<div id=\"attachment_20133\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Carbs-PCOS.webp\"><img aria-describedby=\"caption-attachment-20133\" class=\"wp-image-20133 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Carbs-PCOS.webp\" alt=\"Choose Carbohydrates Wisely\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20133\" class=\"wp-caption-text\">Choose Carbohydrates Wisely<\/p><\/div>\n<p>For us Indians, all meals revolve around carbohydrates! Whatever we cook – be it a curry or a dry vegetable, we eat it with <em>chapatis, parathas<\/em> or rice. And that’s one of the biggest pitfalls of <a href=\"https:\/\/www.sepalika.com\/pcos\/lchf-diet-pcos\/\">PCOS diet<\/a>. All carbohydrates turn into sugars upon digestion, which meant that a high-carb diet is a bad idea for those with insulin resistance. I am not going to ask you to give up carbohydrates completely. Because I don’t believe in extreme diet measures that are not sustainable for a lifetime. Instead, I recommend choosing your carbohydrates wisely. Refined carbohydrates are the culprits here. However, vegetables, fruits, healthy grains, and seeds are all good sources of healthy carbohydrates. Also, forget that you MUST have <em>chapati<\/em> or rice for every meal. One of my favorite meals is a big bowl of stew made with lean chicken, red lentils <em>(lal masoor)<\/em>, and vegetables. It’s a meal by itself and doesn’t need accompaniments.<\/p>\n<p>If <em>chapatis<\/em> are a must in your household, I recommend that you make your own homemade multigrain atta. Store-bought atta is often too refined and lacks wheat-bran and wheat-germ. This kind of processing makes the flour deficient in nutrients as well as fiber. Choosing multiple grains that contain the whole cereal grain ensures that your sugar levels will not spike dramatically after your meals. Mix equal portions (or as you please) of whole-wheat, bajra, ragi, barley, and oats to create your own healthier atta for chapatis and parathas. I also switched from white rice to brown rice, which is the whole grain and contains more overall nutrition. Brown rice also has a lower glycemic index (GI), which means it’s slower to affect your blood sugar.<\/p>\n<h3><span id=\"Eliminate_All_Processed_Foods\">Eliminate All Processed Foods<\/span><\/h3>\n<div id=\"attachment_20132\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Cookies-PCOS.webp\"><img aria-describedby=\"caption-attachment-20132\" class=\"size-full wp-image-20132\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Cookies-PCOS.webp\" alt=\"Eliminate All Processed Foods\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20132\" class=\"wp-caption-text\">Eliminate All Processed Foods<\/p><\/div>\n<p>I cut back on all processed foods because these contain hidden sugars, excess sodium, unhealthy fats and a bunch of additives and preservatives. All of these can lead to inflammation, which is something I didn’t want in my diet. That means cutting back on all biscuits, chips, cookies, processed meats, energy bars, packaged fruit juices, breakfast cereals. Basically, you cut down on anything and everything that comes out of a box or packet.<\/p>\n<p>Now, let me be the first one to confess that this change is not easy. Especially for a working woman who has a family to feed while also spending around 8 hours at the office. Cooking EVERYTHING from scratch is difficult. But trust me, it is possible. Start with smaller changes. When you’re out grocery shopping, fill up your cart with fresh fruits, vegetables, legumes, and meats. And plan your weekly menus around this healthy shopping cart. Eliminate processed foods slowly, and become more serious about meal prep. Spend a little time chopping up vegetables and storing them in containers and fresh-lock bags over the weekend. This way, you will be more likely to throw together a quick stir-fry and avoid foods out of a bag at the end of a hectic workday.<\/p>\n<h3><span id=\"Adopt_A_Whole_Foods_Diet\">Adopt A Whole Foods Diet<\/span><\/h3>\n<div id=\"attachment_20134\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Whole-grains-and-PCOS.webp\"><img aria-describedby=\"caption-attachment-20134\" class=\"size-full wp-image-20134\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Whole-grains-and-PCOS.webp\" alt=\"Adopt A Whole Foods Diet\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20134\" class=\"wp-caption-text\">Adopt A Whole Foods Diet<\/p><\/div>\n<p>As you give up processed foods, it’ll become easier to adopt a whole-foods diet. Also known as Clean Eating, such a diet is based around eating fresh fruits, vegetables, whole grains, lean cuts of meat and legumes. This diet is anti-inflammatory and nourishes your body to the fullest.<\/p>\n<p>A whole-food diet is also high in fiber which helps you feel full for longer. Seek out whole grains, quinoa, fresh fruits like blueberries and bananas. Interestingly, both blueberries and bananas put together make a wonderful breakfast smoothie. Eat vegetables like okra, eggplant, broccoli, zucchini, pumpkin, gourd, lettuce, spinach, and cilantro. Rich in vitamins, minerals, and antioxidants, all vegetables are a good addition to your diet. Personally, I aim for a minimum of 9 servings of fruits and vegetables per day. A single serving equals one cup of raw fruit or vegetable.<\/p>\n<h3><span id=\"Know_Your_Fats\">Know Your Fats<\/span><\/h3>\n<div id=\"attachment_20135\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Good-Fats-heart.webp\"><img aria-describedby=\"caption-attachment-20135\" class=\"size-full wp-image-20135\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Good-Fats-heart.webp\" alt=\"Know Your Fats\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20135\" class=\"wp-caption-text\">Know Your Fats<\/p><\/div>\n<p>Not all fats are bad for you. But partially-hydrogenated and hydrogenated fats are best avoided completely. Also, consuming too much omega-6 fatty acids increases the risk of inflammation. This is why it’s best to swap all vegetable oils like soy, sunflower, and safflower oil with omega-3 rich olive oil or coconut oil.<\/p>\n<p>Don’t be afraid of ghee. It’s a healthier alternative to vegetable oils and gives a rich, buttery taste without a heavy dose of omega-6 fat in Indian recipes. Know that healthy fats are a must in your diet for PCOS. Good fats are found in nuts, seeds, oily fish, coconut oil and olive oil.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/fenugreek-for-pcos\/\">Fenugreek: A Science-Backed Remedy for PCOS<\/a><\/div>\n<h3><span id=\"Rethink_The_Way_You_Cook\">Rethink The Way You Cook<\/span><\/h3>\n<p>Fat-laden curries, heavy <em>kormas<\/em>, and vegetables fried in oil &#8212; while Indian cuisine is delicious, you can do with a few changes.  Adding more vegetables to your diet is a healthy choice. But you need to cook them right to reap their maximum nutritional benefits. And no, I am not asking you to eat boiled vegetables! Steamed vegetables are a healthy option. Steaming preserves vitamin C and many B vitamins that are easily damaged when vegetables come into contact with heat and water. Dry cooking methods such as grilling, roasting and stir-frying also retain a greater amount of nutrients than boiling.<\/p>\n<p>If you like to add a lean meat to your diet every day, choose grilled, roasted or baked chicken over heavier gravies. I like to stir-fry chicken with zucchini, broccoli, and mushrooms in a little coconut oil for a quick, highly satiating dinner.<\/p>\n<h3><span id=\"Drink_Enough_Water\">Drink Enough Water<\/span><\/h3>\n<div id=\"attachment_20136\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Drinking-Water.webp\"><img aria-describedby=\"caption-attachment-20136\" class=\"size-full wp-image-20136\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Drinking-Water.webp\" alt=\"Heartburn at night - Don't drink water right after dinner\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20136\" class=\"wp-caption-text\">Heartburn at night &#8211; Don&#8217;t drink water right after dinner<\/p><\/div>\n<p>Another common mistake, most of us don’t drink enough water. My PCOS came with horrible <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-bloating\/\">bloating <\/a>that was so bad, I could barely button up my jeans many a mornings. The bloating just worsened around my period as I struggled with swollen breasts and belly. Bloating is caused by water retention, when your body holds onto water. Contrary to what you may think, drinking <u>more<\/u> water will help gently flush out excess water and sodium from your body. I like to start the day with a tall glass of water with a wedge of lime. This helps in flushing out all toxins and kick start my metabolism. I aim for 2-3 <span style=\"text-decoration: underline;\">liters<\/span> of water every day, and this has really helped with bloating.<\/p>\n<p>However, don’t drink water with or after your meals. Instead, drink a tall glass of water half hour before your meal to boost digestion and stay hydrated.<\/p>\n<h3><span id=\"Add_Dietary_Probiotics\">Add Dietary Probiotics<\/span><\/h3>\n<div id=\"attachment_20137\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/idlis.webp\"><img aria-describedby=\"caption-attachment-20137\" class=\"size-full wp-image-20137\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/idlis.webp\" alt=\"Add Dietary Probiotics\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20137\" class=\"wp-caption-text\">Add Dietary Probiotics<\/p><\/div>\n<p>Changes in gut microbiome can affect weight loss, metabolism, body fat as well as encourage inflammation. This is why healthy probiotics, which improve gut flora, must be a part of a good diet for PCOS.<\/p>\n<p>Eat more yogurt, lassi, <em>kanji<\/em>, buttermilk <em>(chaas)<\/em>, and pickles. Foods that require fermentation, for examples <em>dhoklas, idlis and dosas<\/em> also contain live gut-healthy bacteria. Kombucha, miso, sauerkraut and tempeh are other excellent natural probiotics.<\/p>\n<p>I have read that giving up dairy can be extremely beneficial for some women who have PCOS, especially those suffering from painful cystic acne. While I didn’t do this, this is because dairy (particularly low-fat dairy) contains Insulin-like Growth Factor-1 (IGF-1) which can be a problem. If you are really struggling with acne, giving up dairy can be worth a try.<\/p>\n<p><span style=\"font-weight: 400;\">While dietary changes can definitely have a positive impact in managing PCOD, reversing the condition requires a holistic approach. Learn how to reverse PCOD naturally with Sepalika’s 5-Petal PCOD Programme. Our personalised protocols using a holistic approach help treat PCOD at the root through diet, nutrition, exercise, Ayurveda and magnet acutherapy. What’s more, expert consults via phone and WhatsApp help you always stay on track in your journey to overcome PCOD. <\/span><a href=\"https:\/\/sepalika.com\/campaigns\/pcod\/?utm_source=Website&amp;utm_medium=PCOD%20Blog&amp;utm_campaign=Blog_Footer\"><span style=\"font-weight: 400;\">Click here<\/span><\/a><span style=\"font-weight: 400;\"> to know more.<\/span><\/p>\n<h4><a href=\"https:\/\/www.sepalika.com\/our-programs\/polycystic-ovary-disorder\/\" target=\"_blank\" rel=\"noopener\">Want To Explore More? Checkout Sepalika Polycystic Ovary Disorder (PCOD) Program<\/a><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Why Diet Matters For PCOS?2 My Top 8 Diet Tips For PCOS2.1 Give Up Sugar2.2 Choose Carbohydrates Wisely2.3 Eliminate All Processed Foods2.4 Adopt A Whole Foods Diet2.5 Know Your Fats2.6 Rethink The Way You Cook2.7 Drink Enough Water2.8 Add Dietary Probiotics In an earlier article, I have shared my experience on how [&hellip;]<\/p>\n","protected":false},"author":24,"featured_media":16649,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[148,143],"tags":[51,26],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diet For PCOS: 8 Effective Tips From Personal Experience | Sepalika<\/title>\n<meta name=\"description\" content=\"A healthy diet for PCOS involves giving up sugar &amp; processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"8 Effective Diet Tips For PCOS\" \/>\n<meta property=\"og:description\" content=\"A healthy diet for PCOS involves giving up sugar &amp; processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-09-01T08:00:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T09:33:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/PCOS-and-diet.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/\",\"name\":\"Diet For PCOS: 8 Effective Tips From Personal Experience | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#primaryimage\"},\"datePublished\":\"2017-09-01T08:00:37+00:00\",\"dateModified\":\"2022-02-19T09:33:51+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"A healthy diet for PCOS involves giving up sugar & processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"8 Diet Tips For PCOS From Personal Experience\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diet For PCOS: 8 Effective Tips From Personal Experience | Sepalika","description":"A healthy diet for PCOS involves giving up sugar & processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/","og_locale":"en_US","og_type":"article","og_title":"8 Effective Diet Tips For PCOS","og_description":"A healthy diet for PCOS involves giving up sugar & processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.","og_url":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-09-01T08:00:37+00:00","article_modified_time":"2022-02-19T09:33:51+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/PCOS-and-diet.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#webpage","url":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/","name":"Diet For PCOS: 8 Effective Tips From Personal Experience | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#primaryimage"},"datePublished":"2017-09-01T08:00:37+00:00","dateModified":"2022-02-19T09:33:51+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"A healthy diet for PCOS involves giving up sugar & processed foods and eating good fats. Find out how diet helped a PCOS patient overcome her condition.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/pcos\/diet-for-pcos\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"8 Diet Tips For PCOS From Personal Experience"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13348"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=13348"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13348\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16649"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=13348"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=13348"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=13348"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}