{"id":13774,"date":"2017-09-25T12:00:10","date_gmt":"2017-09-25T12:00:10","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=13774"},"modified":"2022-02-19T13:20:34","modified_gmt":"2022-02-19T07:50:34","slug":"motivation-tips-pcos","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/","title":{"rendered":"Top 7 Motivation Tips For Fighting PCOS"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Why_Is_It_Difficult_To_Stay_Motivated_When_Dealing_With_PCOS\"><span class=\"toc_number toc_depth_1\">1<\/span> Why Is It Difficult To Stay Motivated When Dealing With PCOS?<\/a><\/li><li><a href=\"#Our_Top_7_Motivation_Tips_When_You_Have_PCOS\"><span class=\"toc_number toc_depth_1\">2<\/span> Our Top 7 Motivation Tips When You Have PCOS<\/a><ul><li><a href=\"#Pre-Plan_Your_Meals\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Pre-Plan Your Meals<\/a><\/li><li><a href=\"#Schedule_Important_Activities\"><span class=\"toc_number toc_depth_2\">2.2<\/span> Schedule Important Activities<\/a><\/li><li><a href=\"#Share_Your_Plan_With_Others\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Share Your Plan With Others<\/a><\/li><li><a href=\"#Make_Peace_With_Your_Lifestyle_Choices\"><span class=\"toc_number toc_depth_2\">2.4<\/span> Make Peace With Your Lifestyle Choices<\/a><\/li><li><a href=\"#Get_The_Right_Support\"><span class=\"toc_number toc_depth_2\">2.5<\/span> Get The Right Support<\/a><\/li><li><a href=\"#Know_Where_You_Want_To_Be\"><span class=\"toc_number toc_depth_2\">2.6<\/span> Know Where You Want To Be<\/a><\/li><li><a href=\"#Always_Listen_To_Your_Body\"><span class=\"toc_number toc_depth_2\">2.7<\/span> Always Listen To Your Body<\/a><\/li><\/ul><\/li><li><a href=\"#Decision_Fatigue_A_Bottleneck_In_Your_Fight_Against_PCOS\"><span class=\"toc_number toc_depth_1\">3<\/span> Decision Fatigue: A Bottleneck In Your Fight Against PCOS<\/a><\/li><li><a href=\"#PCOS_Management_Is_For_Life\"><span class=\"toc_number toc_depth_1\">4<\/span> PCOS Management Is For Life<\/a><\/li><\/ul><\/div>\n<p>The fight against PCOS involves a whole set of changes to your diet and your lifestyle. And because PCOS has no permanent cure, you will have to continue with these changes for long. That&#8217;s why motivation plays such an important role in battling PCOS. Also, <a href=\"http:\/\/www.fertstert.org\/article\/S0015-0282(10)00542-X\/abstract\" target=\"_blank\" rel=\"noopener noreferrer\">research<\/a> has shown that women with PCOS are more likely to suffer from <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-depression\/\">depression<\/a>. The depression can make lifestyle changes harder, but there are things you can do to power-through and stay on the right path. Based on my personal experience, let me share 7 motivation tips for fighting PCOS.<\/p>\n<h2><span id=\"Why_Is_It_Difficult_To_Stay_Motivated_When_Dealing_With_PCOS\">Why Is It Difficult To Stay Motivated When Dealing With PCOS?<\/span><\/h2>\n<p>When I first started my journey to <a href=\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\">treat PCOS naturally,<\/a> I had a lot of motivation. My research gave me enough insight into the nature of the beast and I was geared up towards controlling it, so I could live a healthy, normal life. I made all the right diet and lifestyle changes, prioritized sleep and rest, took all the right supplements and lost some weight. My skin cleared up, my periods showed up religiously every 25 days, I had more energy, and I was fitter than ever before in my life. Tests revealed my numbers (and my health) improved, and I was over the moon with my success.<\/p>\n<p>And then I kind of slacked off. I had done so well…surely I could manage with a few days off exercise, and eat that loaded pepperoni pizza over the weekend? And while I’m at that, why not enjoy a few cocktails every week and throw my PCOS diet out the window while I’m on my yearly vacation? Everyone needs a break, right?<\/p>\n<p>It turned out &#8211; women with PCOS get no breaks. As you can imagine, my <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/\">PCOS symptoms <\/a>came back with a vengeance. I started breaking out, my periods decided to show up late, I was bloated and hangry all the time, and I felt worse than ever before. Why? Because I knew better. I knew that PCOS is not a beast you can tame if you lack motivation.<\/p>\n<p>That, in my opinion, is one of the BIGGEST challenges with PCOS. Staying motivated. The problem is that you start off all excited and pumped up, but your motivation starts to wane with time.<\/p>\n<h2><span id=\"Our_Top_7_Motivation_Tips_When_You_Have_PCOS\"><a href=\"https:\/\/www.sepalika.com\/pcos\/natural-treatments-pcos-acne\/\">Our Top 7 Motivation Tips When You Have PCOS<\/a><\/span><\/h2>\n<div id=\"attachment_20329\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/PCOS-and-motivation-2nd-image.webp\"><img aria-describedby=\"caption-attachment-20329\" class=\"size-full wp-image-20329\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/PCOS-and-motivation-2nd-image.webp\" alt=\"Our Top 7 Motivation Tips When You Have PCOS\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20329\" class=\"wp-caption-text\">Our Top 7 Motivation Tips When You Have PCOS<\/p><\/div>\n<p>Because staying motivated is not so easy, we have put together these 7 tips that will help you get your mojo again.<\/p>\n<h3><span id=\"Pre-Plan_Your_Meals\">Pre-Plan Your Meals<\/span><\/h3>\n<p>The right diet is central to reversing PCOS. We highly recommend you plan your menu ahead of time. I personally like to plan menus for the whole week on Sunday, right after I’ve done my weekly grocery shop. I see what I have stocked up in my pantry and refrigerator, and write down what I am going to cook for the coming week. This makes meal-prep a lot simpler and effortless. If planning for a whole week is too much for you, simply plan all 3 meals for the next day, or the next 2 days, whatever suits your lifestyle. This will prevent that What-Do-I-Cook-Now syndrome half an hour before dinner-time…when you am hungry and tired from a hectic day at work.<\/p>\n<h3><span id=\"Schedule_Important_Activities\">Schedule Important Activities<\/span><\/h3>\n<p>Reversing PCOS involves a disciplined approach towards certain activities, such as exercise. Preferably, finish the important PCOS-related activities early on in the day, so that you’re less likely to skip them. Whether it is exercise, meal prep or skincare &#8212; do the important things first thing in the morning when your motivation and willpower are strong. Taking my supplements is important to me, so I take them right after breakfast, instead of waiting till post-dinner when I may be too tired. Since I like to take Evening Primrose Oil and Magnesium before bedtime, I have scheduled an alarm on my phone that reminds me to do so on time. Schedule gym time or a half-hour to take a brisk walk around the block into your routine, instead of hoping that you’ll get to it sometime during the day. Write it down in your calendar so that you’re motivated to do it.<\/p>\n<h3><span id=\"Share_Your_Plan_With_Others\">Share Your Plan With Others<\/span><\/h3>\n<p>When I realized that I was slacking off on my workout twice a week, I shared with fitness goals with my sister. I told her that I was struggling with my 5:00pm commitment to the gym, and she stepped right in. She checked on me daily to ensure I was ready to hit the gym at 4:50pm every day, and it became harder to make excuses. Within 2 weeks I didn’t need that reminder anymore; I simply felt more motivated because someone besides me cared that I stuck to my goals. I also shared my intentions to go Paleo with my husband, and he often motivates me to choose a Coconut-Berry Smoothie over a Burrito when we’re out for lunch. Sometimes, you just need a little nudge, because making the same choices every day can become monotonous and boring. Share your intentions with your loved ones or others suffering from the condition!<\/p>\n<h3><span id=\"Make_Peace_With_Your_Lifestyle_Choices\">Make Peace With Your Lifestyle Choices<\/span><\/h3>\n<p>The only way to stay motivated to follow your PCOS diet is to not think of it as a “diet” at all. The right diet is a lifestyle change, and there is no turning back. What we put in our bodies really does make a huge difference! You aren’t just giving up gluten, dairy, refined and processed foods for a few months; you are giving them up for life. And you have to make peace with that. Same holds true for binge-drinking, a healthy skin care routine and being regular to the gym.<\/p>\n<h3><span id=\"Get_The_Right_Support\">Get The Right Support<\/span><\/h3>\n<p>If you are someone who has a lot on her plate – a full-time job, family commitments, kids who need help with homework and a struggling health &#8212; you may need a bit more help. Support can come in many forms and can help you feel like you’re not alone in this journey. Reach out to other women in your social circle who have overcome PCOS and ask for tips. Join an online PCOS community that helps keep you motivated. The best way to stay motivated is to talk often to women who are where you want to be.<\/p>\n<h3><span id=\"Know_Where_You_Want_To_Be\">Know Where You Want To Be<\/span><\/h3>\n<p>This one is more important than you realize. For you to stay motivated to follow a PCOS friendly lifestyle without falling off the bandwagon, it is very important to know your goals. Motivation comes from your desire to achieve goals, and that’s not always easy with PCOS. I know many women who are very motivated to follow their PCOS diet and exercise regularly to improve their chances to conceive. But once they’re pregnant and have a baby, they are no longer motivated to live a healthier PCOS-free lifestyle. You have to <em><u>know your WHY<\/u><\/em> and write it down. This way, you’re reminded of why you set out on this journey every time you get off the track. Your reason could be being healthy, keeping off weight, having clear glowing skin as you age, avoiding the secondary health problems that come with PCOS, or living the best life you can live. It’s important that you know where you want to be, so that you can keep going.<\/p>\n<h3><span id=\"Always_Listen_To_Your_Body\">Always Listen To Your Body<\/span><\/h3>\n<p>This is what I mean when I say ‘prioritize your health’ to simplify your PCOS action plan. Truth is &#8211; there will still be days when you don’t feel all that great, despite doing everything right by your PCOS master guide. PCOS does not go away. I still suffer from heavy periods, pain and bloating occasionally. It’s less frequent, but it still happens, even when I eat right and exercise every day. And on those days, I listen to my body. I don’t try to push myself. I lie in bed and watch TV or read, and I always feel better by the next day…ready to hit the gym and stay active. Aching all over while you force yourself to workout at the gym, or eating a super-small salad when you’re feeling weak and dizzy will NOT HELP your motivation! Sometimes, you just got to listen to your body.<\/p>\n<h2><span id=\"Decision_Fatigue_A_Bottleneck_In_Your_Fight_Against_PCOS\">Decision Fatigue: A Bottleneck In Your Fight Against PCOS<\/span><\/h2>\n<p>“Decision Fatigue refers to the deteriorating quality of decisions made by an individual after a long session of decision-making. ” In simpler words, the more decisions you make on an everyday basis, the more mentally drained you feel, and your susceptibility to making bad decisions increases.<\/p>\n<p>PCOS management requires making SO many decisions on a day to day basis, including:<\/p>\n<ul>\n<li>What carbs should I eat and which to avoid?<\/li>\n<li>Which PCOS diet will work best for me?<\/li>\n<li>What kind of exercise regime should I follow to lose weight?<\/li>\n<li>Should I go to the gym or try at-home yoga videos?<\/li>\n<li>What supplements will work best for my PCOS symptoms?<\/li>\n<li>Shall I try natural remedies for my acne or take those drugs the dermatologist prescribed?<\/li>\n<li>Which hair removal treatment will work best to manage PCOS facial hair?<\/li>\n<\/ul>\n<p>And if you aren’t seeing results from your choices within a couple of weeks, you can feel like it’s time to try something new, something better. Necessitating decision-making again.<\/p>\n<p>Stop Right Now!!!! What you’re doing is just setting yourself up for Decision Fatigue. Yes, it’s a real thing.<\/p>\n<p>Decision Fatigue is counter-productive to Motivation. The wearier you get with your every-day decision-making process, the weaker your willpower will get. Therefore, your action plan against PCOS should involve minimum decisions. For example, pre-planning your meal or planning your exercise schedule in advance will mean these activities become a part of your routine and don&#8217;t take up a lot of your mental energy.<\/p>\n<h2><span id=\"PCOS_Management_Is_For_Life\">PCOS Management Is For Life<\/span><\/h2>\n<p>And yes, that just sucks. But what are we to do about it? The simple answer &#8212;- keep on keeping on. Staying motivated, even when we don’t necessarily see immediate results, is the KEY to managing your PCOS for life.<\/p>\n<p>The unfortunate truth about PCOS is that it’s not going to go away if you do all the right things at the right time for a few months. To reverse it permanently, you need to manage it for life and make sure you have the motivation to keep going strong.<\/p>\n<p>It can get particularly hard when you simply aren’t seeing the results you want to see. For example – if you are finding it impossible to lose that extra weight, or your <a href=\"https:\/\/www.sepalika.com\/pcos\/natural-treatments-pcos-acne\/\">acne <\/a>hasn’t cleared up despite trying a bunch of treatments. Hirsutism and infertility can be extra-frustrating and heart-breaking too. And then there is PCOS and depression…that’s a tough beast to tame.<\/p>\n<p>This is quite understandable too. PCOS can sometimes make you feel like you’re fighting the same battles over and over again. You make some changes, and your symptoms begin showing improvement. You get a little slack, and these symptoms all come back, sometimes worse than before. It can feel like you’re swimming against the tide, dealing with the same thing time and again. And that can worsen or become the very root-cause for PCOS related depression.<\/p>\n<p>So, the biggest key to staying motivated is to simplify your PCOS management. Your PCOS action plan needs to be simple and do-able, so you feel motivated to stick to it for life. Aim to:<\/p>\n<ol>\n<li>Eat Healthy<\/li>\n<li>Exercise Regularly<\/li>\n<li>Prioritize Your Health<\/li>\n<\/ol>\n<p>Stay committed and let these tips become ‘habits’. Some habits are for life….and these will keep you motivated and on track to live the best PCOS-free life you can!<\/p>\n<h4><a href=\"https:\/\/www.sepalika.com\/our-programs\/polycystic-ovary-disorder\/\" target=\"_blank\" rel=\"noopener\">Want To Explore More? Checkout Sepalika Polycystic Ovary Disorder (PCOD) Program<\/a><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Why Is It Difficult To Stay Motivated When Dealing With PCOS?2 Our Top 7 Motivation Tips When You Have PCOS2.1 Pre-Plan Your Meals2.2 Schedule Important Activities2.3 Share Your Plan With Others2.4 Make Peace With Your Lifestyle Choices2.5 Get The Right Support2.6 Know Where You Want To Be2.7 Always Listen To Your Body3 [&hellip;]<\/p>\n","protected":false},"author":24,"featured_media":20331,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[153,143],"tags":[155],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top 7 Motivation Tips For Fighting PCOS | Sepalika<\/title>\n<meta name=\"description\" content=\"PCOS has no cure. However, if you can stay motivated, you can keep this condition at bay forever. Find out 7 motivation tips for fighting PCOS.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"7 Motivational Tips For Fighting PCOS\" \/>\n<meta property=\"og:description\" content=\"By staying motivated, you can keep PCOS at bay forever. Find out 7 motivation tips for fighting it!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-09-25T12:00:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T07:50:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/PCOS-and-motivation-2nd-image.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/\",\"name\":\"Top 7 Motivation Tips For Fighting PCOS | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#primaryimage\"},\"datePublished\":\"2017-09-25T12:00:10+00:00\",\"dateModified\":\"2022-02-19T07:50:34+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"PCOS has no cure. However, if you can stay motivated, you can keep this condition at bay forever. Find out 7 motivation tips for fighting PCOS.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Top 7 Motivation Tips For Fighting PCOS\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top 7 Motivation Tips For Fighting PCOS | Sepalika","description":"PCOS has no cure. However, if you can stay motivated, you can keep this condition at bay forever. Find out 7 motivation tips for fighting PCOS.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/","og_locale":"en_US","og_type":"article","og_title":"7 Motivational Tips For Fighting PCOS","og_description":"By staying motivated, you can keep PCOS at bay forever. Find out 7 motivation tips for fighting it!","og_url":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-09-25T12:00:10+00:00","article_modified_time":"2022-02-19T07:50:34+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/PCOS-and-motivation-2nd-image.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#webpage","url":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/","name":"Top 7 Motivation Tips For Fighting PCOS | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#primaryimage"},"datePublished":"2017-09-25T12:00:10+00:00","dateModified":"2022-02-19T07:50:34+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"PCOS has no cure. However, if you can stay motivated, you can keep this condition at bay forever. Find out 7 motivation tips for fighting PCOS.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Top 7 Motivation Tips For Fighting PCOS"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13774"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=13774"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13774\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/20331"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=13774"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=13774"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=13774"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}