{"id":1715,"date":"2016-07-19T08:02:50","date_gmt":"2016-07-19T15:02:50","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=1715"},"modified":"2021-12-08T13:58:04","modified_gmt":"2021-12-08T08:28:04","slug":"migraines-dont-pop-that-pill","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/","title":{"rendered":"Migraine Treatment: Don’t Pop That Pill"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Especially_When_Your_Migraine_Meds_Dont_Work_But_Why_Would_That_Be\"><span class=\"toc_number toc_depth_1\">1<\/span> Especially When Your Migraine Meds Don’t Work. But Why Would That Be?<\/a><\/li><li><a href=\"#Why_Vitamins_B_And_D_for_Migraine_Treatment\"><span class=\"toc_number toc_depth_1\">2<\/span> Why Vitamins B And D for Migraine Treatment?<\/a><\/li><li><a href=\"#Caffeine\"><span class=\"toc_number toc_depth_1\">3<\/span> Caffeine<\/a><\/li><li><a href=\"#Coenzyme_Q10\"><span class=\"toc_number toc_depth_1\">4<\/span> Coenzyme Q10<\/a><\/li><li><a href=\"#Butterbur\"><span class=\"toc_number toc_depth_1\">5<\/span> Butterbur<\/a><\/li><li><a href=\"#Magnesium\"><span class=\"toc_number toc_depth_1\">6<\/span> Magnesium<\/a><\/li><li><a href=\"#Feverfew_Tanacetum_parthenium\"><span class=\"toc_number toc_depth_1\">7<\/span> Feverfew (Tanacetum parthenium)<\/a><\/li><li><a href=\"#Revamp_Your_Lifestyle_Non-Conventional_Cures_to_Migraines\"><span class=\"toc_number toc_depth_1\">8<\/span> Revamp Your Lifestyle: Non-Conventional Cures to Migraines<\/a><\/li><li><a href=\"#Yoga\"><span class=\"toc_number toc_depth_1\">9<\/span> Yoga<\/a><\/li><li><a href=\"#Exercise_Regularly\"><span class=\"toc_number toc_depth_1\">10<\/span> Exercise Regularly<\/a><\/li><li><a href=\"#Sleep_Regularly\"><span class=\"toc_number toc_depth_1\">11<\/span> Sleep Regularly<\/a><\/li><li><a href=\"#Stay_Hydrated\"><span class=\"toc_number toc_depth_1\">12<\/span> Stay Hydrated<\/a><\/li><\/ul><\/div>\n<p>For nearly a decade, I watched my mom suffer from debilitating migraine attacks. Her headaches lasted anywhere between 3 days to 2 weeks. Consults with headache specialists, neurologists, gastroenterologists and general physicians led to the same migraine treatment protocol – a potent cocktail of prescription meds. Unfortunately, none worked. What was worse, she encountered nasty drug side effects like weight gain.<\/p>\n<p>Until her therapist, in holistic healthcare, figured it was her low levels of Vitamins D3 and B12 that were triggering her pain attacks. Four months of vitamin supplementing helped her get rid of migraines and truly gain a new life. She then went on to set up sepalika.com with her therapist, to help others understand the power of dietary supplements to help them with their chronic health conditions. Sadly, not one of the specialists she met over the years ever went down the dietary supplement route.<\/p>\n<p>Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help with migraines. These vitamins, amongst other nutritional supplements and simple lifestyle hacks, may be the magic formula to curing your unstoppable migraine.<\/p>\n<h2><span id=\"Especially_When_Your_Migraine_Meds_Dont_Work_But_Why_Would_That_Be\">Especially When Your Migraine Meds Don’t Work. But Why Would That Be?<\/span><\/h2>\n<p>Migraines can be caused by a variety of factors– stress, allergies to certain foods or alcohol, hormonal or chemical imbalances in the body and the brain, poor physical health or even emotional imbalances. When the causes are so many, pinpointing the right trigger for your migraine may take a very long time, leaving you on a lengthy, arduous and endless path of trial and error medications, which can do more harm than good.<\/p>\n<div id=\"attachment_18544\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image5.webp\"><img aria-describedby=\"caption-attachment-18544\" class=\"size-full wp-image-18544\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image5.webp\" alt=\"Migraines can be caused by stress, allergies to certain foods, alcohol, hormonal imbalances, poor physical health or even emotional imbalances.\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18544\" class=\"wp-caption-text\">Migraines can be caused by stress, allergies to certain foods, alcohol, hormonal imbalances, poor physical health or even emotional imbalances.<\/p><\/div>\n<p>Most medications are stopgap measures – only temporarily suppressing painful migraine symptoms.<\/p>\n<div class=\"quote-text-new\">But they don’t stop the pain from coming back, as most migraine sufferers know only too well.<\/div>\n<p>Moreover, long-term reliance on medications may make your body weak and dependent, reducing its ability to heal the cause of the migraine on its own.<\/p>\n<div class=\"quote-text-new\">If you’re not careful, overdosing on painkillers pushes your body from dependence to tolerance, where your body stops reacting to the medication, resulting in what is called the ‘rebound phenomenon’.<\/div>\n<p>This is the term for a chronic, daily headache that springs up when your body doesn’t respond to medications any longer. If you’re into self-medication, treating yourself with over the counter medications might be dangerous, since you have no way of knowing how certain medications might affect you, depending on your specific cause.<\/p>\n<p>If you’re over 65 years of age, there is a good chance that the medications prescribed to you might not work at all.<\/p>\n<div class=\"quote-text-new\">Since there is still a lack of thorough research on the 65+ age group for migraines, ageing adults are prescribed medications from a general, non-specific group of medications, which means you have no way of knowing exactly what will work for you.<\/div>\n<p>Migraine medications are thus a gamble – but the path to curing your migraine doesn’t have to be played by chance.<\/p>\n<p>Improving your nutrition through vitamin supplements and altering your lifestyle in small ways can actually make the world of a difference in dealing with your migraine treatment.<\/p>\n<h2><span id=\"Why_Vitamins_B_And_D_for_Migraine_Treatment\">Why Vitamins B And D for Migraine Treatment?<\/span><\/h2>\n<div id=\"attachment_18545\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image6.webp\"><img aria-describedby=\"caption-attachment-18545\" class=\"size-full wp-image-18545\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image6.webp\" alt=\"vitamins B &amp; D for migraines treatment\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18545\" class=\"wp-caption-text\">vitamins B &amp; D for migraines treatment<\/p><\/div>\n<p>When your brain is in a state of agitation, for whatever the reason – physical, emotional, chemical or hormonal – the neurons in your brain become hypersensitive, which is what allows you to feel so much pain. This is aided by the release of the chemical<strong> homocysteine<\/strong>, which increases your vulnerability to migraine attacks. Clinical research shows that Vitamin B12, B2 (also known as riboflavin) and folic acid help reduce the levels of homocysteine in your brain. This, in turn, reduces hypersensitivity in the brain, and studies show that the intake of B Vitamins has brought down the frequency and pain level of migraine attacks in people.<\/p>\n<p>Interestingly, an American study showed that the majority of people who suffered from migraines also had a Vitamin D deficiency. Guess what? This deficiency also leads to cardiovascular disease, some of the symptoms of which are linked to migraines, especially in older people. Consuming foods or supplements rich in Vitamin D can bring down the occurrence and pain level of migraines, along with promoting cardiovascular health and reducing the onset of osteoporosis, giving you all round well being. Just remember – if you choose to go with a Vitamin D supplement, ensure that you have enough magnesium in your diet. Or supplement with magnesium as well. These two, along with calcium and Vitamin K2, form a close quartet and must be properly balanced in the body.<\/p>\n<p>Substituting your migraine medications with vitamins over the long term can not only help with them being two of the best supplements for migraine, but also strengthen your body and reduces its dependence on chemicals for life.<\/p>\n<p>If the D or B family vitamins are not your problem, here are a few other supplements that could you could try to help crush that migraine. Remember, one size does not fit all and you would do well to try one thing at a time.<\/p>\n<h2><span id=\"Caffeine\">Caffeine<\/span><\/h2>\n<p>Caffeine constricts blood vessels and reduces pain, so a nice cup of coffee should be a quick cure for your headaches. However, excess caffeine leads to high blood pressure, which would increase the pain – so be careful with the balance on this one.<\/p>\n<p><strong>Dosage:<\/strong> 250mg per day (when taken as a supplement)<\/p>\n<h2><span id=\"Coenzyme_Q10\">Coenzyme Q10<\/span><\/h2>\n<p>CoQ10 is an antioxidant that helps remove damaging free radicals in the body. Much like vitamins, it also aids proper cell function and provides energy, thus helping reduce migraine occurrences. Natural sources include soybean oils, chicken, beef, broccoli and fruits like oranges and strawberries.<\/p>\n<div class=\"box-text-post\"><strong>Dosage<\/strong>: 100mg three times a day<\/div>\n<h2><span id=\"Butterbur\">Butterbur<\/span><\/h2>\n<p>The extract from the butterbur shrub has been shown in some cases to prevent frequent headaches. Be very careful that the sample of extract you purchase has been removed of all carcinogenic substances beforehand.<\/p>\n<p><strong>Dosage:<\/strong> 50-100mg twice a day with meals<\/p>\n<h2><span id=\"Magnesium\">Magnesium<\/span><\/h2>\n<p>Most people who suffer from migraine also suffer from a magnesium deficiency. This can be caused when there are hormonal changes or imbalances in the body, Magnesium deficiencies occur especially during menstruation. Magnesium supplements can be used to correct this imbalance, reducing the occurrence and severity of migraines. Natural sources include coffee, cocoa, tea, spices and rich green vegetables. Use a citrate or a malate form of magnesium. The oxide form is cheap, but gives many people diarrhea.<\/p>\n<p><strong>Dosage:<\/strong> 300-600mg elemental magnesium, daily<\/p>\n<h2><span id=\"Feverfew_Tanacetum_parthenium\">Feverfew (Tanacetum parthenium)<\/span><\/h2>\n<p>Feverfew is often taken in combination with magnesium and riboflavin (vitamin B2) for maximum effectiveness. Feverfew limits the release of serotonin from platelets, which is one of the causes of migraine. It also inhibits the release of histamine, another migraine aggravating chemical. This reduces the frequency and severity of migraine induced headaches.<\/p>\n<p><strong>Dosage<\/strong>: 50-100mg, daily<\/p>\n<p>As always, consult your doctor for specific doses for yourself, especially if you are already on medications for migraine.<\/p>\n<h2><span id=\"Revamp_Your_Lifestyle_Non-Conventional_Cures_to_Migraines\">Revamp Your Lifestyle: Non-Conventional Cures to Migraines<\/span><\/h2>\n<p>Addressing various causes for migraines may sound tricky, but several of these lead back to physical or emotional stress. This stress then manifests itself as perpetually contracted muscles, high blood pressure, chemical or hormonal imbalances and hypersensitive brain activity, all of which lead to – you guessed it – your migraine. The key to reducing this stress on your body can be found in simple, yet life-altering migraine hacks listed below. If you have any serious health condition that prevents you from making exercise part of your life, please consult your doctor and only do what is physically appropriate for you.<\/p>\n<h2><span id=\"Yoga\">Yoga<\/span><\/h2>\n<div id=\"attachment_18546\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-1.webp\"><img aria-describedby=\"caption-attachment-18546\" class=\"size-full wp-image-18546\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-1.webp\" alt=\"yoga poses for migraine \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18546\" class=\"wp-caption-text\">yoga poses for migraine<\/p><\/div>\n<ul>\n<li>Results in a reduction in frequency of headaches, pain level, anxiety, and medication use.<\/li>\n<li>Why it works in migraine treatment: Yoga is a form of mind-body therapy, which relaxes the mind to alleviate emotional causes of anxiety and stress. It simultaneously relaxes body, loosening muscles in high tension areas (neck, shoulder, forehead, temples) and hence reduces pain. The breathing and meditation techniques relax nervous system and internal stress response systems, thereby toning and strengthening sensitive nerves and glands. Yoga also stimulates the release of “good hormones” that lower pain levels and correct hormonal imbalances.<\/li>\n<li>Anywhere between 2-3 sessions a week should give you much better results.<\/li>\n<\/ul>\n<h2><span id=\"Exercise_Regularly\">Exercise Regularly<\/span><\/h2>\n<div id=\"attachment_18547\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-2.webp\"><img aria-describedby=\"caption-attachment-18547\" class=\"size-full wp-image-18547\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-2.webp\" alt=\"Exercise regularly for migraine \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18547\" class=\"wp-caption-text\">Exercise regularly for migraine<\/p><\/div>\n<ul>\n<li>Physical activity helps tone the muscles of the body, strengthens arteries and helps blood vessels expand, improving blood flow. This reduces blood pressure and prevents the easy constriction of blood vessels in the brain, which is one of the causes for migraines. Exercising also allows you to physically vent your stress on your external environment, which then prevents the stress from adversely affecting your brain functions.<\/li>\n<li>As with yoga, 2-3 sessions a week of any sport of your choice, including dancing, will do you good.<\/li>\n<\/ul>\n<h2><span id=\"Sleep_Regularly\">Sleep Regularly<\/span><\/h2>\n<div id=\"attachment_18548\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-3.webp\"><img aria-describedby=\"caption-attachment-18548\" class=\"size-full wp-image-18548\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image-3.webp\" alt=\"Migraine and Sleep \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18548\" class=\"wp-caption-text\">Migraine and Sleep<\/p><\/div>\n<ul>\n<li>Our bodies require rest as much as they require food or water, yet we tend to prioritize sleep last on our to-do lists. Our bodies, including the nervous system, use sleep to repair the damage done to it during the day. Poor sleep leads to the untimely and haywire release of chemicals in our body, upsetting natural balances.<\/li>\n<li>A minimum of 6-8 hours for adults, in regular cycles, can remove the most widespread cause of migraines – chemical imbalances and a damaged central nervous system.<\/li>\n<\/ul>\n<h2><span id=\"Stay_Hydrated\">Stay Hydrated<\/span><\/h2>\n<div id=\"attachment_18549\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image4.webp\"><img aria-describedby=\"caption-attachment-18549\" class=\"size-full wp-image-18549\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/07\/migraine_image4.webp\" alt=\"Stay hydrated \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18549\" class=\"wp-caption-text\">Stay hydrated<\/p><\/div>\n<ul>\n<li>Drinking lots of water keeps the muscles hydrated and relaxed, which automatically lowers blood pressure by preventing blood vessels from constricting easily. Lots of water also keeps the neurons in our nervous system healthy, preventing the degeneration and dysfunction that may lead to migraines. If you have any kidney issues, please check with your doctor before increasing your water intake.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Especially When Your Migraine Meds Don’t Work. But Why Would That Be?2 Why Vitamins B And D for Migraine Treatment?3 Caffeine4 Coenzyme Q105 Butterbur6 Magnesium7 Feverfew (Tanacetum parthenium)8 Revamp Your Lifestyle: Non-Conventional Cures to Migraines9 Yoga10 Exercise Regularly11 Sleep Regularly12 Stay Hydrated For nearly a decade, I watched my mom suffer from [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":16849,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine<\/title>\n<meta name=\"description\" content=\"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine\" \/>\n<meta property=\"og:description\" content=\"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-07-19T15:02:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-08T08:28:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"929\" \/>\n\t<meta property=\"og:image:height\" content=\"368\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Antara Agarwal\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg\",\"width\":929,\"height\":368},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/\",\"name\":\"Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#primaryimage\"},\"datePublished\":\"2016-07-19T15:02:50+00:00\",\"dateModified\":\"2021-12-08T08:28:04+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f\"},\"description\":\"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Migraine Treatment: Don’t Pop That Pill\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f\",\"name\":\"Antara Agarwal\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g\",\"caption\":\"Antara Agarwal\"},\"description\":\"Antara suffered from an autoimmune disorder for more than 17 years. Conventional steroids and medication didn't work. She has since used probiotics and other dietary supplements to effectively manage her health condition.\",\"url\":\"https:\/\/www.sepalika.com\/author\/antara-1\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine","description":"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/","og_locale":"en_US","og_type":"article","og_title":"Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine","og_description":"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help","og_url":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2016-07-19T15:02:50+00:00","article_modified_time":"2021-12-08T08:28:04+00:00","og_image":[{"width":929,"height":368,"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Antara Agarwal","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/02\/migraine_header.jpg","width":929,"height":368},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/","name":"Migraine Treatment - Supplements And Lifestyle Tips To Cure Migraine","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#primaryimage"},"datePublished":"2016-07-19T15:02:50+00:00","dateModified":"2021-12-08T08:28:04+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f"},"description":"Migraine Treatment - Amongst other nutritional supplements Vitamin D3 and a Vitamin B Complex have been proven, across several research studies, to help","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/migraines-dont-pop-that-pill\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Migraine Treatment: Don’t Pop That Pill"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f","name":"Antara Agarwal","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g","caption":"Antara Agarwal"},"description":"Antara suffered from an autoimmune disorder for more than 17 years. Conventional steroids and medication didn't work. She has since used probiotics and other dietary supplements to effectively manage her health condition.","url":"https:\/\/www.sepalika.com\/author\/antara-1\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1715"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=1715"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/1715\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16849"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=1715"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=1715"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=1715"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}