{"id":17552,"date":"2021-03-19T14:55:35","date_gmt":"2021-03-19T09:25:35","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=17552"},"modified":"2022-02-19T12:02:04","modified_gmt":"2022-02-19T06:32:04","slug":"fertility-clinic-not-best-choice","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/","title":{"rendered":"Is Your Fertility Clinic Really The Best Choice For You?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#The_Traditional_Approach_To_Fertility_Treatment\"><span class=\"toc_number toc_depth_1\">1<\/span> The Traditional Approach To Fertility Treatment<\/a><\/li><li><a href=\"#So_What_Are_The_Downsides_To_This_Traditional_Approach\"><span class=\"toc_number toc_depth_1\">2<\/span> So, What Are The Downsides To This Traditional Approach?<\/a><\/li><li><a href=\"#Marrying_Functional_Medicine_With_The_Wisdom_Of_Tradition_The_Best_Choice\"><span class=\"toc_number toc_depth_1\">3<\/span> Marrying Functional Medicine With The Wisdom Of Tradition – The Best Choice<\/a><\/li><\/ul><\/div>\n\n<p>If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic. Truth be told, fertility has become a booming business in India. This actually comes as no surprise, considering the increasing infertility rates in our country.<\/p>\n\n\n\n<p>Statistical analysis has shown the <a href=\"https:\/\/www.ijcm.org.in\/article.asp?issn=0970-0218;year=2019;volume=44;issue=4;spage=337;epage=341;aulast=Katole#:~:text=According%20to%20the%20WHO%20report,age%20but%20no%20birth%E2%80%9D%20definition.\">prevalence rate of primary infertility<\/a> ranged from 3.5% to 16.7% in India. In addition, scientists have noted that the prevalence of primary infertility increases with age, higher BMI, irregular menstrual pattern, and family history of infertility. Today, most urban Indian women with successful careers are over the age of 30 by the time they start planning a family. And thanks to our modern lifestyles, many of them are dealing with <a href=\"https:\/\/www.sepalika.com\/pcos\/getting-pregnant-with-pcos\/\">PCOS<\/a>, <a href=\"https:\/\/www.sepalika.com\/pcos\/can-hypothyroid-misdiagnosed-pcos\/\">hormone irregularities<\/a> and stress disorders – all of which necessitate the need for treatments so <strong>fertility can increase<\/strong>.<\/p>\n\n\n\n<p>So, if you are looking for effective fertility treatments, it pays to do a little homework first.<\/p>\n\n\n\n<h2><span id=\"The_Traditional_Approach_To_Fertility_Treatment\"><strong>The Traditional Approach To Fertility Treatment<\/strong><\/span><\/h2>\n\n\n\n<p>If you are reading this, you probably want to know more about <strong>what fertility treatments are there<\/strong> for you, and <strong>which fertility treatment is most effective.<\/strong><\/p>\n\n\n\n<p>We will start by discussing the traditional approach to fertility treatment in India. Let’s say you have been trying to convenience naturally for some time now, and have approached your gynaecologist for help. After running a few blood tests to check your hormone levels and a few transvaginal ultrasounds for follicular study, your gynaecologist will likely put you on clomiphene cycles to promote ovulation every month.<\/p>\n\n\n\n<p>Now, here is the truth &#8211; success rate of clomiphene cycles are as low as 1 in 3, because the problem often lies at foundational levels – which is your general health. Sometimes, issues like digestion, <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-healthy-pregnancy\/\">PCOS<\/a>, <a href=\"https:\/\/www.sepalika.com\/hypothyroidism\/hypothyroidism-whats-happening\/\">thyroid function<\/a>, and <a href=\"https:\/\/www.sepalika.com\/pcos\/what-is-ovulation-and-how-to-ovulate-naturally-in-pcos\/\">insulin resistance<\/a>, are the culprits behind infertility, which are rarely addressed by your gynaecologist or fertility specialist. Add to that the cost of these medications and injections, which range anywhere from Rs. 4500 to 6000, depending on where you live.&nbsp; Bear in mind that there will be 3 to 6 such cycles. If you are lucky, you might get pregnant. If not, your gynaecologist will refer you to a fertility expert for IUI or IVF treatments.<\/p>\n\n\n\n<p>Usually, your fertility expert will recommend IUI treatment with clomiphene along with Gonadotropins, especially if you ovulate irregularly or do not ovulate at all. In order to increase the success rate of getting pregnant naturally, your doctor will also conduct blood tests, transvaginal ultrasound, and few other tests to increase your chances of getting pregnant naturally. IUI treatments cost roughly Rs.50, 000 per cycle, and come with the additional cost of Follicle Monitoring and development monitoring. A series of 3 or 4 ultrasound scans are carried out for every cycle, which increases the cost.<\/p>\n\n\n\n<p>But, here is what you should know &#8212; the <a href=\"https:\/\/www.drvaishalisharma.com\/fertility-treatments\/iui-treatment\/iui-cost-in-india\/#:~:text=4500%20to%20Rs.,available%20at%20an%20affordable%20budget.\">success rate of getting pregnant is still very low<\/a>. If you are under 30 years of age, you have just 10-20% success rate per cycle. And for women who are over 35 years of age, the success rate is as low as 10%. Chances are; you will need multiple IUI cycles before you successfully conceive a baby, if at all.<\/p>\n\n\n\n<p>And that brings us to the most popular (and expensive) fertility treatment – IVF or in-vitro fertilization, wherein a healthy egg and sperm combine outside of your body in a petri-dish, and then implanted into the body. A single IVF cycle can cost anywhere between Rs. 1,50,000 to 3,00,000 depending on your location, age and infertility issues. Now, here is the doozy, and what no one tells you. Only 1 in 3 IVF treatments actually take. Which means &#8211; you will probably need multiple IVF cycles to successfully get pregnant and actually carrying your baby to term. <a href=\"https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S0015028298000831\">Studies<\/a> have found pregnancy and delivery rates for IVF cycles 1, 2, 3, 4, and over 4 were 33.7% and 27.0%, 33.9% and 27.4%, 28.9% and 23.4%, 25.9% and 16.1%, and 21.0% and 15.4%, respectively. As you can see, the pregnancy rate decreased significantly for over 4 cycle; delivery rate decreased significantly for cycles 4 and &gt;4.&nbsp;<\/p>\n\n\n\n<h2><span id=\"So_What_Are_The_Downsides_To_This_Traditional_Approach\"><strong>So, What Are The Downsides To This Traditional Approach?<\/strong><\/span><\/h2>\n\n\n\n<p>As you can see, the above mentioned traditional approach to fertility is not as simple a process as you thought it will be.<\/p>\n\n\n\n<p>Firstly, the success rates are not very encouraging. And when you are considering <strong>which fertility clinic to choose<\/strong>, this is the most important consideration. If you aren’t one of the lucky ones who get naturally pregnant through just clomiphene cycles, you will probably need multiple cycles of IUI and IVF, racking up costs as well as emotional plus physical distress.<\/p>\n\n\n\n<p>And that’s the second downside – the cost. It is not uncommon for couples to undergo 3 to 4 rounds of IVF before successfully getting pregnant and carrying their baby to term. Even if you do get pregnant, the chances of miscarriage are high. It’s an established fact that while a risk of miscarriage is 15-20% in women who conceive naturally, <a href=\"https:\/\/www.hinsdale-ivf.com\/news\/2018\/12\/15\/ways-to-prevent-miscarriage-after-ivf#:~:text=In%20a%20study%2C%20it%20was,to%20prevent%20miscarriage%20after%20IVF.\">the risk increases to 22% for women<\/a> who conceive through IVF. <a href=\"https:\/\/academic.oup.com\/humrep\/article\/29\/6\/1218\/625512?login=true\">Research<\/a> shows that miscarriage rate is also higher with advanced age, secondary infertility and a female cause of infertility compared with a younger age, male factor infertility and unexplained cause.<\/p>\n\n\n\n<p>And honestly, this makes sense, since the higher rate of miscarriage is due to the fact that underlying health issues like PCOS, digestion issues, thyroid dysfunction and nutritional deficiencies have not been addressed during the fertility treatment. After all, it is not just about getting pregnant, but also carrying your baby to term. <em>And the only way to carry your baby to term is to have a well-functioning, healthy body that can not only preserve itself but also procreate.<\/em> You see, preservation and procreation are two very different things, and the human body will only successfully procreate when it is in prime health. Not marred with underlying health issues that make pregnancy an even more stressful event.<\/p>\n\n\n\n<p>And with that, we come to the third downside of traditional approach to fertility. Most fertility treatments, be it IUI or IVF, are invasive procedures that come with numerous side effects. From reactions to the hormone injections to extreme weight gain, bloating, nausea, abdominal pain, pelvic infections, risk of ectopic and multiple pregnancies and extreme emotional stress – the risks are many. This <a href=\"https:\/\/www.statnews.com\/2018\/07\/27\/as-the-dark-side-of-ivf-slowly-comes-into-focus-even-more-transparency-is-needed\/\">article<\/a> sheds better light on some of the things you should know before considering IVF treatments.<\/p>\n\n\n\n<h2><span id=\"Marrying_Functional_Medicine_With_The_Wisdom_Of_Tradition_The_Best_Choice\"><strong>Marrying Functional Medicine With The Wisdom Of Tradition – The Best Choice<\/strong><\/span><\/h2>\n\n\n\n<p>When <strong>fertility treatment comes<\/strong> with so many drawbacks, it can be rather daunting to choose the right fertility clinic that is best suited to your goals. Don’t worry; we are here to tell you that you can get pregnant successfully, without a lot of heartache (<em>not to mention, several lakhs of money!<\/em>) involved.<\/p>\n\n\n\n<p>This is where Sepalika is different from your usual, traditional fertility clinics. Unlike a fertility expert who starts on the fifth floor (<em>meaning, he\/she starts right at boosting ovulation and helping you produce more than one healthy ovum per cycle for increased success of IUI\/IVF<\/em>), we start at the very foundation of your health. Why is your body not producing a healthy ovum? If it is, why is it difficult for you to conceive naturally? What hormonal imbalances need to be addressed for you to conceive naturally? Or perhaps, your infertility is a result of thyroid dysfunction or digestion related issues? Or maybe the fertility issues of the male partner have gone unnoticed until now? We address all these issues and more with a combination approach that uses modern medicine, Ayurvedic therapies and acupressure to balance energies.<\/p>\n\n\n\n<p>Additionally, we work only with couples who want to conceive the healthy, natural ways and not just with the wife. “<em>Working with Sepalika gave us whole new insights into <strong>can fertility come back<\/strong> and how that works. Using their diagnosis and natural therapies, my husband’s sperm count came up in just two months. We will forever be thankful to Sepalika for gifting us the joys of parenthood<\/em>, “says patient Sristi Srivastava, 33.<\/p>\n\n\n\n<p>By combining cutting-edge western lab test analysis with the wisdom of traditional medicine and functional medicine, we are able to address the foundational issues with your fertility – all the way from the root to the fruit. At our clinic, experts identify problems that could be contributing to your infertility – be it flaws in the reproductive system to the digestive system and endocrine system &#8211;&nbsp; using Functional Blood Chemistry Analysis that combines assisted analysis of lab tests and radiology reports to give us a clearer picture of what could possibly be wrong with your body.<\/p>\n\n\n\n<p>Based on your results, we recommend dietary supplements that conventional doctors rarely use, depending on what and where your body is lacking. If your lab reports show a dysfunctional thyroid, our doctors might suggest the use of Bio Identical Hormones to support your body’s hormone needs. Bear in mind, these are not the artificial hormones injected into your body during traditional IVF treatments, and these come without unwanted side-effects.&nbsp;<\/p>\n\n\n\n<p>Additionally, your <strong>fertility can be impaired by<\/strong> nutritional and lifestyle issues that our holistic nutritionists and acupressure experts assess via questionnaires and interviews so they can help balance your diet and find ways to boost your fertility naturally. We use the <a href=\"https:\/\/www.sepalika.com\/5-petal-way\/\">Sepalika 5 Petal Program<\/a> to balance your hormones naturally, so that you can conceive a baby without unnecessary medical\/hormonal interventions.<\/p>\n\n\n\n<p>We understand that disease prevention and procreation are two very different things, and require different levels of peak health. For example, one of our patients suffered two miscarriages and came to us in dismay after checking with other fertility clinics. We soon realised that she had nutritional deficiencies, from a gallbladder removal she had several years ago. &nbsp;“<em>No one told me that not having a gallbladder could hamper my chances of having a baby! After going through two miscarriages, I knew that the only way to have a healthy baby was to get my body back in tune with nature. On the Sepalika programme, I lost&nbsp;6 kgs weight, 3 inches on waist and 2 inches on hip, and finally conceived naturally. The Team&nbsp;looked after me even through the tricky first trimester, to ensure that I did not have a tragedy again. There are so many amazing little techniques in our traditional medicine, and Sepalika marries them with the modern science of lab testing, natural supplements and acupressure, to deliver unbelievable results to people. Thanks Sepalika, for the joy of parenthood!<\/em>”&nbsp;Sharmila Shah 29 years (in March 2019)<\/p>\n\n\n\n<p>At our fertility clinic, you have a world-class medical team at your disposal that ensure you get the best of the East and West, and your journey back to vibrant health and vibrant fertility is a successful one!<\/p>\n\n\n\n<h4><a href=\"https:\/\/www.sepalika.com\/programs\/fertility-program\/\" target=\"_blank\" rel=\"noreferrer noopener\">Want To Explore More? Checkout Sepalika Fertility Program<\/a><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 The Traditional Approach To Fertility Treatment2 So, What Are The Downsides To This Traditional Approach?3 Marrying Functional Medicine With The Wisdom Of Tradition – The Best Choice If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":21274,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[172],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Is Your Fertility Clinic Really The Best Choice For You? - Sepalika<\/title>\n<meta name=\"description\" content=\"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Is Your Fertility Clinic Really The Best Choice For You? - Sepalika\" \/>\n<meta property=\"og:description\" content=\"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\" \/>\n<meta property=\"article:published_time\" content=\"2021-03-19T09:25:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T06:32:04+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mahesh Jayaraman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp\",\"width\":350,\"height\":350,\"caption\":\"fertility\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/\",\"name\":\"Is Your Fertility Clinic Really The Best Choice For You? - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#primaryimage\"},\"datePublished\":\"2021-03-19T09:25:35+00:00\",\"dateModified\":\"2022-02-19T06:32:04+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\"},\"description\":\"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Is Your Fertility Clinic Really The Best Choice For You?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\",\"name\":\"Mahesh Jayaraman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"caption\":\"Mahesh Jayaraman\"},\"description\":\"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.\",\"sameAs\":[\"http:\/\/sepalika.com\",\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Is Your Fertility Clinic Really The Best Choice For You? - Sepalika","description":"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/","og_locale":"en_US","og_type":"article","og_title":"Is Your Fertility Clinic Really The Best Choice For You? - Sepalika","og_description":"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.","og_url":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/profile.php?id=100009879845215","article_published_time":"2021-03-19T09:25:35+00:00","article_modified_time":"2022-02-19T06:32:04+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Mahesh Jayaraman","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/03\/fertility-1.webp","width":350,"height":350,"caption":"fertility"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#webpage","url":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/","name":"Is Your Fertility Clinic Really The Best Choice For You? - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#primaryimage"},"datePublished":"2021-03-19T09:25:35+00:00","dateModified":"2022-02-19T06:32:04+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4"},"description":"If you have been trying to have a baby naturally for sometimes now, chances are that you are on the lookout for a good fertility clinic.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/fertility\/fertility-clinic-not-best-choice\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Is Your Fertility Clinic Really The Best Choice For You?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4","name":"Mahesh Jayaraman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","caption":"Mahesh Jayaraman"},"description":"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.","sameAs":["http:\/\/sepalika.com","https:\/\/www.facebook.com\/profile.php?id=100009879845215","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/17552"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=17552"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/17552\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/21274"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=17552"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=17552"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=17552"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}