{"id":18206,"date":"2021-10-08T11:52:16","date_gmt":"2021-10-08T06:22:16","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=18206"},"modified":"2022-02-19T11:25:07","modified_gmt":"2022-02-19T05:55:07","slug":"conquering-genetic-infertility-issues","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/","title":{"rendered":"Conquering Genetic Infertility Issues"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#What_is_Genetic_Infertility\"><span class=\"toc_number toc_depth_1\">1<\/span> What is Genetic Infertility?<\/a><\/li><li><a href=\"#Chromosomal_abnormalities\"><span class=\"toc_number toc_depth_1\">2<\/span> Chromosomal abnormalities<\/a><\/li><li><a href=\"#Single_Gene_Defects\"><span class=\"toc_number toc_depth_1\">3<\/span> Single Gene Defects<\/a><\/li><li><a href=\"#Genetic_Disorders_in_Men_and_Women\"><span class=\"toc_number toc_depth_1\">4<\/span> Genetic Disorders in Men and Women<\/a><\/li><li><a href=\"#Genetic_Infertility_in_Men\"><span class=\"toc_number toc_depth_1\">5<\/span> Genetic Infertility in Men<\/a><\/li><li><a href=\"#Genetic_Infertility_in_Women\"><span class=\"toc_number toc_depth_1\">6<\/span> Genetic Infertility in Women<\/a><\/li><li><a href=\"#Diagnosing_and_Testing_for_Genetic_Infertility\"><span class=\"toc_number toc_depth_1\">7<\/span> Diagnosing and Testing for Genetic Infertility<\/a><\/li><li><a href=\"#Pre-Fertilization_Testing\"><span class=\"toc_number toc_depth_1\">8<\/span> Pre-Fertilization Testing<\/a><ul><li><a href=\"#Pre-fertilization_screening_tests_include\"><span class=\"toc_number toc_depth_2\">8.1<\/span> Pre-fertilization screening tests include:<\/a><\/li><li><a href=\"#Post-fertilization_Testing\"><span class=\"toc_number toc_depth_2\">8.2<\/span> Post-fertilization Testing:<\/a><\/li><\/ul><\/li><li><a href=\"#Genetic_Counseling\"><span class=\"toc_number toc_depth_1\">9<\/span> Genetic Counseling<\/a><\/li><li><a href=\"#The_Solution_Functional_Medicine_Approach_to_Treating_Infertility\"><span class=\"toc_number toc_depth_1\">10<\/span> The Solution: Functional Medicine Approach to Treating Infertility<\/a><\/li><\/ul><\/div>\n\n<p>Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with <a href=\"https:\/\/www.researchgate.net\/publication\/51837664_Chromosomal_disorders_and_male_infertility\" target=\"_blank\" rel=\"noreferrer noopener\">fertility issues<\/a> . Just like any other medical issue, the key to treating infertility lies in understanding its causes and developing treatment plans specific to the patient’s history and needs. <br><br>Genetic abnormalities can drive infertility in both men and women. Will genetic infertility spell the end of your pregnancy dreams? No! Developments in genetic research, testing and diagnosis have made it easier to identify causes of genetic infertility. And, contrary to popular belief, expensive surgeries and invasive treatments are not your only option. In many cases, genetic infertility can be treated through holistic functional medicine. More simply, making substantive, <a href=\"https:\/\/www.sepalika.com\/fertility\/improve-fertility-diet-meal-plan\/\">healthy changes to your diet<\/a> and lifestyle can help you overcome fertility issues and get you one step closer to holding your dream baby.<\/p>\n\n\n\n<h2><span id=\"What_is_Genetic_Infertility\"><strong>What is Genetic Infertility?<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"612\" height=\"424\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/istockphoto-1202269795-612x612-1.webp\" alt=\"broken open egg shells with matching tops\" class=\"wp-image-21239\"\/><figcaption>broken open egg shells with matching tops<\/figcaption><\/figure><\/div>\n\n\n\n<p>To understand how we can treat genetic fertility issues, it’s important to first understand the genetic roots of this problem. There are 2 primary types of genetic issues that affect fertility.<\/p>\n\n\n\n<h2><span id=\"Chromosomal_abnormalities\"><strong>Chromosomal abnormalities<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"1024\" height=\"683\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/4F5CB304976E5ACA8AD5FF030EB85239-1024x683-1.webp\" alt=\"Chromosomal abnormalities\" class=\"wp-image-21238\"\/><figcaption>Chromosomal abnormalities<\/figcaption><\/figure><\/div>\n\n\n\n<p>Here’s a quick throwback to high-school biology: each cell in the human body contains 23 pairs of chromosomes, which give us 46 chromosomes in total. Half our chromosomes come from one parent, and the other half from the other parent. Each chromosome contains thousands of genes which dictate all our body’s functions: development, growth, and the chemical reactions within our body.<\/p>\n\n\n\n<p>A small portion of the population is born with chromosomal abnormalities. These occur when we are either missing entire chromosomes, or when we have extra chromosomes attached to the existing 23 pairs. In other cases, a section of a chromosome might be missing, extra or attached to another chromosome.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK115545\/\" target=\"_blank\" rel=\"noreferrer noopener\">Chromosomal abnormalities<\/a>, which often occur as an accident during the early developmental stages of a fetus, can result in a range of issues like miscarriage, disease, or growth and developmental disorders like Down’s Syndrome.<\/p>\n\n\n\n<h2><span id=\"Single_Gene_Defects\"><strong>Single Gene Defects<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"800\" height=\"420\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/Single-Gene-Disorders.webp\" alt=\"Single Gene Defects\" class=\"wp-image-21234\"\/><figcaption>Single Gene Defects<\/figcaption><\/figure><\/div>\n\n\n\n<p>Single gene defects are exactly what they sound like – they are a mutation or change in a single gene within a chromosome (as opposed to an issue with the chromosome itself). Several single genes control human puberty and fertility. These genes can be found in 4 locations: the hypothalamus, the pituitary glands, the gonads, and the outflow tract. <a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/14575025\/\" target=\"_blank\" rel=\"noreferrer noopener\">Genetic mutations<\/a> in any of these organs can interfere with reproductive development and health, causing infertility.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK132154\/\" target=\"_blank\" rel=\"noreferrer noopener\">Single-gene disorders<\/a> are relatively simple to understand and identify (since they only affect one gene). They are also hereditary – a single gene defect can be passed on from a parent to a child. This makes it easier to trace a single gene disorder through generations of a family. A couple with known genetic disorders in their families can work around it should they be planning to have a child.<br><br>Single gene defects can lead to a range of health issues, including cystic fibrosis, Tay Sachs disease, spinal muscular atrophy, Canavan disease, sickle cell disease and thalassemia&#8217;s. These health problems adversely affect the body’s physical, chemical, and hormonal functions, which in turn can cause genetic fertility issues.<br><br>Depending on the person’s environment and other genetic variations, the same single cell defect can manifest as different symptoms in different cases. This can be good news; if diagnosed early, some single cell disorders can be treated through changes to your diet, which is one part of functional therapy for genetic disorders.<\/p>\n\n\n\n<h2><span id=\"Genetic_Disorders_in_Men_and_Women\"><strong>Genetic Disorders in Men and Women<\/strong><\/span><\/h2>\n\n\n\n<p>Historically, societies have blamed pregnancy losses and fertility issues on women. However, genetic abnormalities can cause infertility in men, women, or in both sexes, depending on whether the <a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1319562X17303303\" target=\"_blank\" rel=\"noreferrer noopener\">inherited abnormality<\/a> is found on the X chromosome, the Y chromosome or in chromosomes 1-22. Issues arising from <em>either parent<\/em> can lead to problems with pregnancy. Fertility issues can show at several stages during the pregnancy process, whether it is problems with conceiving, miscarriage, and spontaneous abortion (pregnancy loss at less than 20 weeks), or genetic and\/or physical defects post birth.<\/p>\n\n\n\n<p>Single-gene disorders that affect both sexes include a mutation in the <em>GNRHR<\/em> gene, which leads to abnormal or incomplete puberty – and consequently, infertility – in men and women. Mutations in the SYCP3 gene can cause a lack of sperm in men and pregnancy loss in women. <a href=\"https:\/\/lomalindafertility.com\/infertility\/genetic-disorders-affect-infertility\/\" target=\"_blank\" rel=\"noreferrer noopener\">Genetic disorders<\/a> that can cause infertility <em>and <\/em>be passed on to children include sickle cell anemia, cystic fibrosis, and Huntington’s disease.<\/p>\n\n\n\n<h2><span id=\"Genetic_Infertility_in_Men\"><strong>Genetic Infertility in Men<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/Stress-iStock-869257552-1.webp\" alt=\"Genetic Infertility in Men\" class=\"wp-image-21235\" width=\"840\" height=\"560\"\/><figcaption>Genetic Infertility in Men<\/figcaption><\/figure><\/div>\n\n\n\n<p><a href=\"https:\/\/www.researchgate.net\/publication\/51837664_Chromosomal_disorders_and_male_infertility\" target=\"_blank\" rel=\"noreferrer noopener\">Genetic disorders<\/a> cause between 2-8% of male infertility cases. <a href=\"https:\/\/fertility.womenandinfants.org\/services\/male-infertility\/genetic-disorders-infertility-in-men\" target=\"_blank\" rel=\"noreferrer noopener\">Genetic abnormalities<\/a> can cause the absence of or low concentration of sperm (azoospermia), blockage of ducts that carry sperm out of the testes, mutation of sperm shape, poor-quality sperm (teratozoospermia) and low or no activation of sperm mobility once semen is deposited in the uterus (asthenozoospermia).<br><br>Some male-specific genetic infertility problems include the male-only cystic fibrosis mutation; Klinefelter syndrome, which accounts for around 11% of azoospermic individuals (when there is no sperm in the ejaculate); spermatogenesis and a mutated aurora kinase-C gene, which causes infertility through abnormally shaped sperm.<\/p>\n\n\n\n<h2><span id=\"Genetic_Infertility_in_Women\"><strong>Genetic Infertility in Women<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"750\" height=\"563\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/Stressed_woman_iStock-865618914_spukkato.webp\" alt=\"Genetic Infertility in Women\" class=\"wp-image-21236\"\/><figcaption>Genetic Infertility in Women<\/figcaption><\/figure><\/div>\n\n\n\n<p>Genetic abnormalities in women can affect ovulation. Common conditions include cystic fibrosis mutations, Kallmann syndrome (where the body is unable to produce the pituitary or hypothalamic hormone) and ciliary dyskinesia, causing abnormal cilia in the fallopian tubes.<br><br>Genetic fertility issues in women manifests most commonly as poor ovulation, miscarriages, early menopause, and pregnancy loss. A family history of endometriosis and early menopause can also be indicators of genetic disorders that can affect fertility.<\/p>\n\n\n\n<h2><span id=\"Diagnosing_and_Testing_for_Genetic_Infertility\"><strong>Diagnosing and Testing for Genetic Infertility<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"960\" height=\"520\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/NWS_GENETIC-1.webp\" alt=\"Diagnosing and Testing for Genetic Infertility\" class=\"wp-image-21232\"\/><figcaption>Diagnosing and Testing for Genetic Infertility<\/figcaption><\/figure><\/div>\n\n\n\n<p>If you have a history of genetic disorders and\/or infertility, or if you are experiencing issues conceiving successfully, it can be extremely useful to undergo genetic testing. Getting an accurate diagnosis for genetic infertility can help a couple receive the right kind of treatment they need and can also help decide whether they need to look at alternative options for having a child.<\/p>\n\n\n\n<h2><span id=\"Pre-Fertilization_Testing\"><strong>Pre-Fertilization Testing<\/strong><\/span><\/h2>\n\n\n\n<p>These screening tests can diagnose causes of genetic infertility that are preventing a couple from getting pregnant. Testing is advisable especially to those couples who either have a known genetic disorder, already have a child with a disorder or birth defect, or if either (or both) partner’s family has a history of genetic disorders.<\/p>\n\n\n\n<h3><span id=\"Pre-fertilization_screening_tests_include\">Pre-fertilization screening tests include:<\/span><\/h3>\n\n\n\n<ul><li><strong>Diagnostic Testing:<\/strong> If you have symptoms of a disorder, <a href=\"https:\/\/www.mayoclinic.org\/tests-procedures\/genetic-testing\/about\/pac-20384827\" target=\"_blank\" rel=\"noreferrer noopener\">testing<\/a> can be sued to confirm a diagnosis (like cystic fibrosis or Huntington’s disease).<\/li><li><strong>Pre-symptomatic\/Predictive testing:<\/strong> to predict whether you are at risk of developing a genetic disorder if you have a family history of that condition.<\/li><li><strong>Carrier testing:<\/strong> This can detect particular genetic mutations and find out whether you and your partner are carriers for the same conditions (which you may pass on to your child).<\/li><\/ul>\n\n\n\n<h3><span id=\"Post-fertilization_Testing\">Post-fertilization Testing:<\/span><\/h3>\n\n\n\n<ul><li><strong>Prenatal Testing: <\/strong>If you are pregnant, this test can detect whether your baby’s genes have any abnormalities (Down’s syndrome is often identified through this test).<\/li><li><strong>Newborn Screening: <\/strong>Tests newborn babies for genetic and other disorders. This is crucial in identifying health issues and starting treatment right away.<\/li><\/ul>\n\n\n\n<ul><li><strong>IVF and PGT testing: <\/strong>If a couple is undergoing IVF, they can opt for pre-implantation genetic testing (PGT). PGT involves screening every single embryo for single-gene and chromosomal abnormalities <em>before <\/em>implantation in the uterus. Embryos that reveal a genetic abnormality are not used in the implantation process. This decreases the likelihood that a genetic disorder will be passed onto a resulting child, and it maximizes the chances of a successful pregnancy by using healthy, genetically normal embryos during the implantation process.<\/li><\/ul>\n\n\n\n<h2><span id=\"Genetic_Counseling\"><strong>Genetic Counseling<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"1000\" height=\"665\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_431851987.webp\" alt=\"Genetic Counseling\" class=\"wp-image-21231\"\/><figcaption>Genetic Counseling<\/figcaption><\/figure><\/div>\n\n\n\n<p>Genetic counseling usually occurs before genetic testing. It is provided by healthcare professionals who help couples to make educated decisions about which genetic tests would be the most useful for them. You can get genetic counseling before you try to conceive at all, or in cases where you are considering IVF or PGT.<\/p>\n\n\n\n<p>This process can be especially useful to couples trying to conceive with little to no family history or known background of genetic disorders. Counselors examine your own medical and personal background and can also help examine family history to determine whether there may be specific genetic causes of infertility. It is also useful if you have had multiple pregnancy losses or miscarriages or if you had an ultrasound that suggests possible issues with your ongoing pregnancy.<br><br>Genetic counseling can be extremely helpful in pinpointing a reason for infertility, and in guiding you through the process of testing and treatment.<\/p>\n\n\n\n<h2><span id=\"The_Solution_Functional_Medicine_Approach_to_Treating_Infertility\"><strong>The Solution: Functional Medicine Approach to Treating Infertility<\/strong><\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full\"><img width=\"865\" height=\"485\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/Functional-medicine-approach-to-reproductive-health-1.webp\" alt=\"The Solution: Functional Medicine Approach to Treating Infertility\" class=\"wp-image-21233\"\/><figcaption>The Solution: Functional Medicine Approach to Treating Infertility<\/figcaption><\/figure><\/div>\n\n\n\n<p>So, back to the big question: What is the best way for a couple to tackle genetic infertility issues?<br><br>This is where we come in. Conventional medicine practition­­ers tend to prescribe hormonal treatments that focus solely on the male and female reproductive systems. When ovarian stimulation and sperm production medications fail, they turn to expensive (and often, invasive) medical procedures, which have a similarly low chance of producing results (research shows that only 1 out of 3 ovarian stimulation and IVF cycles succeed).<br><br>The truth is, genetic causes of infertility affect more than just your reproductive system. Earlier, we mentioned that genetic disorders affect several organs and glands in the body. When even one of these doesn’t function properly, it throws your hormones out of balance, which <em>in turn<\/em> affects your reproductive organs, leading to infertility. Targeting these genetic conditions (and not just the reproductive system) can help people achieve successful pregnancies.<br><\/p>\n\n\n\n<p>MTHFR defects are a great example of this process. The <a href=\"https:\/\/www.cdc.gov\/ncbddd\/folicacid\/mthfr-gene-and-folic-acid.html\" target=\"_blank\" rel=\"noreferrer noopener\">MTHFR gene<\/a> helps your body process folate (more commonly known as vitamin B-9), which the body needs to make DNA and modify proteins. Our bodies need folate to produce CoQ10, carnitine and creatine, all of which are required for reproduction. A <a href=\"https:\/\/www.santamonicafertility.com\/blog\/mthfr-infertility\/\" target=\"_blank\" rel=\"noreferrer noopener\">genetic variant or mutation <\/a>of the MTHFR gene can lead to idiopathic or unexplained fertility in men and women, causing azoospermia, miscarriages, and birth defects in successful pregnancies. MTHFR gene variations are common – <a href=\"https:\/\/naturnalife.com\/the-role-of-mthfr-in-infertility-and-miscarriages\/\" target=\"_blank\" rel=\"noreferrer noopener\">about 50% of the populations has a mild defect in this gene, and 25% are more seriously affected<\/a>. Studies have found that managing MTHFR mutations can be beneficial for people with<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC6798589\/\" target=\"_blank\" rel=\"noreferrer noopener\"> idiopathic infertility<\/a> who have already gone through failed IVF cycles. Functional medicine targets the MTHFR gene mutation by providing a patient with folate supplements and a diet rich in dark, leafy greens – both of which help the body process folate and generate the chemicals necessary for a successful pregnancy.<br><br>As functional medicine practitioners, we use an evidence-based approach to target the <em>root <\/em>cause of infertility. Infertility issues created by genetic disorders are exacerbated by an unhealthy diet, not enough exercise, lack of sleep, and abnormal levels of stress. Our holistic intake process includes tests to determine which chemicals and hormones your body needs to promote fertility. However, it also includes a comprehensive assessment of your lifestyle to help pinpoint areas you can work on to improve your body’s internal balance and regulation.<br><br>We understand that life is demanding, and that genetic disorders can be incredibly hard to deal with. We work with you to create a healthy lifestyle that will get your organs and hormones working the way they should. Our end goal – the same as yours – is to get your body to a place where it can create a happy, healthy baby.<\/p>\n\n\n\n<p><em>Sepalika runs a natural fertility program using the principles of functional medicine. You may connect with us on: + 91 9867337112 or thrive@sepalika.com.<\/em><\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4> <a href=\"https:\/\/www.sepalika.com\/programs\/fertility-program\/\" target=\"_blank\" rel=\"noreferrer noopener\">Want To Explore More? Checkout Sepalika Fertility Program <\/a> <\/h4>\n\n\n\n<p><br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 What is Genetic Infertility?2 Chromosomal abnormalities3 Single Gene Defects4 Genetic Disorders in Men and Women5 Genetic Infertility in Men6 Genetic Infertility in Women7 Diagnosing and Testing for Genetic Infertility8 Pre-Fertilization Testing8.1 Pre-fertilization screening tests include:8.2 Post-fertilization Testing:9 Genetic Counseling10 The Solution: Functional Medicine Approach to Treating Infertility Genetic Infertility Issues: Infertility in [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":21237,"comment_status":"open","ping_status":"open","sticky":true,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[172],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Conquering Genetic Infertility Issues - Sepalika<\/title>\n<meta name=\"description\" content=\"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Conquering Genetic Infertility Issues - Sepalika\" \/>\n<meta property=\"og:description\" content=\"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2021-10-08T06:22:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T05:55:07+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Antara Agarwal\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp\",\"width\":1000,\"height\":562,\"caption\":\"genetic infertility\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/\",\"name\":\"Conquering Genetic Infertility Issues - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#primaryimage\"},\"datePublished\":\"2021-10-08T06:22:16+00:00\",\"dateModified\":\"2022-02-19T05:55:07+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f\"},\"description\":\"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Conquering Genetic Infertility Issues\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f\",\"name\":\"Antara Agarwal\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g\",\"caption\":\"Antara Agarwal\"},\"description\":\"Antara suffered from an autoimmune disorder for more than 17 years. Conventional steroids and medication didn't work. She has since used probiotics and other dietary supplements to effectively manage her health condition.\",\"url\":\"https:\/\/www.sepalika.com\/author\/antara-1\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Conquering Genetic Infertility Issues - Sepalika","description":"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/","og_locale":"en_US","og_type":"article","og_title":"Conquering Genetic Infertility Issues - Sepalika","og_description":"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues","og_url":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2021-10-08T06:22:16+00:00","article_modified_time":"2022-02-19T05:55:07+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Antara Agarwal","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/10\/shutterstock_1669326868.webp","width":1000,"height":562,"caption":"genetic infertility"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#webpage","url":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/","name":"Conquering Genetic Infertility Issues - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#primaryimage"},"datePublished":"2021-10-08T06:22:16+00:00","dateModified":"2022-02-19T05:55:07+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f"},"description":"Genetic Infertility Issues: Infertility in humans is more common than you think – about 15% of the human population deals with fertility issues","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/fertility\/conquering-genetic-infertility-issues\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Conquering Genetic Infertility Issues"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/121adf5b1eb7b647f507d95908a1a70f","name":"Antara Agarwal","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5732becc4417add113296e46fd6fffed?s=96&d=mm&r=g","caption":"Antara Agarwal"},"description":"Antara suffered from an autoimmune disorder for more than 17 years. Conventional steroids and medication didn't work. She has since used probiotics and other dietary supplements to effectively manage her health condition.","url":"https:\/\/www.sepalika.com\/author\/antara-1\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/18206"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=18206"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/18206\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/21237"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=18206"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=18206"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=18206"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}