{"id":21375,"date":"2022-03-15T18:00:00","date_gmt":"2022-03-15T12:30:00","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=21375"},"modified":"2022-03-14T16:55:18","modified_gmt":"2022-03-14T11:25:18","slug":"side-effects-of-assisted-reproductive-technology-sepalika","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/","title":{"rendered":"Side Effects of Assisted Reproductive Technology | Sepalika"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#What_Is_Assisted_Reproductive_Technology\"><span class=\"toc_number toc_depth_1\">1<\/span> What Is Assisted Reproductive Technology?<\/a><\/li><li><a href=\"#Types_of_Assisted_Reproductive_Procedures\"><span class=\"toc_number toc_depth_1\">2<\/span> Types of Assisted Reproductive Procedures<\/a><ul><li><a href=\"#Intrauterine_insemination_IUI\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Intrauterine insemination (IUI)<\/a><\/li><li><a href=\"#In_Vitro_Fertilization_IVF\"><span class=\"toc_number toc_depth_2\">2.2<\/span> In Vitro Fertilization (IVF)<\/a><\/li><li><a href=\"#Intracytoplasmic_Sperm_Injection_ICSI\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Intracytoplasmic Sperm Injection (ICSI)<\/a><\/li><li><a href=\"#Gamete_Intrafallopian_Transfer_GIFT\"><span class=\"toc_number toc_depth_2\">2.4<\/span> Gamete Intrafallopian Transfer (GIFT)<\/a><\/li><\/ul><\/li><li><a href=\"#How_Successful_Are_Assisted_Reproductive_Procedures\"><span class=\"toc_number toc_depth_1\">3<\/span> How Successful Are Assisted Reproductive Procedures?<\/a><\/li><li><a href=\"#What_Are_The_Side_Effects_Of_Assisted_Reproductive_Techniques\"><span class=\"toc_number toc_depth_1\">4<\/span> What Are The Side Effects Of Assisted Reproductive Techniques?<\/a><\/li><li><a href=\"#Hormonal_imbalance\"><span class=\"toc_number toc_depth_1\">5<\/span> Hormonal imbalance<\/a><\/li><li><a href=\"#Unnatural_hyperstimulation_of_ovaries\"><span class=\"toc_number toc_depth_1\">6<\/span> Unnatural hyperstimulation of ovaries<\/a><\/li><li><a href=\"#Complications_from_surgical_procedures\"><span class=\"toc_number toc_depth_1\">7<\/span> Complications from surgical procedures<\/a><\/li><li><a href=\"#Risks_to_successful_pregnancies\"><span class=\"toc_number toc_depth_1\">8<\/span> Risks to successful pregnancies<\/a><\/li><li><a href=\"#Mental_Health_Implications_of_ART\"><span class=\"toc_number toc_depth_1\">9<\/span> Mental Health Implications of ART<\/a><ul><li><a href=\"#Conclusion\"><span class=\"toc_number toc_depth_2\">9.1<\/span> Conclusion<\/a><\/li><li><a href=\"#So_what_are_your_options_for_Conception\"><span class=\"toc_number toc_depth_2\">9.2<\/span> So, what are your options for Conception?<\/a><\/li><\/ul><\/li><\/ul><\/div>\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-full is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART-1.jpg\" alt=\"\" class=\"wp-image-21379\" width=\"378\" height=\"378\"\/><figcaption>.<\/figcaption><\/figure><\/div>\n\n\n\n<p>15 years ago, infertility was barely heard of. Today, <a href=\"https:\/\/www.who.int\/health-topics\/infertility#tab=tab_1\" target=\"_blank\" rel=\"noreferrer noopener\">15% of couples<\/a> in the reproductive age group are struggling to conceive. Success rates with assisted reproductive technologies (ART) are low, yet they are the go-to option for anyone struggling with fertility even for a short period of time. In this article we will explore why ART is a popular choice, help couples understand what potential side effects ART could have and what safer options they can look at to get pregnant naturally.<\/p>\n\n\n\n<h2><span id=\"What_Is_Assisted_Reproductive_Technology\">What Is Assisted Reproductive Technology?<\/span><\/h2>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/What-is-ART-1-300x300.jpg\" alt=\"\" class=\"wp-image-21383\" width=\"300\" height=\"300\"\/><figcaption>.<\/figcaption><\/figure><\/div>\n\n\n\n<p>Assisted Reproductive Technology (ART) is an umbrella term used for either medical or surgical assistance to increase the likelihood of a successful pregnancy.<br><br>This essentially means subjecting either the sperm or egg or both, to interventions outside of their norm, to increase the chances of pregnancy. A lot of technology, equipment, and even medications go into one procedure of ART, and there are many different stages and variants.<br><br>For women under the age of 34 living in a developed country, a <a href=\"https:\/\/www.who.int\/reproductivehealth\/publications\/infertility\/progress63.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">success rate of about 25%<\/a> can be observed with ART. Often, environmental factors, such as living in a developing nation and the a more advanced age of the couple can significantly lower these rates.<br><br>Despite this, why is it the primary method to manage any case of infertility?<br><br>For one, it is the social stigma attached to infertility. For women in developing nations, their social identity is often closely linked with motherhood. Couples might experience isolation from mainstream society and peers. So rather than share their issues openly to try and find solutions, couples seek specialist care for this issue.<br><br>ART has been marketed as the primary solution for infertility for quite a while now, due to its potential to generate revenues for industry. ART is projected to reach a <a href=\"https:\/\/www.fortunebusinessinsights.com\/industry-reports\/assisted-reproductive-technology-art-market-101811\" target=\"_blank\" rel=\"noreferrer noopener\">USD 40.6 billion market size by 2026<\/a>, despite its low success rate, and grueling procedures.<\/p>\n\n\n\n<h2><span id=\"Types_of_Assisted_Reproductive_Procedures\">Types of Assisted Reproductive Procedures<\/span><\/h2>\n\n\n\n<p>Several steps and stages often go into assessing a couple for infertility and then deciding what is the best course of action for them.<br><br>The first step toward this is assessing fertility factors for both partners. This can include egg health, ovulation, hormonal levels, uterine conditions, and sperm health. All the focus is on testing the reproductive system of the couple, not their foundations of basic, overall health. Rarely are the lifestyle and general environment the couple reside in checked during fertility assessment.<br><br>From here, the couple is counseled and then given options from which they can consider, based on how minimal their chances to natural conception are.<\/p>\n\n\n\n<h3><span id=\"Intrauterine_insemination_IUI\">Intrauterine insemination (IUI)<\/span><\/h3>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/IUI-1-300x175.jpg\" alt=\"\" class=\"wp-image-21387\" width=\"463\" height=\"269\"\/><\/figure><\/div>\n\n\n\n<p>Non-invasive and less expensive, IUI is the preferred option when either the couple is unable to have sexual intercourse or when the man’s sperm health is poor &#8211; low count or decreased motility.&nbsp; During the process of IUI healthy sperm is directly placed into the uterus, past the cervix, so they can move easily. Women might receive a hormonal boost for the release of eggs to increase the chances of fertilization when the sperm is being transferred.<\/p>\n\n\n\n<h3><span id=\"In_Vitro_Fertilization_IVF\">In Vitro Fertilization (IVF)<\/span><\/h3>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/IUI-300x240.jpg\" alt=\"\" class=\"wp-image-21385\" width=\"431\" height=\"345\"\/><\/figure><\/div>\n\n\n\n<p>In more complex conditions like structural issues in a couple (blocked fallopian tube, endometriosis), very poor semen quality or extended period of unexplained infertility, IVF, the most well-known and frequently discussed method of ART, is chosen. IVF is generally conducted through an elaborate series of processes:<\/p>\n\n\n\n<ul><li><strong>Ovarian stimulation:<\/strong>&nbsp; Clomiphene or Letrozole are initial drugs given to stimulate the ovaries. Following this, other hormones such as follicle-stimulating hormone and luteinizing hormones, primary hormones for ovary stimulation are supplemented. HCG is given for the final push of follicular development and ovulation.<\/li><li><strong>Retrieving the eggs:<\/strong> A day or so after the stimulation of the ovaries, eggs are retrieved from the mature follicles within the ovaries.<\/li><li><strong>Fertilization and transfer of fertilized eggs: <\/strong>Concentrated sperm samples are used to fertilize eggs in vitro, meaning in a test tube or culture dish. Sometimes the sperm is directly injected into the eggs in a procedure called ICSI or Intra Cytoplasmic Sperm Injection.<\/li><li><strong>Culture of the embryos: <\/strong>The fertilized eggs are cultured for a few days under optimum conditions.<\/li><li><strong>Embryo transfer:<\/strong> Based on the age and risk of multiple pregnancies, one or a few embryos that are at a stage of Day 3 or Day 5 of growth are then transferred directly into the uterine cavity.<\/li><\/ul>\n\n\n\n<p>The challenge with IVF is that several IVF cycles might have to be conducted before success is observed. Additionally, each IVF cycle may need to be stopped at different stages. This could be due to minimal eggs produced during stimulation or a lack of optimum conditions with the uterus for implantation of the embryo.<br><br>While detailing out the procedure is relatively simple, the time it takes for one successful cycle can be several months, not to mention the constant pumping of hormones into a woman’s body.<\/p>\n\n\n\n<h3><span id=\"Intracytoplasmic_Sperm_Injection_ICSI\">Intracytoplasmic Sperm Injection (ICSI)<\/span><\/h3>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ICSI-300x150.jpg\" alt=\"\" class=\"wp-image-21388\" width=\"488\" height=\"244\"\/><\/figure><\/div>\n\n\n\n<p>The whole procedure is like IVF. With ICSI only healthy sperm are injected into the eggs. Following this, the cultured embryos are transferred to a uterus that is conditioned to receive these sperm. Sperms that are potentially unhealthy are not used to fertilize the eggs. There are still chances of having defects because procedures such as these are unnaturally fertilizing the eggs, which can damage the egg, sperm, or resulting embryo.<\/p>\n\n\n\n<h3><span id=\"Gamete_Intrafallopian_Transfer_GIFT\">Gamete Intrafallopian Transfer (GIFT)<\/span><\/h3>\n\n\n\n<div class=\"wp-block-image is-style-default\"><figure class=\"aligncenter size-medium is-resized\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/GIFT-295x300.jpeg\" alt=\"\" class=\"wp-image-21389\" width=\"343\" height=\"349\"\/><\/figure><\/div>\n\n\n\n<p>With GIFT, healthy sperm and eggs are directly transferred into the fallopian tube via ultrasound guidance or through laparoscopy. Alternatives to this procedure are transferring a fertilized egg or a zygote (a fertilized egg that has divided).<br><br>Nowadays, this procedure is rarely performed, as it is more invasive than the others.<br><br>Most often couples try a combination of different procedures to beat the probability game.<\/p>\n\n\n\n<h2><span id=\"How_Successful_Are_Assisted_Reproductive_Procedures\">How Successful Are Assisted Reproductive Procedures?<\/span><\/h2>\n\n\n\n<p>No easy answer here! So many factors play into the success of a single IVF cycle. These include the age of the couple, egg quality, sperm quality, uterine environment, lifestyle and hormonal imbalance.<br><br>Studies have shown that success rates of having a live birth with the<a href=\"https:\/\/jamanetwork.com\/journals\/jama\/fullarticle\/2478204\" target=\"_blank\" rel=\"noreferrer noopener\"> first cycle of IVF were about 29.5 %<\/a>. Up until cycle 5, this rate was observed to be above 20%. Approximately 65% of chances at a live birth were observed by cycle six.<\/p>\n\n\n\n<p>This implies six cycles of hormones, sleepless nights, sickness due to hormones, and extended periods of uncertainty. This is the harsh reality of so many cases of artificial attempts at pregnancy, which most media and clinics fail to highlight. By the second or third cycle, most couples are physically and mentally exhausted. Not to mention the financial strain these procedures potentially add. Online forums for women going through ART are full of these painful experiences.<br><br>In procedures such as IUI, often considered before IVF, similar factors such as age, lifestyle, and uterine environment impact success rates considerably. IUI is studied to possess a <a href=\"https:\/\/jamanetwork.com\/journals\/jama\/fullarticle\/2478204\" target=\"_blank\" rel=\"noreferrer noopener\">low delivery rate of about 10%<\/a> among women who are above 30 years of age. But since it is a cheaper option, it is often the first option for many couples seeking to get pregnant.<br><br>Other procedures are only considered after failed IVF cycles.<\/p>\n\n\n\n<h2><span id=\"What_Are_The_Side_Effects_Of_Assisted_Reproductive_Techniques\"><a href=\"https:\/\/www.researchgate.net\/publication\/26530278_Effect_of_anxiety_and_depression_on_ART_outcome\" target=\"_blank\" rel=\"noreferrer noopener\">What Are The Side Effects Of Assisted Reproductive Techniques?<\/a><\/span><\/h2>\n\n\n\n<p>Today IVF is a common coffee table conversation topic. The repercussions that ART leaves are, however, scarcely discussed. While ART offers a ray of hope after tackling years of infertility, procedures such as IVF reduce couples to just their ability to reproduce and do not cater to a lot of their other individual aspects, such as their whole bodies, minds and even understanding their lifestyle.<br><br>There are several adverse effects associated with ART procedures.<\/p>\n\n\n\n<h2><span id=\"Hormonal_imbalance\">Hormonal imbalance<\/span><\/h2>\n\n\n\n<p>A lot of the ART procedures such as IVF, intrauterine insemination, or even intrafallopian tube transfer require a high dose of gonadotropin hormones. These include the FSH, LH, and even the gonadotropin-releasing hormones. These are often given in varying doses after assessing whether the woman might have success in producing viable eggs with each round of hormones.<br><br>These artificial hormones are <a href=\"https:\/\/clinicaltrials.gov\/ct2\/show\/NCT03737253\" target=\"_blank\" rel=\"noreferrer noopener\">recombinant versions of the original hormones<\/a>. Which means they do not work effectively on all women. Some women might not have any success in producing eggs, whereas other women might have hyperstimulation of their ovaries. After going through several cycles of stimulus from external hormones, the body might not be able to produce sufficient hormones by itself, once ART is complete. Which means, a woman has no way of knowing how this is going to impact her health in later years, as balanced hormones are crucial to her everyday living.<\/p>\n\n\n\n<p>With successful pregnancies, there is an increased risk of these assisted pregnancies developing insulin resistance, that could <a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/23814097\/#:~:text=Overall%2C%20ART%20mothers%20had%20a,%25%20CI%201.18%2D1.36).\" target=\"_blank\" rel=\"noreferrer noopener\">result in gestational diabetes<\/a>. The hormonal disbalance also favors a constant state of inflammation which is both harmful to the mother and baby.<\/p>\n\n\n\n<h2><span id=\"Unnatural_hyperstimulation_of_ovaries\">Unnatural hyperstimulation of ovaries<\/span><\/h2>\n\n\n\n<p>The premise of most ART techniques involves stimulating the ovaries to produce more eggs. This means repeatedly pushing the ovaries to function beyond their normal state.<\/p>\n\n\n\n<p>Ovarian hyperstimulation syndrome (OHSS) is a serious consequence of repeatedly pushing the ovaries to produce multiple follicles. About <a href=\"https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S0735675719303298?via%3Dihub\" target=\"_blank\" rel=\"noreferrer noopener\">30% of IVF patients<\/a> may experience some signs of OHSS.<\/p>\n\n\n\n<p>Signs of ovarian hyperstimulation include:<\/p>\n\n\n\n<ul><li>Bloating<\/li><li>Decrease in cellular volume<\/li><li>Decrease in blood concentration (hemoconcentration)<\/li><li>Increased risk of clot formation<\/li><li>Kidney injury<\/li><\/ul>\n\n\n\n<p>With OHSS the ovaries are inflamed and enlarged beyond their normal limits. And in severe cases of OHSS, this can lead to fluid building up in the abdomen (ascites) and even effusions in the lungs, disrupting breathing.<\/p>\n\n\n\n<h2><span id=\"Complications_from_surgical_procedures\">Complications from surgical procedures<\/span><\/h2>\n\n\n\n<p>Right from testing, where colposcopy is conducted, to the repeated insertion of fertilized eggs with each insemination cycle the risk of injury to the uterus, vagina, or the fallopian tubes increases. The most common complications of the surgical procedures conducted with ART include:<\/p>\n\n\n\n<ul><li>Bleeding<\/li><li>Infection<\/li><li>Ovarian torsion (twisting of a bulky ovary)<\/li><li>Nerve Injury<\/li><li>Scarring<\/li><li>Rupture<\/li><li>Nearby organ injuries, such as rupture of bladder or bowels<\/li><\/ul>\n\n\n\n<p>Since this overall risk is small, it is rarely discussed with women before they go in for the procedure. However, it is possible to be at a higher risk of developing complications. This means discussing your risk factors becomes important during the planning stage of any of these procedures.<\/p>\n\n\n\n<h2><span id=\"Risks_to_successful_pregnancies\">Risks to successful pregnancies<\/span><\/h2>\n\n\n\n<p>Even if ART leads to a successful pregnancy, there are several risks that these pregnancies encounter.<\/p>\n\n\n\n<p>To begin with, ART pregnancies are already labeled as high-risk pregnancies. Because of the multiple attempts to a successful pregnancy, the advanced age, possible health factors that contributed to infertility, and lifestyle factors, there is already a lower than usual chance of full-term pregnancy.<\/p>\n\n\n\n<p>Women who have conceived through ART stand at a higher risk of developing gestational diabetes and hypertension during their pregnancies.<\/p>\n\n\n\n<p>Multiple pregnancies, resulting in twins or triplets are also a possibility since more than an egg is usually implanted. These are high-risk pregnancies on their own.<\/p>\n\n\n\n<p>Finally, pregnancies through ART can end with infants having low birth weights, being born prematurely, and with birth defects.<\/p>\n\n\n\n<h2><span id=\"Mental_Health_Implications_of_ART\">Mental Health Implications of ART<\/span><\/h2>\n\n\n\n<p>Through the whole process of assisted reproduction, the couple’s mental health is grossly neglected.<\/p>\n\n\n\n<p>Infertility on its own holds a heavy burden of social stigma. The grueling process of ART from the dejected diagnosis of infertility to the cycles of hormones and insemination, can lead to stress and mental health conditions of depression and anxiety.<\/p>\n\n\n\n<p>Additionally, stress hormones such as cortisol lower the chances of a successful pregnancy. This is because cortisol lowers gonadotropin production as well as estrogen and progesterone production. Cortisol is also linked with increased chances of pregnancy losses.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.researchgate.net\/publication\/26530278_Effect_of_anxiety_and_depression_on_ART_outcome\" target=\"_blank\" rel=\"noreferrer noopener\">Studies have indicated having depression can also lower the rates of success with ART.<\/a><\/p>\n\n\n\n<h3><span id=\"Conclusion\">Conclusion<\/span><\/h3>\n\n\n\n<p>Assisted reproductive technology is a complex approach to tackling infertility. While it does help many couples to achieve their dream of becoming parents, it neglects to showcase the struggles couples go through.<br><br>Additionally, very little is discussed on what the possible adverse effects of any of the assisted reproductive techniques might be. This causes many couples to be in the dark about the journey into ART.<br><br>This is not to say that ART should not be used; what is important that it should be considered the last option, after all else has failed. It should not be the first option considered as soon as an infertility problem is detected.<\/p>\n\n\n\n<h3><span id=\"So_what_are_your_options_for_Conception\">So, what are your options for Conception?<\/span><\/h3>\n\n\n\n<p>Couples need to be educated on possible natural methods to manage infertility. A lot of success has been observed among couples that manage their <a href=\"https:\/\/www.sepalika.com\/fertility\/improve-fertility-diet-meal-plan\/\" target=\"_blank\" rel=\"noreferrer noopener\">diet<\/a>, lifestyle, tackle mental health struggles, and naturally manage medical conditions.<br><br>Many cases of infertility can be resolved by working on the health fundamentals of the couple. This is the groundwork that no IUI\/IVF expert wants to do. Working with a holistic approach that first optimizes vitamin and mineral levels, dietary balance of proteins, fats and carbs, restorative sleep etc. can lead to <a href=\"https:\/\/www.sepalika.com\/fertility\/trying-to-get-pregnant-read-these-9-effective-tips-first\/\" target=\"_blank\" rel=\"noreferrer noopener\">natural conception!<\/a><br><br>Consider all your options before embarking on the journey of ART. Discuss them with your partner and your healthcare professional. Ask your doctor for more conservative, safer methods to try first. Never hesitate to seek a second (or even third) opinion when something doesn’t suit you. <a href=\"https:\/\/www.sepalika.com\/programs\/fertility-program\/\" target=\"_blank\" rel=\"noreferrer noopener\">Speak to a holistic fertility expert<\/a> who will examine your lab reports and past medical history and explain the root-cause of your infertility, rather than simply start pumping you with medicines.<br><br>Ensure that you always put your physical and mental health at a forefront through your fertility journey. We wish you vibrant health and wellbeing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 What Is Assisted Reproductive Technology?2 Types of Assisted Reproductive Procedures2.1 Intrauterine insemination (IUI)2.2 In Vitro Fertilization (IVF)2.3 Intracytoplasmic Sperm Injection (ICSI)2.4 Gamete Intrafallopian Transfer (GIFT)3 How Successful Are Assisted Reproductive Procedures?4 What Are The Side Effects Of Assisted Reproductive Techniques?5 Hormonal imbalance6 Unnatural hyperstimulation of ovaries7 Complications from surgical procedures8 Risks to [&hellip;]<\/p>\n","protected":false},"author":115,"featured_media":21378,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[172],"tags":[309,301,306,308,307],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika<\/title>\n<meta name=\"description\" content=\"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika\" \/>\n<meta property=\"og:description\" content=\"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-03-15T12:30:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-14T11:25:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART-768x768.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"768\" \/>\n\t<meta property=\"og:image:height\" content=\"768\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Michelle Frank\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART.jpg\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART.jpg\",\"width\":7730,\"height\":7730},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/\",\"name\":\"Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#primaryimage\"},\"datePublished\":\"2022-03-15T12:30:00+00:00\",\"dateModified\":\"2022-03-14T11:25:18+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/3f829f4cf6da9c61985bc15604b58c9b\"},\"description\":\"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Side Effects of Assisted Reproductive Technology | Sepalika\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/3f829f4cf6da9c61985bc15604b58c9b\",\"name\":\"Michelle Frank\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/ce40951d8e4450906217078512e4e945?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/ce40951d8e4450906217078512e4e945?s=96&d=mm&r=g\",\"caption\":\"Michelle Frank\"},\"description\":\"Dr. Michelle Frank is an India-based healthcare consultant working towards building safe online communities for women. She helps build digital products enabling women to make informed decisions on their health. She co-hosts #MyHealthChat every alternate Thursday on Twitter.\",\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/michelle-frank\/\"],\"url\":\"https:\/\/www.sepalika.com\/author\/dr-michelle-frank\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika","description":"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/","og_locale":"en_US","og_type":"article","og_title":"Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika","og_description":"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.","og_url":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2022-03-15T12:30:00+00:00","article_modified_time":"2022-03-14T11:25:18+00:00","og_image":[{"width":768,"height":768,"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART-768x768.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Michelle Frank","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART.jpg","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2022\/03\/ART.jpg","width":7730,"height":7730},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#webpage","url":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/","name":"Side Effects of Assisted Reproductive Technology | Sepalika - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#primaryimage"},"datePublished":"2022-03-15T12:30:00+00:00","dateModified":"2022-03-14T11:25:18+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/3f829f4cf6da9c61985bc15604b58c9b"},"description":"Assisted reproductive technology (ART) is used to treat infertility. It includes fertility treatments that handle both eggs and sperm.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/programs\/side-effects-of-assisted-reproductive-technology-sepalika\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Side Effects of Assisted Reproductive Technology | Sepalika"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/3f829f4cf6da9c61985bc15604b58c9b","name":"Michelle Frank","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/ce40951d8e4450906217078512e4e945?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/ce40951d8e4450906217078512e4e945?s=96&d=mm&r=g","caption":"Michelle Frank"},"description":"Dr. Michelle Frank is an India-based healthcare consultant working towards building safe online communities for women. She helps build digital products enabling women to make informed decisions on their health. She co-hosts #MyHealthChat every alternate Thursday on Twitter.","sameAs":["https:\/\/www.linkedin.com\/in\/michelle-frank\/"],"url":"https:\/\/www.sepalika.com\/author\/dr-michelle-frank\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/21375"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/115"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=21375"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/21375\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/21378"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=21375"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=21375"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=21375"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}