{"id":2613,"date":"2016-10-10T11:06:24","date_gmt":"2016-10-10T11:06:24","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=2613"},"modified":"2021-12-13T13:31:31","modified_gmt":"2021-12-13T08:01:31","slug":"supplements-for-breast-cancer","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/","title":{"rendered":"Four Powerful Dietary Supplements For Breast Cancer"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Iodine\"><span class=\"toc_number toc_depth_1\">1<\/span> Iodine<\/a><\/li><li><a href=\"#Curcumin\"><span class=\"toc_number toc_depth_1\">2<\/span> Curcumin<\/a><\/li><li><a href=\"#Shatavari\"><span class=\"toc_number toc_depth_1\">3<\/span> Shatavari<\/a><\/li><li><a href=\"#Vitamin_C\"><span class=\"toc_number toc_depth_1\">4<\/span> Vitamin C<\/a><\/li><li><a href=\"#My_Final_Thoughts\"><span class=\"toc_number toc_depth_1\">5<\/span> My Final Thoughts<\/a><\/li><\/ul><\/div>\n<p>When an old friend from school was diagnosed with <strong>Breast Cancer<\/strong>, she was devastated. A gregarious, well-read 45-plus woman, she nonetheless found herself at sea soon, tossed by the storm of treatment options from which she was told she had to choose quickly.<\/p>\n<p>The C-word is scary to say the least and to prevent things from deteriorating too fast, she surrendered to the conventional treatments – chemotherapy, radiation and the last option, removal of breasts.<\/p>\n<p>Unfortunately for her, it came with the whole array of terrible side effects.  The fatigue, nausea, pain, nerve damage from chemo sessions, the reddening, soreness and irritation that came with radiation. There were post-operative complications of the surgery and it all took a real toll on her.<\/p>\n<p>While none of us is completely shielded from the public debate around testing and treating breast cancer, the whole episode with my friend made me wonder – were there options to the conventional approach? Could there be a gentler way to deal with the dangerous health challenge? Were there groups of people or countries that seemed to do it better? What was the research saying about dietary supplements?<\/p>\n<p>This is most likely not the full list of what’s out there and can help, but here are the most promising dietary supplements for breast cancer that I found. A couple of them fall more in the preventive category. So if you have a family history of breast cancer, then these merit greater attention. The other two are in the treatment genre.<\/p>\n<h2><span id=\"Iodine\">Iodine<\/span><\/h2>\n<p>Japan is one of the highest per capita consumers of <a href=\"http:\/\/www.sepalika.com\/living-well\/iodine-supplements-lost-key-to-great-health\/\">iodine<\/a> in the world (from all the seaweed and seafood they eat) – a whopping 13 mg per day against the FDA recommended upper limit of 150 <em>micrograms<\/em> per day! Japanese women also report one of the lowest breast cancer rates globally.<\/p>\n<p>So where is the connection?<\/p>\n<p>The endocrine glands in our body (the breasts being one of them) need iodine to maintain the integrity of their tissue structure. The cells in the milk ducts of the breasts, where cancer is most likely to develop, have the ability to receive and absorb iodine. When there is a deficiency of iodine in the body, cysts begin to form. <strong>When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what medical experts call “hyperplastic”. This is the precursor to <a href=\"http:\/\/www.sepalika.com\/living-well\/fighting-cancer-food-is-your-most-powerful-weapon\/\">cancer<\/a>.<\/strong><\/p>\n<p>Iodine is also able to prevent cancer cells from multiplying by reducing the ability of estrogen to stick to estrogen receptors located in cancer cells. Iodine is a powerful antioxidant as well. It can prevent and treat fibrocystic disease, which occurs in the breast.<\/p>\n<p>But how did we get iodine deficient in the first place, despite having our store shelves stacked with iodized salt? Well, for starters, many of these salts have far less than the required amount of iodine for optimal health in them. A general worry over high blood pressure has made us drop our salt intake.  According to NHANES data, over the last 40 years, our salt consumption has almost halved. What’s more, fluoride is now regularly added to water sources and in toothpaste. This displaces iodine in our body; so even if we get iodine from our food, it is not used in our body.<\/p>\n<p>So how much Iodine should you take?<\/p>\n<p>Dr.Christiane Northrup, a Board certified OB\/GYN physician and a leading authority on women’s health and wellness, recommends a minimum intake of 12.5mg a day. A convenient form to take it is through Iodoral tablets or seaweed\/kelp supplement capsules.<\/p>\n<p><strong>The traditional form of getting supplemental iodine into the body has been to use Lugol’s solution. 2 drops of Lugol&#8217;s solution (0.1ml) contains 5mg of iodine and 7.5mg of iodide to give a total of 12.5mg of iodine\/iodide.<\/strong><\/p>\n<p>One other option is to use tinctures of iodine that can be safely applied to the breast with the iodine going in through the skin. Be careful, as iodine can sometimes be caustic on the skin.<\/p>\n<p>Iodine supplementation is generally safe. In some people it may cause a skin rash or leave a bad taste in the mouth. It’s always safe to start with a lower dosage and increase it gradually. Also, even though your doctor may not be completely familiar with the use of iodine (it’s the same old problem – cheaper measures are rarely marketed by pharma to doctors) tell them of what you’ve learnt and ask them for advice.<\/p>\n<h2><span id=\"Curcumin\">Curcumin<\/span><\/h2>\n<div id=\"attachment_18650\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp\"><img aria-describedby=\"caption-attachment-18650\" class=\"size-full wp-image-18650\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp\" alt=\"Supplements for Breast Cancer - Curcumin\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18650\" class=\"wp-caption-text\">Supplements for Breast Cancer &#8211; Curcumin<\/p><\/div>\n<p>Naturopathic doctors will tell you how extensive the research literature is, on the effectiveness of curcumin for supporting patients with breast cancer. <strong>It’s fascinating how curcumin, the active component of the turmeric root can launch a multi-pronged attack on cancer<\/strong>. Curcumin fights the disease by:<\/p>\n<ul>\n<li>Decreasing <a href=\"http:\/\/www.sepalika.com\/living-well\/reducing-inflammation\/\">Inflammation<\/a><\/li>\n<li>Preventing the growth of cancer cells by keeping blood supply away from tumors<\/li>\n<li>Inhibiting protein synthesis that otherwise allows cancer to grow and<\/li>\n<li>Arresting the spread of mutated cancer cells from going beyond the initial site.<\/li>\n<\/ul>\n<p>When women have undergone surgery for breast cancer, curcumin helps the patient recover faster. It’s a natural painkiller and combats inflammation and swelling that arise post an operation. It’s antioxidative property helps wounds heal faster.<\/p>\n<p>Do note that for curcumin to be effective on cancer you will need very high doses of this supplement. So pick one where the bioavailability of the extract is high.  While many practitioners recommend between 400-600 mg per day, some say you can go up to 3g of curcumin in a day, had three to four times day. Doses this high is not easily absorbed in the body, so some people use a couple of egg yolks and a teaspoon of coconut oil to make an emulsion or paste with the turmeric powder. A patented form of the curcumin, called Curamed, is said to be able to deliver the turmeric deep into the cells because it uses essential oils of turmeric as the medium.<\/p>\n<p><strong><u>Important note<\/u>:<\/strong> If you are on blood thinners or are pregnant or breast-feeding, curcumin should be avoided. For all of these reasons and because it seems to be needed at higher doses to help with cancer, it would be a good idea to involve a naturopathic practitioner or your own doctor before starting on this supplement program.<\/p>\n<h2><span id=\"Shatavari\">Shatavari<\/span><\/h2>\n<p>In India, the herb Shatavari (the word literally means “she who possesses a 100 husbands”) has been used for centuries to rejuvenate the female reproductive system. While the name may hint at something one might use as an aphrodisiac, it actually does a hundred other things. Ayurvedic texts say it cleans and nourishes the blood, especially in the woman’s reproductive organs. The reason shatavari is used in breast cancer is because it contains hormones known phytoestrogens, which help stabilize the levels of estrogen in women and lower cancer risk.<\/p>\n<p><strong>Studies show shatavari to have powerful inhibitory effects in breast cancer. The root of this plant is packed with flavonoids, glycosides and saponins – all of which are anti-cancer compounds.<\/strong> What makes shatavari so potent in cancer is not just its ability to kill cancer cells but also prevent the tumor from spreading to other parts of the body. What’s more, shatavari is also a strong antioxidant. It can scavenge rogue free radicals in the body and shore up the immune system – both critical needs for cancer patients.<\/p>\n<p>Ayurvedic literature prescribes 2-6g of shatavari powder to be mixed in warm water, ghee  or milk. As a capsule, a dosage of 3-10g a day is recommended.<\/p>\n<p>Please note that while there is extensive use of Shatavari in traditional Ayurveda, there are no human studies proving that it actually reduces breast cancer. There is, however, clear evidence of the anti-cancer properties of the herb when it is exposed to cancer cells in the lab. There is no evidence to show any adverse drug interaction for shatavari. However, patients with a kidney or heart disorder should avoid using this herb.<\/p>\n<h2><span id=\"Vitamin_C\">Vitamin C<\/span><\/h2>\n<div id=\"attachment_18651\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Article-Image-2nd-image.webp\"><img aria-describedby=\"caption-attachment-18651\" class=\"size-full wp-image-18651\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Article-Image-2nd-image.webp\" alt=\"Supplements for Breast Cancer - Vitamin C\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18651\" class=\"wp-caption-text\">Supplements for Breast Cancer &#8211; Vitamin C<\/p><\/div>\n<p>In this list, where I have looked at traditional societies and what they have used to prevent \/ deal with cancer, one ingredient, well known to the west, stands head and shoulders above the rest –<a href=\"http:\/\/www.sepalika.com\/living-well\/do-multivitamins-actually-work\/\">Vitamin C<\/a>.<\/p>\n<p>There have been literally hundreds of research studies that have documented the role of vitamin C in tackling cancer. And that is no surprise. Vitamin C is a known antioxidant, a proven immuunomodulator, is critical for collagen syntheses, is integral to metabolism and without it the endocrine and neurological systems can’t function well.<\/p>\n<p>All this means that when cancer hits, vitamin C can destroy the free radicals that would have otherwise worsened the cancer. It shores up immunity, which takes a big beating in cancer patients. It is able to neutralize carcinogens that build up in the body when this disease hits. Vitamin C is also an anti-inflammatory; for people with cancer, inflammation in the body is the last thing they want.<\/p>\n<p>Vitamin C is also used for patients on chemotherapy and radiation. It significantly lowers the adverse side effects of these treatments including nausea, fatigue and emotional disturbances.<\/p>\n<p>Here’s one little know fact about Vitamin C; at the molecular level, it resembles sugar, which cancer cells love (that’s why several naturopathic anti-cancer diets eliminate sugar). So when we make high doses of Vitamin C available inside the body, the cancer cells hungrily reach out and pull in the C, to feed themselves. But they have a nasty Trojan horse surprise waiting. <strong>When cancer cells consume Vitamin C, they end up creating a by-product called hydrogen peroxide, extremely toxic to all cells. Normal cells also create this hydrogen peroxide when exposed to Vitamin C, but the healthy cells have a way to neutralize it and render it harmless. That is why Vitamin C is deadly to cancer cells and harmless to normal cells.<\/strong><\/p>\n<p>Since the 1970s, high doses of Vitamin C have been studied as a treatment option in cancer patients. Nobel prize winning chemist, Linus Pauling, and a Scottish surgeon, Ewan Cameron, spearheaded this work. High doses of Vitamin C necessitates that the vitamin is given intravenously in cancer patients as then larger amounts of it are able to reach the blood stream. In the United States, there are several clinics that administer this treatment, including the folks who have made a name for themselves through this modality, the Riordan clinic in Kansas.<\/p>\n<p>When taken orally, Vitamin C is recommended at levels of 2-20g a day. That is certainly high. But it is only at these levels the vitamin begins to act against cancer cells. Ideally, this supplement should be had with meals, divided across the day.<\/p>\n<p><strong><span style=\"text-decoration: underline;\">Important Note<\/span>:<\/strong> Of all the things listed in this article, Vitamin C is probably the most harmless, since it has been extensively researched for safety and is water-soluble. Too much of it and you will simply pass it out. However, high oral doses of vitamin C can give you a runny tummy. So you need to start low and check for bowel tolerance, as you begin increasing the dosage. Vitamin C at high levels can also cause inflammation, as it begins to act. So if you are someone for whom even a little inflammation can be detrimental, then you must do this under expert supervision. Some people with poor quality stomach acid may also find that high doses could cause acidity symptoms.<\/p>\n<p>Vitamin C is also not recommended for people who have a tendency to develop kidney stones or suffer from hemochromatosis (a condition where the body absorbs more iron than it should).<\/p>\n<p>Most important: If you have already been diagnosed with breast cancer and are seeking to use Vitamin C, the intravenous treatment may be a lifesaver for you. This MUST be done at a qualified clinic, with the right medical supervision.<\/p>\n<h2><span id=\"My_Final_Thoughts\">My Final Thoughts<\/span><\/h2>\n<p>When breast cancer hits, it begins to ravage the body and exhausts, both physically and more so, mentally. Today, more and more doctors and health care providers who have seen conventional options like chemotherapy up close, question if the disastrous side effects they leave is really necessary or worthwhile.<\/p>\n<p>It’s time we worked with our doctors to find better options, to unearth traditional and other therapies that are backed by research. Dietary supplements, especially when they are organic, high quality and derived from plants and foods, must not be ignored as a far gentler route back to vibrant health.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today, more and more doctors and health care providers who have seen conventional options like chemotherapy up close, question if the disastrous side effects they leave is really necessary or worthwhile.<\/p>\n","protected":false},"author":6,"featured_media":18650,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[62],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari<\/title>\n<meta name=\"description\" content=\"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari\" \/>\n<meta property=\"og:description\" content=\"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sharda.agarwal.944\" \/>\n<meta property=\"article:published_time\" content=\"2016-10-10T11:06:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-13T08:01:31+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@ShardaAgarwal\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sharda Agarwal\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp\",\"width\":779,\"height\":309,\"caption\":\"supplements for breast cancer\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/\",\"name\":\"Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#primaryimage\"},\"datePublished\":\"2016-10-10T11:06:24+00:00\",\"dateModified\":\"2021-12-13T08:01:31+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c\"},\"description\":\"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Four Powerful Dietary Supplements For Breast Cancer\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c\",\"name\":\"Sharda Agarwal\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g\",\"caption\":\"Sharda Agarwal\"},\"description\":\"Sharda Agarwal is a qualified Functional Nutrition Therapy Practitioner &amp; a Certified Blood Chemistry Analyst. She first used dietary supplements to overcome a debilitating migraine she suffered for years. Since then she has studied the subjects of nutrition and nutrients extensively. She uses this to manage the health of her family at home and with Sepalika.\",\"sameAs\":[\"https:\/\/www.sepalika.com\",\"https:\/\/www.facebook.com\/sharda.agarwal.944\",\"https:\/\/twitter.com\/ShardaAgarwal\"],\"url\":\"https:\/\/www.sepalika.com\/author\/sharda-agarwal\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari","description":"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/","og_locale":"en_US","og_type":"article","og_title":"Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari","og_description":"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what","og_url":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/sharda.agarwal.944","article_published_time":"2016-10-10T11:06:24+00:00","article_modified_time":"2021-12-13T08:01:31+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp","twitter_creator":"@ShardaAgarwal","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Sharda Agarwal","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Inflammation-article-2_Header-image-22.webp","width":779,"height":309,"caption":"supplements for breast cancer"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#webpage","url":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/","name":"Supplements For Breast Cancer - Iodine | Vitamin C | Shatavari","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#primaryimage"},"datePublished":"2016-10-10T11:06:24+00:00","dateModified":"2021-12-13T08:01:31+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c"},"description":"Supplements For Breast Cancer: When the body is deprived of iodine over a long period of time, these cysts in the breast harden and become what","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/supplements-for-breast-cancer\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Four Powerful Dietary Supplements For Breast Cancer"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c","name":"Sharda Agarwal","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g","caption":"Sharda Agarwal"},"description":"Sharda Agarwal is a qualified Functional Nutrition Therapy Practitioner &amp; a Certified Blood Chemistry Analyst. She first used dietary supplements to overcome a debilitating migraine she suffered for years. Since then she has studied the subjects of nutrition and nutrients extensively. She uses this to manage the health of her family at home and with Sepalika.","sameAs":["https:\/\/www.sepalika.com","https:\/\/www.facebook.com\/sharda.agarwal.944","https:\/\/twitter.com\/ShardaAgarwal"],"url":"https:\/\/www.sepalika.com\/author\/sharda-agarwal\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2613"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=2613"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2613\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18650"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=2613"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=2613"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=2613"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}