{"id":2687,"date":"2016-10-21T08:19:35","date_gmt":"2016-10-21T15:19:35","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=2687"},"modified":"2021-12-13T14:08:48","modified_gmt":"2021-12-13T08:38:48","slug":"foods-that-fight-cancer","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/","title":{"rendered":"Foods That Fight Cancer &#8211; Your Most Powerful Weapon!"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#A_Quick_Look_Into_What_Were_Putting_Into_Our_Bodies\"><span class=\"toc_number toc_depth_1\">1<\/span> A Quick Look Into What We’re Putting Into Our Bodies<\/a><\/li><li><a href=\"#The_Cancer-Diet_Relationship_And_Why_Not_Enough_People_Are_Talking_About_It\"><span class=\"toc_number toc_depth_1\">2<\/span> The Cancer-Diet Relationship (And Why Not Enough People Are Talking About It)<\/a><ul><li><a href=\"#Education\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Education<\/a><\/li><li><a href=\"#Mind_Sets\"><span class=\"toc_number toc_depth_2\">2.2<\/span> Mind Sets<\/a><\/li><\/ul><\/li><li><a href=\"#Foods_to_Keep_Away_to_Keep_Cancer_At_Bay\"><span class=\"toc_number toc_depth_1\">3<\/span> Foods to Keep Away, to Keep Cancer At Bay<\/a><ul><li><a href=\"#Genetically_Modified_Foods\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Genetically Modified Foods<\/a><\/li><li><a href=\"#Microwave_Popcorn\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Microwave Popcorn<\/a><\/li><li><a href=\"#Canned_Goods\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Canned Goods<\/a><\/li><li><a href=\"#Grilled_Red_Meat\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Grilled Red Meat<\/a><\/li><li><a href=\"#Refined_Sugar\"><span class=\"toc_number toc_depth_2\">3.5<\/span> Refined Sugar<\/a><\/li><li><a href=\"#Sodas_Of_course_You_Know_This_Was_Coming\"><span class=\"toc_number toc_depth_2\">3.6<\/span> Sodas (Of course You Know This Was Coming!)<\/a><\/li><li><a href=\"#Pickled_Salted_And_Smoked_foods\"><span class=\"toc_number toc_depth_2\">3.7<\/span> Pickled Salted And Smoked foods<\/a><\/li><li><a href=\"#Farmed_Fish\"><span class=\"toc_number toc_depth_2\">3.8<\/span> Farmed Fish<\/a><\/li><\/ul><\/li><li><a href=\"#Foods_That_FightCancer_Are_Your_Friends\"><span class=\"toc_number toc_depth_1\">4<\/span> Foods That Fight Cancer Are Your Friends!<\/a><ul><li><a href=\"#Green_Tea\"><span class=\"toc_number toc_depth_2\">4.1<\/span> Green Tea<\/a><\/li><li><a href=\"#Pomegranate_Juice\"><span class=\"toc_number toc_depth_2\">4.2<\/span> Pomegranate Juice<\/a><\/li><li><a href=\"#Fresh_Ginger\"><span class=\"toc_number toc_depth_2\">4.3<\/span> Fresh Ginger<\/a><\/li><li><a href=\"#Turmeric\"><span class=\"toc_number toc_depth_2\">4.4<\/span> Turmeric<\/a><\/li><li><a href=\"#Cruciferous_vegetables\"><span class=\"toc_number toc_depth_2\">4.5<\/span> Cruciferous vegetables<\/a><\/li><li><a href=\"#The_Allium_Family\"><span class=\"toc_number toc_depth_2\">4.6<\/span> The Allium Family<\/a><\/li><li><a href=\"#Fatty_Fish\"><span class=\"toc_number toc_depth_2\">4.7<\/span> Fatty Fish<\/a><\/li><li><a href=\"#Citrus_Fruits\"><span class=\"toc_number toc_depth_2\">4.8<\/span> Citrus Fruits<\/a><\/li><li><a href=\"#Berries\"><span class=\"toc_number toc_depth_2\">4.9<\/span> Berries<\/a><\/li><li><a href=\"#Dark_Chocolate\"><span class=\"toc_number toc_depth_2\">4.10<\/span> Dark Chocolate<\/a><\/li><\/ul><\/li><li><a href=\"#The_Budwig_Diet_Protocol\"><span class=\"toc_number toc_depth_1\">5<\/span> The Budwig Diet Protocol<\/a><\/li><li><a href=\"#What_is_the_Budwig_Protocol\"><span class=\"toc_number toc_depth_1\">6<\/span> What is the Budwig Protocol?<\/a><\/li><\/ul><\/div>\n<p><em>Here’s a fact:<\/em> According to The World Cancer Research Fund, an estimated 20% of all cancers diagnosed in the US are linked to a lack of physical activity, excessive alcohol consumption and poor nutrition. What this also means is that 20% of all cancers diagnosed in the US are preventable. When the numbers are as stark as 39% of the population being diagnosed with cancer at some point of their lives, 20% is a sizable amount! And if one key factor precipitating cancer is poor nutrition, identifying and assimilating foods that fight cancer merits huge learning.<\/p>\n<h2><span id=\"A_Quick_Look_Into_What_Were_Putting_Into_Our_Bodies\">A Quick Look Into What We’re Putting Into Our Bodies<\/span><\/h2>\n<p>Before we get into the detailed specifics of how <a href=\"http:\/\/www.sepalika.com\/living-well\/four-powerful-dietary-supplements-for-breast-cancer\/\">cancer <\/a>and diet are related, I’d like you to consider the evolution of our diet in general. Our bodies are complex biological machines that run purely on converting food substances into fuel to sustain a healthy life. The process is simple – food is broken down, nutrients are absorbed and the waste is thrown out, taking toxins out along with it.<\/p>\n<p>In the olden days, this “food” consisted of organic fruits, vegetables, seeds, nuts and fresh meat. All natural things, all good things. Today, however, the very definition of food has changed. Technological advancements have helped replace organic food, with mass produced, cheaper, easily accessible processed food. The problem? Processed food is junk food. It’s not natural and it’s not healthy. In the process of making food cheaper and more long lasting, nutrition is the last thing on anyone’s mind, in this multi-billion-dollar industry. It is, in fact, replaced by chemical additives, preservatives synthetic vitamins and minerals.<\/p>\n<p>Food companies will claim of course, armed with their FDA approvals, that there’s nothing unhealthy about their foods. They don’t make you sick (immediately), lab rats seemed to do fine, and the (synthetic) supplements are good for you. Don’t believe them. With our unhealthy lifestyles and toxic surroundings, there’s enough unwanted harm being done to our bodies anyway, without us adding to it with a poor diet. So, as Jack Lalane says, “If man made it, don’t eat it!”<\/p>\n<h2><span id=\"The_Cancer-Diet_Relationship_And_Why_Not_Enough_People_Are_Talking_About_It\">The Cancer-Diet Relationship (And Why Not Enough People Are Talking About It)<\/span><\/h2>\n<p>Dr.<a href=\"https:\/\/en.wikipedia.org\/wiki\/David_Servan-Schreiber\"> David Servan-Schreibe <\/a>was a physician and neuroscientist who was diagnosed with brain cancer at the age of 31. Through is 20 year-long battle with cancer, he dedicated his life to the research of how diet and cancer are linked. He met with researchers from across the world, scoured through medical databases, and dove into scientific publications. Through his research, he filtered down to two main reasons for diet not being a more prevalent form of prevention or cure for cancer.<\/p>\n<h3><span id=\"Education\">Education<\/span><\/h3>\n<p>Every medical professional who studies cancer, studies it at medical school. <strong>Nutrition is not taught at medical schools. So, professionals are trained to think in terms of drugs and not diet, when it comes to prescribing a course of action.<\/strong><\/p>\n<h3><span id=\"Mind_Sets\">Mind Sets<\/span><\/h3>\n<p>Doctors believe that patients don’t want to change – diets, lifestyles, anything. A fellow physician once told him, “People don&#8217;t want to change. They just want to take a pill and forget about it.&#8221;<\/p>\n<p>Through his research, he discovered a long list of cancer-fighting foods that have the power to do 3 things:<\/p>\n<ul>\n<li>Reduce i<a href=\"http:\/\/www.sepalika.com\/living-well\/fight-off-chronic-inflammation-naturally\/\">nflammation<\/a>, that fuels the growth of cancers.<\/li>\n<li>Force cancer cells to die through a process called ‘apoptosis’.<\/li>\n<li>Detoxify cancer-causing toxins or protecting against free radicals.<\/li>\n<\/ul>\n<p>What he also realized is that<strong> the anti-cancer diet is the polar opposite of the quintessential American diet!<\/strong> It essentially consists of mostly colorful vegetables and legumes, garlic, spices, herbs and unsaturated fats (olive, canola, or flaxseed oils). Meat and eggs are optional.<\/p>\n<h2><span id=\"Foods_to_Keep_Away_to_Keep_Cancer_At_Bay\">Foods to Keep Away, to Keep Cancer At Bay<\/span><\/h2>\n<div id=\"attachment_18660\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Red-Meat-and-RA.webp\"><img aria-describedby=\"caption-attachment-18660\" class=\"size-full wp-image-18660\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/Red-Meat-and-RA.webp\" alt=\"Foods That Fight Cancer- Red meat\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-18660\" class=\"wp-caption-text\">Foods That Fight Cancer- Red meat<\/p><\/div>\n<p>Before we get into what TO DO, here’s a quick list on what NOT TO DO (or eat), no matter how easy, convenient or attractive they may seem:<\/p>\n<h3><span id=\"Genetically_Modified_Foods\">Genetically Modified Foods<\/span><\/h3>\n<p>With this new wave of GMOs hitting the markets, researchers worry that no one, including the manufacturers, is aware of the long-term effects of consuming GMO products. So, the next time you’re in the market, look for either GMO-free foods or of course, the more trusted route is always – go organic.<\/p>\n<h3><span id=\"Microwave_Popcorn\">Microwave Popcorn<\/span><\/h3>\n<p>Everything from the chemical-lined bags, to the possibly GMO corn kernels to the fumes released by the artificial butter flavorings, is toxic to our bodies. It’s time to go back to the old-school ways of making popcorn – it’s safe, it’s healthy and it’s just as delicious.<\/p>\n<h3><span id=\"Canned_Goods\">Canned Goods<\/span><\/h3>\n<p>Most cans are lined with a product called BPA, which has proved to be severely harmful. It’s always safer to stick to either fresh or frozen foods to make sure that you and your family are eating well and healthy.<\/p>\n<h3><span id=\"Grilled_Red_Meat\">Grilled Red Meat<\/span><\/h3>\n<p>This will come as a disappointment to barbeque lovers across the country, but cooking red meat in this way, to the point of well done, changes the molecular composition of the food and releases a carcinogen called heterocyclic aromatic amines. The healthier alternative – try baking, broiling or using a skillet instead of a grill.<\/p>\n<h3><span id=\"Refined_Sugar\">Refined Sugar<\/span><\/h3>\n<p>This in one of the most dangerous cancer-causing foods by far. Refined sugar and the foods made with them are a major source of insulin spikes, which feed the growth of cancer cells. Since a majority of the sugar supply in the U.S. is made using genetically modified (GMO) sugar beets, a healthier option is organic honey, coconut sugar, or maple sugar.<\/p>\n<h3><span id=\"Sodas_Of_course_You_Know_This_Was_Coming\">Sodas (Of course You Know This Was Coming!)<\/span><\/h3>\n<p>Let’s break down the composition of sodas – cancer causing high fructose corn syrup, dyes, chemicals and absolutely no nutrition. These are severely harmful to the human body, and more so when they are prefixed with the word ‘diet’.<\/p>\n<h3><span id=\"Pickled_Salted_And_Smoked_foods\">Pickled Salted And Smoked foods<\/span><\/h3>\n<p>Most of these foods are loaded with preservatives, such as nitrates, to help increase their shelf life. Additives such as these, can accumulate in your system over long periods of time and prove toxic at a cellular level, leading to diseases like cancer.<\/p>\n<h3><span id=\"Farmed_Fish\">Farmed Fish<\/span><\/h3>\n<p>It’s not just sardines that are packed tight anymore! Fish Farming, particularly salmon, involves packing an enormous number of fish into small, crowded environments. Here, the fish are treated with pesticides, antibiotics and a host of other chemicals that prevent the outbreak of disease, but in turn prove carcinogenic to humans, on consumption.<\/p>\n<h2><span id=\"Foods_That_FightCancer_Are_Your_Friends\">Foods That Fight Cancer Are Your Friends!<\/span><\/h2>\n<div id=\"attachment_18661\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/oct-17-copy-2nd-image.webp\"><img aria-describedby=\"caption-attachment-18661\" class=\"size-full wp-image-18661\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/oct-17-copy-2nd-image.webp\" alt=\"Foods that fight cancer - Green Tea, Pomegranate juice, dark chocolate, turmeric, ginger etc\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18661\" class=\"wp-caption-text\">Foods that fight cancer &#8211; Green Tea, Pomegranate juice, dark chocolate, turmeric, ginger etc<\/p><\/div>\n<p>There are several foods and drinks that have proved to be pivotal in both, the prevention and cure of cancer. Take a look at  this cancer fighting foods list.<\/p>\n<h3><span id=\"Green_Tea\">Green Tea<\/span><\/h3>\n<p>Loaded with antioxidants, green tea also possesses one secret weapon against cancer – EGCG. With its triple threat effect, EGCG kills cancer cells, stops them from growing and prevents the formation and growth of new blood vessels in tumors.<\/p>\n<h3><span id=\"Pomegranate_Juice\">Pomegranate Juice<\/span><\/h3>\n<p>With its antioxidant and anti-inflammatory properties, pomegranate juice is known for its ability to substantially reduce the development of even the most aggressive cancers, especially prostate cancer.<\/p>\n<h3><span id=\"Fresh_Ginger\">Fresh Ginger<\/span><\/h3>\n<p>Apart from being rich in anti-inflammatory agents that help combat certain cancers and deter the growth of tumors, <a href=\"http:\/\/www.sepalika.com\/acid-reflux\/functional-dyspepsia-treating-with-ginger-and-artichoke\/\">ginger<\/a> also help alleviate the nausea caused by cancer treatments like chemotherapy or radiotherapy.<\/p>\n<h3><span id=\"Turmeric\">Turmeric<\/span><\/h3>\n<p>One of the most powerful anti-inflammatory foods, <a href=\"http:\/\/www.sepalika.com\/immunity\/health-benefits-of-turmeric-and-curcumin\/\">turmeric<\/a> contains curcumin – cancer’s worst enemy, your best friend. Curcumin has been proven to kill cancer cells, shrink tumors and prevent several forms of cancer from developing altogether.<\/p>\n<h3><span id=\"Cruciferous_vegetables\">Cruciferous vegetables<\/span><\/h3>\n<p>Vegetables like cauliflower, broccoli, bok choy, Brussels sprouts and Chinese cabbage contain sulforaphane and I3Cs, two powerful anticancer molecules that have been proven to help detoxify the body of certain carcinogenic substances, prevent precancerous cells from developing into malignant tumors as well as kill cells and block tumor growth. This potent action makes cruciferous veggies an integral part of the cancer fighting foods list.<\/p>\n<h3><span id=\"The_Allium_Family\">The Allium Family<\/span><\/h3>\n<p>This food group, comprising of garlic, onions, leeks, shallots and chives, contains sulphur compounds that promote the death of several cancers including colon, lung, breast and prostate.<\/p>\n<h3><span id=\"Fatty_Fish\">Fatty Fish<\/span><\/h3>\n<p>Here’s another reason to love fatty fish! The anti-inflammatory long-chain omega 3 compound, found in these fish, has proved to help not only reduce the risk of cancer altogether, but also slow down the cell growth in a large number of tumors.<\/p>\n<h3><span id=\"Citrus_Fruits\">Citrus Fruits<\/span><\/h3>\n<p>Fruits like oranges, tangerines, lemons and grapefruits are rich in anti-inflammatory compounds called flavonoids. These cause the liver to detoxify carcinogens and in some cases, also help promote the death of brain cancer cells.<\/p>\n<h3><span id=\"Berries\">Berries<\/span><\/h3>\n<p>Apart from being juicily delicious, strawberries, raspberries, blueberries, blackberries, and cranberries contain ellagic acid and polyphenols, both of which inhibit tumor growth and promote cancer cell death.<\/p>\n<h3><span id=\"Dark_Chocolate\">Dark Chocolate<\/span><\/h3>\n<p>We saved the best for last! Wonder how indulgent dark chocolate made it to the list of foods that fight cancer? The cocoa in rich dark chocolate is filled with elixirs like antioxidants, proanthocyanidins, and many polyphenols. These molecules help reduce the growth of cancer cells and limit the blood vessels that feed them.<\/p>\n<h2><span id=\"The_Budwig_Diet_Protocol\">The Budwig Diet Protocol<\/span><\/h2>\n<p><strong> <\/strong>Did you know that when we consume bad fats, the oils cause congestion and inflammation in our cells and form a coating over our cell membranes? This reduces circulation, causes cellular toxicity and reduces the fluidity of cell our membranes. That is not good.<\/p>\n<p>To prevent this, Dr. Johanna Budwig, the German Government’s Senior Expert on lipids and pharmacology, developed the Budwig Protocol in 1952. <strong>This substitutes unhealthy fats with healthy saturated fats, probiotics, sulphur containing foods, good fibers and omega 3 fatty acids.<\/strong><\/p>\n<p>Each of these elements helps rejuvenate your cells. They help cleanse and detoxify our system and rejuvenate our energy. Doctors who abide by the Budwig Protocol have seen incredible improvements in their patients – their bowel functions, digestive health and overall boosts to their immune system.<\/p>\n<p>Through her research, Dr. Budwig discovered that this is not just an effective treatment for cancer, but this diet helps people with diabetes, arthritis, hormonal imbalances, heart ailments, psoriasis, eczema, and neurological conditions.<\/p>\n<h2><span id=\"What_is_the_Budwig_Protocol\">What is the Budwig Protocol?<\/span><\/h2>\n<p>Here’s the simple yet incredibly effective recipe:<\/p>\n<ul>\n<li>6oz of Cultured Dairy (cottage cheese, goat’s milk kefir or amasai)<\/li>\n<li>4 Tbsp of sprouted and ground Chia or Flax<\/li>\n<li>1 Tbsp Flaxseed Oil<\/li>\n<li>1 tsp turmeric powder*<\/li>\n<li>1\/4 tsp black pepper*<\/li>\n<\/ul>\n<p>Mix all the ingredients together in bowl or blender and consume once daily. Consuming this meal once a day can help rebuild your cell membranes and is also a fabulous cleanse for the colon.  It is loaded with probiotics and fermentable fiber that can transform the health of your small intestine and colon.<\/p>\n<p>*Please note that turmeric and black pepper were not a part of the original recipe. They have been added by Dr. John Axe in what he calls the ‘Beyond Budwig Protocol’. He adds the turmeric for the incredible anti-inflammatory properties of curcumin and the black pepper helps increase the turmeric absorption in the body.<\/p>\n<p>Couple these diet tips, with exercise, sleep and a good dose of sunlight (for Vitamin D) and you’ll notice the changes in your body yourself. Don’t take our word for it. Give it a shot!<\/p>\n<p>As always, don’t forget to consult your doctor before adopting a new diet or making a change in your lifestyle.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 A Quick Look Into What We’re Putting Into Our Bodies2 The Cancer-Diet Relationship (And Why Not Enough People Are Talking About It)2.1 Education2.2 Mind Sets3 Foods to Keep Away, to Keep Cancer At Bay3.1 Genetically Modified Foods3.2 Microwave Popcorn3.3 Canned Goods3.4 Grilled Red Meat3.5 Refined Sugar3.6 Sodas (Of course You Know This [&hellip;]<\/p>\n","protected":false},"author":38,"featured_media":18662,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol<\/title>\n<meta name=\"description\" content=\"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol\" \/>\n<meta property=\"og:description\" content=\"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-10-21T15:19:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-13T08:38:48+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Kanika Raj\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp\",\"width\":350,\"height\":350,\"caption\":\"Foods That Fight Cancer\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/\",\"name\":\"Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#primaryimage\"},\"datePublished\":\"2016-10-21T15:19:35+00:00\",\"dateModified\":\"2021-12-13T08:38:48+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/97aab06a6b3aa359967555346da44990\"},\"description\":\"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Foods That Fight Cancer &#8211; Your Most Powerful Weapon!\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/97aab06a6b3aa359967555346da44990\",\"name\":\"Kanika Raj\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Kanika Raj\"},\"description\":\"Kanika is a writer who is amazed by the wonders of dietary supplements. She is now on the journey to heal her family and herself through nutrition\",\"url\":\"https:\/\/www.sepalika.com\/author\/kanika-1\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol","description":"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/","og_locale":"en_US","og_type":"article","og_title":"Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol","og_description":"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention","og_url":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2016-10-21T15:19:35+00:00","article_modified_time":"2021-12-13T08:38:48+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Kanika Raj","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/10\/admin-ajax-14.webp","width":350,"height":350,"caption":"Foods That Fight Cancer"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#webpage","url":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/","name":"Foods That Fight Cancer: Anti-Cancer Food List | Budwig Diet Protocol","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#primaryimage"},"datePublished":"2016-10-21T15:19:35+00:00","dateModified":"2021-12-13T08:38:48+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/97aab06a6b3aa359967555346da44990"},"description":"Foods That Fight Cancer: Cancer’s enemies are your friends! There are several foods and drinks that have proved to be pivotal in both, the prevention","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/foods-that-fight-cancer\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/foods-that-fight-cancer\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Foods That Fight Cancer &#8211; Your Most Powerful Weapon!"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/97aab06a6b3aa359967555346da44990","name":"Kanika Raj","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Kanika Raj"},"description":"Kanika is a writer who is amazed by the wonders of dietary supplements. She is now on the journey to heal her family and herself through nutrition","url":"https:\/\/www.sepalika.com\/author\/kanika-1\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2687"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/38"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=2687"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2687\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18662"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=2687"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=2687"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=2687"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}