{"id":3777,"date":"2017-01-12T09:34:14","date_gmt":"2017-01-12T09:34:14","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=3777"},"modified":"2021-12-31T13:40:19","modified_gmt":"2021-12-31T08:10:19","slug":"diabetes-in-teens","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/","title":{"rendered":"Diabetes In Teens: Symptoms, Causes and Treatment"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Learning_to_Manage_Glucose_Levels_at_School\"><span class=\"toc_number toc_depth_1\">1<\/span> Learning to Manage Glucose Levels at School<\/a><\/li><li><a href=\"#5_Tips_for_Teenagers_to_Keep_Blood_Glucose_Levels_In_Check\"><span class=\"toc_number toc_depth_1\">2<\/span> 5 Tips for Teenagers to Keep Blood Glucose Levels In Check<\/a><\/li><li><a href=\"#Charting_Out_the_Right_Insulin_or_Medication_Regime\"><span class=\"toc_number toc_depth_1\">3<\/span> Charting Out the Right Insulin or Medication Regime<\/a><ul><li><a href=\"#Option_1_Twice_Daily_Injections\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Option 1: Twice Daily Injections<\/a><\/li><li><a href=\"#Option_2_Multiple_Injections_Therapy\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Option 2: Multiple Injections Therapy<\/a><\/li><li><a href=\"#Option_3_Insulin_Pump_Therapy\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Option 3: Insulin Pump Therapy<\/a><\/li><\/ul><\/li><li><a href=\"#Type_2_Diabetes_in_Teens_8211_Learning_Diabetes_Control\"><span class=\"toc_number toc_depth_1\">4<\/span> Type 2 Diabetes in Teens &#8211; Learning Diabetes Control<\/a><\/li><li><a href=\"#Dealing_With_Body_Issues_and_Privacy_Violations\"><span class=\"toc_number toc_depth_1\">5<\/span> Dealing With Body Issues and Privacy Violations<\/a><\/li><li><a href=\"#Diabetic_Teenagers_and_Partying\"><span class=\"toc_number toc_depth_1\">6<\/span> Diabetic Teenagers and Partying<\/a><\/li><li><a href=\"#Dealing_With_Your_Emotions\"><span class=\"toc_number toc_depth_1\">7<\/span> Dealing With Your Emotions<\/a><\/li><\/ul><\/div>\n<p><strong>Do teenagers get diabetes<\/strong>? You bet, they do. Diabetes is a great leveler and doesn&#8217;t distinguish between who its affecting. Bad genes, bad eating habits, sedentary lifestyle &#8211; all of these contribute to the onset of diabetes, even in teens and kids.<\/p>\n<p>It’s rough being a teenager, as you go through a multitude of changes and transitions that can feel overwhelming all by themselves. Add to that a diagnosis of <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/symptoms-of-diabetes-type-2\/\">Type 2 Diabetes and life<\/a> can become downright challenging. Type 2 diabetes in teens is becoming commonplace these days. What’s worse, the disease can progress a lot more aggressively in teens than adults.<\/p>\n<p>For teens with diabetes, controlling blood sugar levels with changing bodies, lifestyles, routines and responsibilities can be more challenging. While grappling with the demands of high school or college, the responsibility of holding onto their first job, and the possibility of an active social life, the additional task of taking care of diabetes seems like an extra burden. However, it’s crucial for teenagers to understand that living a healthy lifestyle as a diabetic goes a long way to prevent alarming heart and kidney diseases at a young age.<\/p>\n<h2 id=\"Learning_to_Manage_Glucose_Levels_at_School\"><span id=\"Learning_to_Manage_Glucose_Levels_at_School\">Learning to Manage Glucose Levels at School<\/span><\/h2>\n<p>Uncontrolled blood sugar levels mean having to deal with complications like eye damage, kidney damage, nerve damage, and skin problems later on in life. However, to a teenager, relating to these long-term benefits of managing blood sugar levels can be difficult. Result – a fairly low motivation to deal with diabetes.<\/p>\n<p>However, let us assure you, there are plenty of short-term benefits of teenagers with diabetes learning to manage their glucose levels every day. Like – better focus and mental acuity at school, more energy and hence improved performance at sports, healthier body, and being a more confident and pleasant person to be around. Try to think of these as the most compelling, immediate reasons to keep your blood sugar levels within range.<\/p>\n<h2 id=\"5_Tips_for_Teenagers_to_Keep_Blood_Glucose_Levels_In_Check\"><span id=\"5_Tips_for_Teenagers_to_Keep_Blood_Glucose_Levels_In_Check\">5 Tips for Teenagers to Keep Blood Glucose Levels In Check<\/span><\/h2>\n<p>Keeping your sugar levels within normal range is the first step towards living a happier life with diabetes.<\/p>\n<div id=\"attachment_18927\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/group-of-friends-with-a-big-smile_1098-2872.webp\"><img aria-describedby=\"caption-attachment-18927\" class=\"size-full wp-image-18927\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/group-of-friends-with-a-big-smile_1098-2872.webp\" alt=\"Tips for teens to manage their blood glucose level \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18927\" class=\"wp-caption-text\">Tips for teens to manage their blood glucose level<\/p><\/div>\n<ol>\n<li>It’s important to have access to your blood glucose testing kit at all times. Use a glucose monitor that you can easily carry to school and use anytime, anywhere.<\/li>\n<li>Make sure you keep a close eye on your blood sugar levels. Create a routine that works for you, based on your school schedule.<\/li>\n<li>The more often you do the test, the more information you’ll have about your blood glucose levels. This will allow you to correct things when you have veered off course. Also, check your sugar levels when you feel fatigued or are having trouble concentrating in class. These are signs that your sugar levels may be too high or too low.<\/li>\n<li>We’re sure you already know that your blood sugar levels should be in a safe range – between 4 mmol\/L (or 72mg\/dL) and 9 mmol\/L (or 163mg\/dL). If your sugar levels drops below 4 mmol\/l, eat some carbohydrate to manage hypoglycemia. Additionally, being aware of the early signs of hypoglycemia, like sweating, fatigue and feeling dizzy, will allow you to treat your low blood glucose levels quickly and bring them back into the normal range.<\/li>\n<li>In case your blood sugar levels are routinely over 10 mmol\/L or 180mg\/dL, you need to discuss your medication dosage with your doctor or healthcare team. To keep blood glucose levels under check, you may need to take insulin.<\/li>\n<\/ol>\n<h2 id=\"Charting_Out_the_Right_Insulin_or_Medication_Regime\"><span id=\"Charting_Out_the_Right_Insulin_or_Medication_Regime\">Charting Out the Right Insulin or Medication Regime<\/span><\/h2>\n<p>Although this article is focussed on <strong>teenage diabetes<\/strong> type 2, teens with Type 1 Diabetes, have it a lot tougher, since they need to inject themselves with insulin before every meal. Following the right insulin regime makes life at school much easier and so, we&#8217;re going to cover the main points here to help youngsters cope with <strong>teenage diabetes symptoms<\/strong>.<\/p>\n<h3><span id=\"Option_1_Twice_Daily_Injections\">Option 1: Twice Daily Injections<\/span><\/h3>\n<p>You can opt for twice-daily injections, so that you don’t have to give yourself insulin shots while at school. However, this leaves little to no room for flexibility when it comes to carbohydrate intake. If you have a strict eating routine and a diabetes-friendly diet, this may be the right choice for you. A word of warning though – blood glucose levels may run high particularly in the afternoon, post meal. Make sure you test blood glucose levels a couple hours after lunch.<\/p>\n<h3><span id=\"Option_2_Multiple_Injections_Therapy\">Option 2: Multiple Injections Therapy<\/span><\/h3>\n<p>If you desire a more flexible insulin regime that also allows you to eat whenever you want, the multiple injections therapy offers tighter diabetes control with lesser restrictions. The downsides? For one, you will have to learn to take insulin shots at school. Secondly, you will be more susceptible to hypoglycemia, and must always carry a carbohydrate-rich snack in your bag. You will also require more frequent testing, especially if you maintain erratic meal times when at school.<\/p>\n<h3><span id=\"Option_3_Insulin_Pump_Therapy\">Option 3: Insulin Pump Therapy<\/span><\/h3>\n<p>Like multiple injection therapy, the insulin pump therapy allows for tighter diabetes control, without the hassle of giving yourself multiple injections every day. You can practice a more flexible eating and exercising routine. Some teenagers can feel self-conscious about wearing the pump, but this is usually the best, most flexible method for teen diabetics to keep their blood sugar level under control.<\/p>\n<p>If you are a teen with Type 2 Diabetes, try to maintain a regular meal-time routine while at school so that you can take your medication on time. This ensures your blood sugar levels stay within the safe limit throughout the day.<\/p>\n<h2 id=\"Type_2_diabetes_in_teens_8211_Learning_Diabetes_Control\"><span id=\"Type_2_Diabetes_in_Teens_8211_Learning_Diabetes_Control\">Type 2 Diabetes in Teens &#8211; Learning Diabetes Control<\/span><\/h2>\n<p>For many a teenager living with diabetes, the desire to push your medical condition under the carpet can seem irresistible. Who likes the idea of diabetes control taking over our lives, after all? But the truth is, the better you get at managing your diabetes, the lesser time you need to spend looking after your blood sugar levels.<\/p>\n<ul>\n<li><strong>Get the basics right<\/strong>. Test your blood glucose levels in the morning and before bedtime, and also test before and after every meal. Do spend a few minutes every week looking at these test numbers, so you can figure out where to make the necessary changes to control your diabetes without having to test too often in the long term.<\/li>\n<li><strong>Get into a routine<\/strong>, as this may be crucial to get those stubborn sugar levels under control. If you get different test results every single day, it can become very difficult to chart your progress at <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/can-you-reverse-type-2-diabetes\/\">diabetes management<\/a>. Be aware – a lot of different things affect your sugar levels through the course of the day, like your meal timings, injections, exercise levels etc.<\/li>\n<li><strong>Try to have meals at the same time of day<\/strong> wherever possible and don’t miss out on meals. Figure out which foods are best and worst for your blood sugars, and eat more of the good stuff. Dietary supplements are an excellent aid to <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/14-amazing-herbs-that-lower-blood-sugar\/\">control blood sugar levels<\/a>.<\/li>\n<li><strong>Stay active<\/strong>. Find an activity you like, even if this may change from time to time. Join school\/college sports teams to stay physically active. Cycle to school, swim, or organize walk groups over the weekend to make physical fitness super easy for yourself.<\/li>\n<li><strong>Lack of sleep affects your blood sugar levels<\/strong>. You will notice more variable blood sugars and need more insulin after a poor night’s sleep. A healthy bedtime routine makes a world of difference to your blood sugars, energy levels and mood.<\/li>\n<\/ul>\n<h2 id=\"Dealing_with_Body_Issues_and_Privacy_Violations\"><span id=\"Dealing_With_Body_Issues_and_Privacy_Violations\">Dealing With Body Issues and Privacy Violations<\/span><\/h2>\n<p>Teenagers are very sensitive about how they look, and how their peers perceive them. For <strong>teens living with diabetes<\/strong>, telling others about their medical condition and the complications that arise from it can often be daunting. It can often be hard to tell new friends or a potential date, “<em><a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-heart-disease\/\">I am diabetic<\/a>. I have dietary restrictions<\/em>”. However, the truth is that taking ownership of diabetes will build confidence in your ability to manage diabetes and become self-sufficient as you grow into an adult. Take your time. As you learn to live with diabetes, you will soon become comfortable with the idea of testing your blood sugar levels on a date, or between a tennis match with a friend.<\/p>\n<p>The occasional bruise is part of living with diabetes and is likely you have hit a vein when injecting. And while bruises never look pretty, you will learn to avoid them as you get better with diabetes management. Tip: Try to avoid injecting in the same place too often to avoid lumpy skin.<\/p>\n<p>The other undesirable side-effect of diabetes is weight gain. Recent controlled studies suggest that young women with type 2 diabetes have 2.4 times more risk of developing an eating disorder than age-matched women without diabetes. If you are concerned about your weight gain or suffer from poor body image, it’s important to speak to your doctor or a dietician to help formulate a healthy diet plan to manage your weight. In fact, managing your weight can help you make huge gains on your diabetes too.<\/p>\n<h2 id=\"Diabetic_Teenagers_and_Partying\"><span id=\"Diabetic_Teenagers_and_Partying\">Diabetic Teenagers and Partying<\/span><\/h2>\n<p>Can you continue going out to party with your friends? In short – Yes. The question is – how to achieve this? Debunk some <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/common-diabetic-diet-myths-busted\/\">diabetic diet myths<\/a> and learn to make healthier choices all the time!<\/p>\n<p>As a diabetic teenager, you don’t have to forgo eating out, or partying. Simply be more careful of <em>what you eat<\/em>, <em>when you eat<\/em> and <em>how much you eat<\/em>. Snack on some diabetic-friendly foods and keep away from refined carbohydrates such as pastry and dough-based foods as these hit blood sugar levels quickly and can leave you feeling hungry soon after eating them. Healthy proteins and carbs with a low glycemic index are ideal.<\/p>\n<p>When it comes to drinking, make sure you test your blood sugar levels regularly, particularly if it&#8217;s an active night. Alcohol can limit the liver’s capability to release glucose into the blood stream and result in <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-hypoglycemia-causes-symptoms\/\">hypoglycaemia<\/a>. Sodas, juices and other such beverages also need to be consumed with care. Take your background insulin on time and eat a carbohydrate snack before bedtime.<\/p>\n<h2 id=\"Dealing_with_your_Emotions\"><span id=\"Dealing_With_Your_Emotions\">Dealing With Your Emotions<\/span><\/h2>\n<p>The psychological impact of diabetes on adolescents can be damaging. As can be imagined, it’s crucial for teenagers with diabetes to learn how to deal with emotions and get the necessary support from teachers, parents, medical professionals and friends.<\/p>\n<p>If you have recently been diagnosed, everyone around you may be worried about the physical effects of living with diabetes. However, emotional issues are a part and parcel of a teenage diabetes diagnosis, and directly affect the physical aspects.<\/p>\n<p>Give yourself time and an adjusting period to get used to things like blood sugar testing, medication, diet changes, insulin injections and changes in physical activities. Over time, shots and checks can become like brushing teeth or taking a shower — just another part of the daily routine.<\/p>\n<p>Don’t bottle up your feelings of anger, resentment, shame, anxiety and embarrassment. Instead, talk to your family members or a counselor about how you feel. Feeling like you don’t fit in, never getting a break from your rigorous diabetes routine, worries about what the future may hold for you, and difficulty maintaining control can all lead to depression over time. Seek the help you need right away.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>For teens with diabetes, controlling blood sugar levels with changing bodies, lifestyles, routines and responsibilities can be more challenging. While grappling with the demands of high school or college, the responsibility of holding onto their first job, and the possibility of an active social life, the additional task of taking care of diabetes seems like an extra burden.<\/p>\n","protected":false},"author":24,"featured_media":18929,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[116,112],"tags":[119],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diabetes In Teens - Symptoms Type 2, Causes and Treatment<\/title>\n<meta name=\"description\" content=\"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Diabetes In Teens - Symptoms Type 2, Causes and Treatment\" \/>\n<meta property=\"og:description\" content=\"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-01-12T09:34:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-31T08:10:19+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp\",\"width\":400,\"height\":193,\"caption\":\"diabetes in teens\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/\",\"name\":\"Diabetes In Teens - Symptoms Type 2, Causes and Treatment\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#primaryimage\"},\"datePublished\":\"2017-01-12T09:34:14+00:00\",\"dateModified\":\"2021-12-31T08:10:19+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Diabetes In Teens: Symptoms, Causes and Treatment\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diabetes In Teens - Symptoms Type 2, Causes and Treatment","description":"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/","og_locale":"en_US","og_type":"article","og_title":"Diabetes In Teens - Symptoms Type 2, Causes and Treatment","og_description":"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.","og_url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-01-12T09:34:14+00:00","article_modified_time":"2021-12-31T08:10:19+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/01\/admin-ajax-1.webp","width":400,"height":193,"caption":"diabetes in teens"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#webpage","url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/","name":"Diabetes In Teens - Symptoms Type 2, Causes and Treatment","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#primaryimage"},"datePublished":"2017-01-12T09:34:14+00:00","dateModified":"2021-12-31T08:10:19+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Diabetes in teens: The growing number of teens diagnosed with Type 2 Diabetes is alarming; and the disease can progress a lot faster in teens.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-in-teens\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Diabetes In Teens: Symptoms, Causes and Treatment"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/3777"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=3777"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/3777\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18929"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=3777"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=3777"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=3777"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}