{"id":8418,"date":"2017-04-05T20:00:34","date_gmt":"2017-04-06T03:00:34","guid":{"rendered":"http:\/\/sepalika.wpengine.com\/?p=8418"},"modified":"2022-01-06T10:53:58","modified_gmt":"2022-01-06T05:23:58","slug":"ways-to-deal-with-depression","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/mental-health\/ways-to-deal-with-depression\/","title":{"rendered":"4 Surprisingly Easy Scientific Ways To Deal With Depression"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#How_to_Deal_with_Depression_The_Right_Approach_Begins_with_the_Right_Questions\"><span class=\"toc_number toc_depth_1\">1<\/span> How to Deal with Depression: The Right Approach Begins with the Right Questions<\/a><\/li><li><a href=\"#Dealing_with_Depression_Tip_1_8211_A_Balanced_Diet_Rich_in_High_Quality_Fats\"><span class=\"toc_number toc_depth_1\">2<\/span> Dealing with Depression: Tip 1 &#8211; A Balanced Diet, Rich in High Quality Fats<\/a><ul><li><a href=\"#Low_Omega_3_Levels_and_Depression_The_Relationship\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Low Omega 3 Levels and Depression: The Relationship<\/a><\/li><li><a href=\"#How_good_fats_enhance_mental_calm\"><span class=\"toc_number toc_depth_2\">2.2<\/span> How good fats enhance mental calm<\/a><\/li><li><a href=\"#Getting_Fat_Soluble_Vitamins_Into_Your_Body\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Getting Fat Soluble Vitamins Into Your Body<\/a><\/li><\/ul><\/li><li><a href=\"#Dealing_with_Depression_Tip_2_Examine_Thyroid_Function_Carefully\"><span class=\"toc_number toc_depth_1\">3<\/span> Dealing with Depression: Tip 2 – Examine Thyroid Function Carefully<\/a><\/li><li><a href=\"#Dealing_with_Depression_Tip_3_Test_and_Supplement_Vitamin_B_Family\"><span class=\"toc_number toc_depth_1\">4<\/span> Dealing with Depression: Tip 3 –Test and Supplement Vitamin B Family<\/a><\/li><li><a href=\"#Dealing_with_Depression_Tip_4_8211_Yoga_and_Meditation\"><span class=\"toc_number toc_depth_1\">5<\/span> Dealing with Depression: Tip 4 &#8211; Yoga and Meditation<\/a><\/li><li><a href=\"#Dealing_with_Depression_The_Final_Score\"><span class=\"toc_number toc_depth_1\">6<\/span> Dealing with Depression: The Final Score<\/a><\/li><\/ul><\/div>\n<h2><span id=\"How_to_Deal_with_Depression_The_Right_Approach_Begins_with_the_Right_Questions\">How to Deal with Depression: The Right Approach Begins with the Right Questions<\/span><\/h2>\n<p>One of the biggest problems with depression is that it takes away the motivation needed to seek help. In my practice, it is usually a life partner or family member who gets someone to me, to seek help. Once they’re there, however, both people are surprised at my line of questioning to help them deal with depression.<\/p>\n<p>What do you eat? Have you been tested for hypothyroidism? When was the last time you had your vitamin levels tested? Do you move around enough?<\/p>\n<p>They’re surprised because they’ve come to expect a prescription pad to be whipped out for chemical meds or at best, some talk therapy. The conventional approach is often to recommend Cognitive Behavioral Therapy (CBT), antidepressant medication, and in some severe cases, Electroconvulsive Therapy (ECT) Education.<\/p>\n<p>Some prescription medication has it’s place, no doubt, especially in extreme cases. However, as research is increasingly showing, depression is not something that goes away with pills. And all medication comes with side effects. The mind-body axis is quite delicate. Every attempt to suppress a symptom often results in a new one. So the best doctors and therapists today insist on asking the right questions about diet and lifestyle, test for the right lab parameters and then treat all aspects of the person’s mind, body and spirit.<\/p>\n<p>While you can’t condense several textbooks on the subject or a lifetime of experience into just four pieces of advice, these pointers are easy to understand and implement. We’re sharing them because research shows how getting these right can make a huge impact on depression. Sadly, few people, including doctors, seem to aware of them.<\/p>\n<h2><span id=\"Dealing_with_Depression_Tip_1_8211_A_Balanced_Diet_Rich_in_High_Quality_Fats\">Dealing with Depression: Tip 1 &#8211; A Balanced Diet, Rich in High Quality Fats<\/span><\/h2>\n<div id=\"attachment_19069\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Balanced-Diet.webp\"><img aria-describedby=\"caption-attachment-19069\" class=\"size-full wp-image-19069\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Balanced-Diet.webp\" alt=\"A balanced diet helps coping with depression\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19069\" class=\"wp-caption-text\">A balanced diet helps coping with depression<\/p><\/div>\n<p>Believe it or not, fixing your diet is the MOST IMPORTANT step towards<u> <a href=\"https:\/\/www.sepalika.com\/mental-health\/6-strategies-coping-depression\/\">fighting depression<\/a><\/u>. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC2738337\/\">Studies<\/a> have established a link between nutrition and depression. Most of us don’t get enough natural good fat in our diet. In fact, many of us go out of our way to avoid fats, because we believe it may lead to unwanted weight and inch gain. What’s more, we have been told for years that dietary fats, including healthy fats like grass-fed butter and cheese, increase cardiac risk. Time to bust that myth once and for all!<\/p>\n<p>Even the U.S. government has accepted late last year that dietary cholesterol does not pose the villainous cardiac risk that it used to be charged with for decades. The <a href=\"http:\/\/jamanetwork.com\/journals\/jamainternalmedicine\/article-abstract\/2548255\">real culprit is sugar<\/a> and you can thank the processed food industry lobby for shifting the blame to fat.<\/p>\n<h3><span id=\"Low_Omega_3_Levels_and_Depression_The_Relationship\">Low Omega 3 Levels and Depression: The Relationship<\/span><\/h3>\n<p>Patients with depression have been <a href=\"http:\/\/www.europeanneuropsychopharmacology.com\/article\/S0924-977X(03)00032-4\/abstract\">extensively reported<\/a> to be have abnormalities of omega-3 polyunsaturated fatty acids (PUFAs), including significantly low EPA and DHA at the cellular level. Scientists <a href=\"https:\/\/link.springer.com\/article\/10.1007\/BF02637069\">investigating<\/a> relationships between severity of depression and low omega 3 levels found that giving Omega 3 supplements led to marked improvements in depression.<\/p>\n<h3><span id=\"How_good_fats_enhance_mental_calm\">How good fats enhance mental calm<\/span><\/h3>\n<p>We all need to<a href=\"https:\/\/www.sepalika.com\/living-well\/healthy-fats-why-everyone-must-eat-them\/\"> good fats<\/a> in our diet. The essential fatty acids arachidonic acid, EPA and DHA are also crucial for the body in small amounts. Several vitamins, like Vitamins A, D, E, and K are only fat-soluble. So if you don’t have healthy fats in your diet, you don’t store these vitamins well enough in your body.<\/p>\n<p>According to the <a href=\"https:\/\/www.westonaprice.org\/health-topics\/mental-emotional-health\/the-pursuit-of-happiness\/\">Weston Price<\/a> approach, pioneered by Dr.Weston Price, M.D, arachidonic acid in fat cooperates with vitamins A, D and K to promote mental health. It does so by regulating the adrenal hormone cortisol and the neurotransmitter dopamine. It achieves all these by supporting the ‘feel-good’ chemicals in our bodies, called endocannabinoids or natural mood regulators. Functional doctors practicing this Weston Price approach of the healthy fat diet have had very good results in dealing with depression.<\/p>\n<h3><span id=\"Getting_Fat_Soluble_Vitamins_Into_Your_Body\">Getting Fat Soluble Vitamins Into Your Body<\/span><\/h3>\n<p>Arachidonic acid is a omega-6 fatty acid found primarily in eggs and liver and in smaller amounts in all other animal fats including butterfat. Humans can also synthesize small amounts of arachidonic acid from omega-6 linoleic acid, found in both plant oils and animal fats. However, Vitamin A, also found in animal fats, is crucial for this conversion.<\/p>\n<p>Vitamin D also directly interacts with Vitamin A to maintain levels of calcium in the blood. Calcium is a central regulator of arachidonic acid metabolism in virtually every type of cell. This makes Vitamin D essential for proper handling of this nutrient. All of these are therefore crucial to generate the right levels of endocannabinoids, the body’s natural, ‘feel-good’ chemicals.<\/p>\n<p>While your body can make Vitamin D when exposed to sunlight, you can also get it by adding fatty fish and cod liver oil to your diet. Finally, Vitamin K, which is also called the Weston Price Factor, holds all of these factors together in the right ratios to each other, to produce great physical and mental health.<\/p>\n<p>So when you get nutrient-dense animal fats in your daily diet, you are getting in Vitamin A, arachidonic acid, Omega 3 fatty acids, Vitamin D and Vitamin K. Together, they not only help prevent and mitigate depression and anxiety, but also improve focus, mood and concentration.<\/p>\n<h2><span id=\"Dealing_with_Depression_Tip_2_Examine_Thyroid_Function_Carefully\">Dealing with Depression: Tip 2 – Examine Thyroid Function Carefully<\/span><\/h2>\n<div id=\"attachment_19070\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Thyroid.webp\"><img aria-describedby=\"caption-attachment-19070\" class=\"size-full wp-image-19070\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Thyroid.webp\" alt=\"how to overcome deep depression- Depression is one of the symptom of thyroid\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19070\" class=\"wp-caption-text\">how to overcome deep depression- Depression is one of the symptom of thyroid<\/p><\/div>\n<p>I once had a patient come in to see me. She was in her late 30s and complained of depression. She also had a symptom that most doctors she had seen had written off as a hallucination – a burning sensation in her private parts that simply would not abate. She had been prescribed the most serious pain killers, anti-depressants and sleep medication and even these were not really helping. After speaking to her in detail, I requested her to get certain additional thyroid lab tests done.<\/p>\n<p>The little thyroid gland, sitting just at the base of your throat, is the commander of hundreds of functions in the human body. So if you look through the very<a href=\"https:\/\/www.sepalika.com\/hypothyroidism\/hypothyroidism-symptoms-list\/\"> long list of hypothyroid symptoms,<\/a> you will find depression there.<\/p>\n<p>In my practice, it is one of the first hormones I check when someone comes in depressed. And I will not test the Total T3, Total T4 or TSH, but ask for the Free T3 and Free T4 levels. When I look at the levels of these hormones in the blood, I find that several times, a patient complaining of depression is actually a victim of an underactive thyroid.<\/p>\n<p>This was indeed the case with the young lady who came to see me. Well meaning doctors, measuring the wrong hormones or assuming that everything was ok from just the lab-suggested ‘normal values’ of thyroid, had missed this. I sent her back to a different endocrinologist to get thyroid support and suggested dietary supplements to enhance thyroid function. She reported to me within fifteen days that her burning disappeared. By the end of the month, the depression largely cleared up too.<\/p>\n<p>The sad fact is that hypothyroidism and clinical depression share so many symptoms that doctors may overlook the possibility that someone who is depressed may also have low thyroid levels. <a href=\"http:\/\/ajp.psychiatryonline.org\/doi\/pdf\/10.1176\/ajp.150.3.508\">Studies<\/a> have shown that the risk of depression is 56% higher in patients with subclinical hypothyroidism. ‘Subclinical hypothyroidism’ simply means that the thyroid hormone levels are not low enough for the lab to mark it in red in their report. New research shows that a lot of damage can be done before this threshold is breached.<\/p>\n<p><a href=\"http:\/\/jamanetwork.com\/journals\/jama\/article-abstract\/375004\">Research<\/a> also suggests that a significant proportion of patients with depression may have early hypothyroidism, the cases of about half of which are detected only by thyrotropin-releasing hormone (TRH) testing. <a href=\"http:\/\/europepmc.org\/abstract\/med\/18828343\">Studies<\/a> have also investigated the prevalence of hypothyroidism and importance of cholesterol estimation in patients suffering from major depressive disorder.<\/p>\n<p>If you have hypothyroidism as well as depression, things may improve with <a href=\"https:\/\/www.sepalika.com\/hypothyroidism\/hypothyroidism-top-dietary-supplements-to-support\/\">dietary supplements that support thyroid function<\/a> and with natural dessicated thyroid hormone, rather than relying only on anti-depressants. As thyroid function improves, depression often eases. Take this information to your doctor.<\/p>\n<h2><span id=\"Dealing_with_Depression_Tip_3_Test_and_Supplement_Vitamin_B_Family\">Dealing with Depression: Tip 3 –Test and Supplement Vitamin B Family<\/span><\/h2>\n<div id=\"attachment_19072\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Vitamin-B.webp\"><img aria-describedby=\"caption-attachment-19072\" class=\"size-full wp-image-19072\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Vitamin-B.webp\" alt=\"how to deal with depression and anxiety- Low levels of Vitamin B may be linked to depression\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19072\" class=\"wp-caption-text\">how to deal with depression and anxiety- Low levels of Vitamin B may be linked to depression<\/p><\/div>\n<p>Vitamin B12 and other B vitamins play a role in producing brain chemicals that affect mood and other functions. Low levels of B12 and other B vitamins such as vitamin B6 and folate may be linked to depression. That is why B Vitamins lead our list of <a href=\"https:\/\/www.sepalika.com\/mental-health\/can-dietary-supplements-help-with-depression\/\">dietary supplements<\/a> to help deal with depression.<\/p>\n<p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/2005338\/\">Studies<\/a> reveal that the most common nutritional deficiencies seen in patients with mental disorders are of omega–3 fatty acids, B vitamins, minerals, and amino acids that are precursors to neurotransmitters. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC2738337\/\">Clinical trials<\/a> have indicated that Vitamin B12 delays the onset of signs of dementia while also enhancing cerebral and cognitive functions in the elderly.<\/p>\n<p>Low levels of a vitamin can result from eating a poor diet or not being able to absorb the vitamins you consume. People who eat a vegetarian diet or are vegan are more susceptible to Vitamin B12 deficiency. It’s easy to get tested for B12 levels. Since it is a water-soluble vitamin, the risks of vitaminosis or getting excess of the vitamin with supplementation are also minimal with the Vitamin B family.<\/p>\n<p>The best way to make sure you&#8217;re getting enough B12 and other vitamins is to eat a healthy diet that includes the sources of essential nutrients. Vitamin B12 is plentiful in animal products such as fish, lean meat, poultry, eggs, and grass fed dairy products like milk and cheese. Fortified breakfast cereals also are a good source of B12 and other B vitamins.<\/p>\n<p>If you prefer to get your B vitamins from a dietary supplement, do prefer the sub-lingual versions, that are placed under the tongue and directly absorbed, rather than those that are swallowed.<\/p>\n<h2><span id=\"Dealing_with_Depression_Tip_4_8211_Yoga_and_Meditation\">Dealing with Depression: Tip 4 &#8211; Yoga and Meditation<\/span><\/h2>\n<div id=\"attachment_19073\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Yoga-image.webp\"><img aria-describedby=\"caption-attachment-19073\" class=\"size-full wp-image-19073\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/04\/Yoga-image.webp\" alt=\"Yoga decreases stress, anxiety and improves mood.\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19073\" class=\"wp-caption-text\">Yoga decreases stress, anxiety and improves mood.<\/p><\/div>\n<p>It’s not just about chanting ‘Om’ and feeling good in a placebo-effect way. <a href=\"https:\/\/www.hindawi.com\/journals\/ecam\/2007\/798782\/abs\/\">Science<\/a> supports the complementary effects of yoga and meditation in the fight against depression. <a href=\"http:\/\/online.liebertpub.com\/doi\/abs\/10.1089\/acm.2005.11.711\">Yogic breathing<\/a> is documented as a legitimate and often very effective treatment of stress, anxiety, and depression. Several television and film celebrities in the West, often prone to depression in the face of fame, swear by the power of Transcendal Meditation. There have been <a href=\"http:\/\/www.tm.org\/benefits-depression-adult\">several studies<\/a> about its effects on<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3951026\/\"> reducing stress <\/a>and depression.<\/p>\n<p>Practicing yoga improves both your physical and mental health. Apart from better core strength and flexibility, the greatest gains are in decreased stress, anxiety and improved mood with the regular practice of yoga.<\/p>\n<p>A <a href=\"http:\/\/online.liebertpub.com\/doi\/10.1089\/acm.2016.0140\">study<\/a> conducted at Boston University School of Medicine found that practicing Iyengar yoga several times a week provided significant relief from the signs and symptoms of depression. Dr. Chris Streeter, study author and Associate Professor of Psychiatry and Neurology at Boston University School of Medicine, believes that yoga has the advantage of avoiding side effects from drug treatments. &#8220;While most pharmacologic treatment for depression target monoamine systems, such as serotonin, dopamine and norepinephrine, this intervention targets the parasympathetic and gamma aminobutyric acid system and provides a new avenue for treatment.&#8221;<\/p>\n<p>Emerging research explains yoga’s ability to combat depression through balancing brain chemistry and stress hormone levels. While regular exercise too has been found to be helpful in producing endorphins and reducing stress, these work thorugh the sympathetic or ‘fight or flight’ arm of the nervous system. Yoga and meditation help tame the stress response by:<\/p>\n<ul>\n<li>priming the parasympathetic nervous system<\/li>\n<li>reducing heart rate<\/li>\n<li>lowering blood pressure and<\/li>\n<li>producing a state of calm.<\/li>\n<\/ul>\n<h2><span id=\"Dealing_with_Depression_The_Final_Score\">Dealing with Depression: The Final Score<\/span><\/h2>\n<p>No two people are alike and so, there is no guarantee that doing just these 4 things is going to rid you of depression overnight. There are times when I use a combination of several other alternative therapies like acupressure and Faster EFT to help ceratin patients. However, these 4 basic things are easy to incorporate into your regimen. And like I said at the outset, they’re simple things, often missed by patients and doctors alike, in a prescription medicine dominated age. So go ahead. Share this information with your therapist or doctor. Also, examine these aspects of your life yourself. There’s always light at the end of the tunnel. Here’s wishing you vibrant good health!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 How to Deal with Depression: The Right Approach Begins with the Right Questions2 Dealing with Depression: Tip 1 &#8211; A Balanced Diet, Rich in High Quality Fats2.1 Low Omega 3 Levels and Depression: The Relationship2.2 How good fats enhance mental calm2.3 Getting Fat Soluble Vitamins Into Your Body3 Dealing with Depression: Tip [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":19074,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[133],"tags":[117],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Deal with Depression - 4 Surprisingly Easy Scientific Ways<\/title>\n<meta name=\"description\" content=\"Let&#039;s explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"4 Surprisingly Easy Scientific Ways To Deal With Depression\" \/>\n<meta property=\"og:description\" content=\"Let&#039;s explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\" \/>\n<meta property=\"article:published_time\" content=\"2017-04-06T03:00:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-06T05:23:58+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Sunlight-for-depression.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mahesh Jayaraman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/\",\"name\":\"How to Deal with Depression - 4 Surprisingly Easy Scientific Ways\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#primaryimage\"},\"datePublished\":\"2017-04-06T03:00:34+00:00\",\"dateModified\":\"2022-01-06T05:23:58+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\"},\"description\":\"Let's explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"4 Surprisingly Easy Scientific Ways To Deal With Depression\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\",\"name\":\"Mahesh Jayaraman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"caption\":\"Mahesh Jayaraman\"},\"description\":\"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.\",\"sameAs\":[\"http:\/\/sepalika.com\",\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Deal with Depression - 4 Surprisingly Easy Scientific Ways","description":"Let's explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/","og_locale":"en_US","og_type":"article","og_title":"4 Surprisingly Easy Scientific Ways To Deal With Depression","og_description":"Let's explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.","og_url":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/profile.php?id=100009879845215","article_published_time":"2017-04-06T03:00:34+00:00","article_modified_time":"2022-01-06T05:23:58+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Sunlight-for-depression.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Mahesh Jayaraman","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#webpage","url":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/","name":"How to Deal with Depression - 4 Surprisingly Easy Scientific Ways","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#primaryimage"},"datePublished":"2017-04-06T03:00:34+00:00","dateModified":"2022-01-06T05:23:58+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4"},"description":"Let's explore How to Deal with Depression by eating right, getting the correct lab tests, taking the best vitamins, and doing a bit of yoga.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/mental-health\/4-surprisingly-easy-scientific-ways-to-deal-with-depression\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"4 Surprisingly Easy Scientific Ways To Deal With Depression"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4","name":"Mahesh Jayaraman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","caption":"Mahesh Jayaraman"},"description":"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.","sameAs":["http:\/\/sepalika.com","https:\/\/www.facebook.com\/profile.php?id=100009879845215","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/8418"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=8418"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/8418\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19074"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=8418"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=8418"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=8418"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}