{"id":10235,"date":"2017-05-11T20:00:25","date_gmt":"2017-05-12T03:00:25","guid":{"rendered":"http:\/\/sepalika.wpengine.com\/?p=10235"},"modified":"2022-01-11T11:43:45","modified_gmt":"2022-01-11T06:13:45","slug":"how-to-reverse-autoimmune-disease","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/","title":{"rendered":"Can Autoimmune Diseases Be Reversed?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Yes_Autoimmune_Diseases_Can_Be_Reversed_and_These_People_have_Proven_It\"><span class=\"toc_number toc_depth_1\">1<\/span> Yes, Autoimmune Diseases Can Be Reversed and These People have Proven It<\/a><\/li><li><a href=\"#Immune_System_A_Protector_That_Sometimes_Goes_Rogue\"><span class=\"toc_number toc_depth_1\">2<\/span> Immune System: A Protector That Sometimes Goes Rogue<\/a><\/li><li><a href=\"#Hold_On_So_What_Causes_Autoimmune_Disorders\"><span class=\"toc_number toc_depth_1\">3<\/span> Hold On: So What Causes Autoimmune Disorders?<\/a><ul><li><a href=\"#Reason_1_A_Leaky_Gut\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Reason 1: A Leaky Gut<\/a><\/li><li><a href=\"#Reason_2_Gluten-Sensitivity\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Reason 2: Gluten-Sensitivity<\/a><\/li><li><a href=\"#Reason_3_Toxins_Viruses_and_Fungi_Entering_the_Body\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Reason 3: Toxins, Viruses and Fungi Entering the Body<\/a><\/li><li><a href=\"#Reason_4_Stress\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Reason 4: Stress<\/a><\/li><\/ul><\/li><li><a href=\"#Conventional_VS_Functional_Medicine_Two_Radically_Different_Approaches_to_Autoimmune_Diseases\"><span class=\"toc_number toc_depth_1\">4<\/span> Conventional V\/S Functional Medicine: Two Radically Different Approaches to Autoimmune Diseases<\/a><\/li><li><a href=\"#So_How_Do_We_Reverse_Autoimmune_Disorders\"><span class=\"toc_number toc_depth_1\">5<\/span> So, How Do We Reverse Autoimmune Disorders?<\/a><\/li><li><a href=\"#Parting_Words\"><span class=\"toc_number toc_depth_1\">6<\/span> Parting Words<\/a><\/li><\/ul><\/div>\n<p>As a trained microbiologist, I am fascinated by autoimmune diseases. That’s because I believe that our ‘microbiome’, the bacteria that live in our bodies, form pretty much the core of our immune system. And I also believe that if we feed the right bacteria the right food and keep them happy, autoimmune diseases can indeed be reversed.<\/p>\n<h2><span id=\"Yes_Autoimmune_Diseases_Can_Be_Reversed_and_These_People_have_Proven_It\">Yes, Autoimmune Diseases Can Be Reversed and These People have Proven It<\/span><\/h2>\n<p>The conventional medical approach believes that autoimmune disorders cannot be reversed; only managed. And yet we find individuals who have successfully reversed their autoimmune diseases. These individuals are shining examples of how holistic living is crucial to lasting health and wellness.<\/p>\n<p><a href=\"http:\/\/www.amymyersmd.com\/\">Dr. Amy Myers<\/a>, for example, is an MD who suffered from Graves’ disease (an autoimmune disease of the thyroid gland). She successfully reversed it using principles of Functional Medicine. <a href=\"http:\/\/www.barbaraallan.com\">Barbara Allan<\/a> is another example of a healthy person being affected by autoimmune arthritis. She successfully reversed it and now shares her insights and learning to help millions suffering from a similar condition. Dana Trentini, also known as the <a href=\"http:\/\/hypothyroidmom.com\/\">“Hypothyroid Mom,”<\/a> reversed her thyroid problems and now shares her knowledge on her blog. These motivated individuals have answered the question that concerns millions of people – “<strong>Is there a cure for autoimmune disease?<\/strong>”, with a resounding “Yes.”<\/p>\n<p>And like them, anyone can reverse their autoimmune disorders. The first step in reversal of any chronic illness is to understand their cause. And in the case of autoimmune diseases, it all starts with the immune system.<\/p>\n<h2><span id=\"Immune_System_A_Protector_That_Sometimes_Goes_Rogue\">Immune System: A Protector That Sometimes Goes Rogue<\/span><\/h2>\n<p>Our immune system is responsible for protecting our body from rogues – both external and internal. The awesome powers of our immune system have fascinated biologists like me for centuries now. A healthy immune system is key to a healthy body. And yet at times, the immune system turns its fearsome powers and abilities to destroy the body it is meant to protect. This gives rise to autoimmune diseases. While some of them are harmless, others are life-threatening.<\/p>\n<p>For starters, the immune system is a complex system, whose complexity rivals that of the nervous system. There are trillions of bacteria that reside within our body, especially in our gut (known as gut microflora or popularly as “probiotics”) that are absolutely essential for a healthy immune system. Autoimmune disease arise from imbalances in this microflora.<\/p>\n<p>We live in a pool of microorganisms; living entities so small, we cannot see them with our naked eyes. From the time we are born, we consume microorganisms. Many of them have made our bodies their home. In fact, we have more microorganisms inside our body than we have our own cells. A majority of them are commensals, meaning they neither harm us nor benefit us. Many of them are mutualistic – both of us benefit from each other’s presence. Some, however, are opportunistic pathogens; they will cause an infection when the tight leash they usually are on is weakened.<\/p>\n<p>Pathogenic microorganisms also enter our body through contaminated food, water and air and may cause infection. Viruses can also cause infections by building colonies inside our own cells. These cells must also be targeted by the immune system, and so should cancerous cells, that are harmful to the body. This is the job of the immune system under normal circumstances. However, in some cases, the immune system turns against the body and results in autoimmune disorders.<\/p>\n<h2><span id=\"Hold_On_So_What_Causes_Autoimmune_Disorders\">Hold On: So What Causes Autoimmune Disorders?<\/span><\/h2>\n<p>Studies have shown with some degree of certainty the various reasons for autoimmunity. Here are some that have found favor among most scientists.<\/p>\n<h3><span id=\"Reason_1_A_Leaky_Gut\">Reason 1: A Leaky Gut<\/span><\/h3>\n<div id=\"attachment_19215\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Leaky-Gut.webp\"><img aria-describedby=\"caption-attachment-19215\" class=\"wp-image-19215 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Leaky-Gut.webp\" alt=\"Can Autoimmune Diseases Be Reversed\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19215\" class=\"wp-caption-text\">Leaky-Gut<\/p><\/div>\n<p>Research done by Dr. Alessio Fasano attributes many autoimmune diseases to impaired intestinal barrier function. In simple words, he says that if you have a “leaky gut” you are very likely to develop an autoimmune disorder. Dr. Fasano’s work also discusses the role of something called zonulin, in maintaining integrity of the tight junctions that hold the gut lining together. Zonulin is a protein that regulates the movement of substances across tight junctions (the place where two cells within the lining join each other) of cells in the wall of the digestive tract. If there is a problem with the zonulin pathway (in genetically-susceptible individuals), such people are at a great risk of developing an autoimmune disease.<\/p>\n<p>When tight junctions get leaky, they allow undigested food particles, microbes and toxins to escape the intestine and get into your bloodstream. All substances that are not meant to be in the blood can be identified as potentially dangerous by your immune system. So, it mounts an immune response against them, leading to widespread inflammation. If you continue to eat and live the same way, the immune system is unable to ever “stand down” from the attack. Finally, tired and irritated, it begins to attack the body itself.<\/p>\n<h3><span id=\"Reason_2_Gluten-Sensitivity\">Reason 2: Gluten-Sensitivity<\/span><\/h3>\n<div id=\"attachment_19217\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Gluten.webp\"><img aria-describedby=\"caption-attachment-19217\" class=\"wp-image-19217 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Gluten.webp\" alt=\"Can Autoimmune Diseases Be Reversed\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19217\" class=\"wp-caption-text\">Gluten-Sensitivity<\/p><\/div>\n<p>Dr. Fasano has also studied the role of gluten in the development of autoimmune disorders. First, gluten causes overproduction of zonulin, that chemical that can lead to leaky gut. Second, in gluten sensitive individuals, gluten is highly inflammatory, and third, the structure of gluten resembles, to a great extent, that of certain body tissues. An immune system that has mounted an attack on gluten is likely to destroy body tissues that resemble gluten as well, triggering an autoimmune response.<\/p>\n<h3><span id=\"Reason_3_Toxins_Viruses_and_Fungi_Entering_the_Body\">Reason 3: Toxins, Viruses and Fungi Entering the Body<\/span><\/h3>\n<div id=\"attachment_19218\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Virus.webp\"><img aria-describedby=\"caption-attachment-19218\" class=\"wp-image-19218 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Virus.webp\" alt=\"Can Autoimmune Diseases Be Reversed\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19218\" class=\"wp-caption-text\">Toxins, Viruses and Fungi Entering the Body<\/p><\/div>\n<p>Another major cause of autoimmune diseases is toxins entering our body through environmental pollution, as well as through use of personal care items. Heavy metals, industrial chemicals and pollutants and pesticides enter our body through contaminated food, water and air. The physical damage caused by these pollutants to our tissues activates the immune system to recognize the damaged tissue as “foreign” and attack it. This leads to a full-fledged autoimmune disease. Many infections like Candida overgrowth, SIBO (small intestinal bacterial overgrowth) and viral infections like herpes simplex, Epstein – Barr, as well as Lyme disease can cause an autoimmune disorder.<\/p>\n<h3><span id=\"Reason_4_Stress\">Reason 4: Stress<\/span><\/h3>\n<div id=\"attachment_19219\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Stress.webp\"><img aria-describedby=\"caption-attachment-19219\" class=\"wp-image-19219 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Stress.webp\" alt=\"Can Autoimmune Diseases Be Reversed\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19219\" class=\"wp-caption-text\">Stress<\/p><\/div>\n<p>Finally, stress is another major contributor to the development of autoimmunity. Our current lifestyles make stress a commonplace occurrence. We are under both psychological as well as physiological stress. Chronic stress is a constant companion in these frantic times. Sleep deprivation, poor diet, emotional stress, workplace stress and so on contribute dramatically to certain physiological changes within the body, giving rise to autoimmune diseases.<\/p>\n<p>Interestingly, because the immune system is spread throughout the body, an autoimmune disease can affect almost any part of the body. The signs and symptoms of an autoimmune disorder would depend upon what part of the body is affected. For example, in case of Rheumatoid Arthritis (RA), you will experience joint pain, stiffness and loss of function. Conditions like vitiligo, scleroderma and systemic lupus erythematosus cause changes to the skin, such as rashes, blisters and changes in skin color.<\/p>\n<p>Another classic feature of an autoimmune disease is inflammation. Under normal conditions, inflammation is a helpful process as it allows the immune system to direct its cells to the site of a possible bacterial entry or colonization. Inflammation always results in some amount of tissue damage; it is the price we have to pay for successful removal of bacterial pathogens from our body. Inflammation results in swelling, redness, pain and heat. However, when stress is chronic, that is, continuous and unrelenting, the inflammation can continue unabated for too long, leading to auto immune diseases.<\/p>\n<h2><span id=\"Conventional_VS_Functional_Medicine_Two_Radically_Different_Approaches_to_Autoimmune_Diseases\">Conventional V\/S Functional Medicine: Two Radically Different Approaches to Autoimmune Diseases<\/span><\/h2>\n<p>In the conventional medical approach, the exact reasons for the immune system turning against its host are unknown. Naturally, since the causes are unknown, the only answer is to suppress the immune system, to manage autoimmune conditions. Steroids are used to suppress the immune system, while pain killers are given to relieve pain. And that is pretty much all they have to say about auto immune diseases.<\/p>\n<p>When a person is under immune-suppression, although their symptoms of autoimmune disease are eased, it also puts them at increased risk of infections that can prove to be life-threatening. That’s because a weakened immune system cannot effectively protect the body from a seemingly innocuous infection. (This scenario is similar to a person with an HIV infection. The HIV compromises immune function and the person usually succumbs to an infection.)<\/p>\n<p>Interestingly, if you analyze all of the reasons for autoimmune diseases mentioned above, you will realize that most of these are fixable. For example, it’s not impossible to fix a leaky gut. And, here’s where a functional medicine approach tries to make sense. The functional medicine approach asks basic questions such as, what is the cause of an imbalance in the body and how does one regain that lost balance? And by trying to answer these questions, it can find solutions to seemingly untreatable chronic conditions. It also leads a better understanding of the harmony and interconnectivity between every unit of the human body.<\/p>\n<p>While conventional medicine treats the symptoms independently, the functional medicine approach creates a map to understand what exactly is causing the inflammation, or which molecules are activating the immune system to act against bodily tissue by mimicking their structure. If the underlying problem is identified, healing the body becomes easier.<\/p>\n<h2><span id=\"So_How_Do_We_Reverse_Autoimmune_Disorders\">So, How Do We Reverse Autoimmune Disorders?<\/span><\/h2>\n<ul>\n<li><strong>Make your gut healthy again.<\/strong> 80% of your immune system resides in your gut. In fact, it actually lies beneath the single cell lining that covers your gut. If there is a break in this lining’s integrity, your immune system will be exposed to food particles, toxins, bacteria and so on. This will overwhelm your immune system, making it attack your own body. Foods to avoid for those with autoimmune disease are those that are naturally inflammatory. These include foods from the Solanaceae family (tomatoes, potato, egg-plant, bell and chili peppers). Eating an anti-inflammatory diet and replenishing good bacteria through probiotic supplements is a good way to heal your gut.<\/li>\n<li><strong>Check for food allergies and sensitivities<\/strong>. As discussed above, gluten sensitivity can be a major factor in activating the immune system to turn against our own body. It is best to check if you have gluten sensitivity or an allergy towards any type of food that might be continually activating the immune system.<\/li>\n<li><strong>Check for and heal infections.<\/strong> Many bacterial and fungal infections can trigger or worsen autoimmune disorders. Figure out if you have a hidden infection, with the help of your physician and get rid of it.<\/li>\n<li><strong>Stay active.<\/strong> Physical activity is anti-inflammatory in nature. You don’t need an intensive exercise regimen; you simply need to keep your body active. Walking in the park, playing ball or racquet games, swimming or running can be useful in reversing auto-immune diseases.<\/li>\n<li><strong>Practice stress management.<\/strong> Try relaxation techniques like Pranayama and meditation for relief from daily stress. Get enough sleep at night. Get a massage once in a while. All of these practices will reduce your stress, promote relaxation and help you immensely in your journey to reverse autoimmunity.<\/li>\n<li><strong>Use dietary supplements.<\/strong> Your autoimmune diet food list should contain, apart from anti-inflammatory foods, supplements like vitamins, omega-3 fatty acids and probiotics. These have foods immune-modulating activity, that is, they keep our immune system functioning smoothly and efficiently. You can also include anti-inflammatory supplements like quercetin and rutin. Find out more about <a href=\"https:\/\/www.sepalika.com\/immunity\/immune-system-boosters\/\">supplements<\/a> that can <a href=\"https:\/\/www.sepalika.com\/immunity\/immune-system-boosters\/\" data-wplink-edit=\"true\">boost your immunity<\/a> in this article.<\/li>\n<\/ul>\n<h2><span id=\"Parting_Words\">Parting Words<\/span><\/h2>\n<p>The science of Functional Medicine is a fast evolving into an exciting field that is sweeping the world by storm. The limitations of conventional medicine with regards to its understanding of chronic diseases are being severely exposed every day. Practitioners of Functional Medicine aren’t shamans or faith healers; they are mainstream physicians who have found a new perspective of looking at (and reversing) chronic diseases, such as autoimmune disorders.<\/p>\n<p>The key here is to look at the body as a whole unit, and try to find the root cause of the problem, rather than treat it like a group of disjointed systems meant to be handled by different medical specialists. With a holistic view of how your body works, it isn’t difficult to reverse autoimmune disease and heal your body.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Yes, Autoimmune Diseases Can Be Reversed and These People have Proven It2 Immune System: A Protector That Sometimes Goes Rogue3 Hold On: So What Causes Autoimmune Disorders?3.1 Reason 1: A Leaky Gut3.2 Reason 2: Gluten-Sensitivity3.3 Reason 3: Toxins, Viruses and Fungi Entering the Body3.4 Reason 4: Stress4 Conventional V\/S Functional Medicine: Two [&hellip;]<\/p>\n","protected":false},"author":85,"featured_media":19220,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Reverse Autoimmune Diseases Through Diet &amp; Lifestyle Changes<\/title>\n<meta name=\"description\" content=\"How to reverse autoimmune disease? Make your gut healthy again, check for food allergies and sensitivities, stay active, check and heal infections.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Reverse Autoimmune Diseases Through Diet &amp; Lifestyle Changes\" \/>\n<meta property=\"og:description\" content=\"It&#039;s time to bust the myths!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\" \/>\n<meta property=\"article:published_time\" content=\"2017-05-12T03:00:25+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-11T06:13:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Stress.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jitendra Rathod\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/\",\"name\":\"How to Reverse Autoimmune Diseases Through Diet & Lifestyle Changes\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#primaryimage\"},\"datePublished\":\"2017-05-12T03:00:25+00:00\",\"dateModified\":\"2022-01-11T06:13:45+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\"},\"description\":\"How to reverse autoimmune disease? Make your gut healthy again, check for food allergies and sensitivities, stay active, check and heal infections.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Can Autoimmune Diseases Be Reversed?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\",\"name\":\"Jitendra Rathod\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Jitendra Rathod\"},\"description\":\"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.\",\"sameAs\":[\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\"],\"url\":\"https:\/\/www.sepalika.com\/author\/jitendra\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Reverse Autoimmune Diseases Through Diet & Lifestyle Changes","description":"How to reverse autoimmune disease? Make your gut healthy again, check for food allergies and sensitivities, stay active, check and heal infections.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/","og_locale":"en_US","og_type":"article","og_title":"How to Reverse Autoimmune Diseases Through Diet & Lifestyle Changes","og_description":"It's time to bust the myths!","og_url":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs","article_published_time":"2017-05-12T03:00:25+00:00","article_modified_time":"2022-01-11T06:13:45+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Stress.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Jitendra Rathod","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/","name":"How to Reverse Autoimmune Diseases Through Diet & Lifestyle Changes","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#primaryimage"},"datePublished":"2017-05-12T03:00:25+00:00","dateModified":"2022-01-11T06:13:45+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d"},"description":"How to reverse autoimmune disease? Make your gut healthy again, check for food allergies and sensitivities, stay active, check and heal infections.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/how-to-reverse-autoimmune-disease\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Can Autoimmune Diseases Be Reversed?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d","name":"Jitendra Rathod","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Jitendra Rathod"},"description":"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.","sameAs":["https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs"],"url":"https:\/\/www.sepalika.com\/author\/jitendra\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/10235"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/85"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=10235"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/10235\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19220"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=10235"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=10235"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=10235"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}