{"id":11061,"date":"2017-05-27T20:00:29","date_gmt":"2017-05-27T20:00:29","guid":{"rendered":"http:\/\/sepalika.wpengine.com\/?p=11061"},"modified":"2022-02-19T15:05:57","modified_gmt":"2022-02-19T09:35:57","slug":"reverse-pcos-diet-exercise","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/","title":{"rendered":"Reverse PCOS Naturally Through Diet And Exercises"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Reversing_PCOS_Insulin_Resistance_Is_The_Key\"><span class=\"toc_number toc_depth_1\">1<\/span> Reversing PCOS: Insulin Resistance Is The Key<\/a><\/li><li><a href=\"#Why_Natural_Treatment_Is_The_Best_Choice_For_Reversing_PCOS\"><span class=\"toc_number toc_depth_1\">2<\/span> Why Natural Treatment Is The Best Choice For Reversing PCOS<\/a><\/li><li><a href=\"#Three_Steps_To_Reverse_PCOS_Naturally\"><span class=\"toc_number toc_depth_1\">3<\/span> Three Steps To Reverse PCOS Naturally<\/a><ul><li><a href=\"#Switch_To_A_Low_Carb_High-Fat_Diet\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Switch To A Low Carb High-Fat Diet<\/a><\/li><li><a href=\"#Workout_Regularly_to_Reverse_PCOS\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Workout Regularly to Reverse PCOS<\/a><\/li><li><a href=\"#Effective_Dietary_Supplements_For_PCOS\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Effective Dietary Supplements For PCOS<\/a><\/li><\/ul><\/li><li><a href=\"#Reversing_PCOS_Why_Conventional_Treatment_Doesn8217t_Work\"><span class=\"toc_number toc_depth_1\">4<\/span> Reversing PCOS: Why Conventional Treatment Doesn&#8217;t Work<\/a><\/li><\/ul><\/div>\n<p>Have you been gaining <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-loss-tips\/\">weight<\/a>, dealing with troublesome adult acne and wondering why your menstrual cycle has become irregular? Chances are you’ve got PCOS or Polycystic Ovarian Syndrome. According to <a href=\"https:\/\/www.nichd.nih.gov\/health\/topics\/PCOS\/conditioninfo\/Pages\/risk.aspx\">National Institutes of Health (NIH)<\/a>, PCOS affects between 5% and 10% of women aged 18 to 44 years. Most of these women want to know whether it is possible to reverse PCOS naturally. The good news: Yes you can reverse PCOS through a combination of diet and exercise.<\/p>\n<h2><span id=\"Reversing_PCOS_Insulin_Resistance_Is_The_Key\">Reversing PCOS: Insulin Resistance Is The Key<\/span><\/h2>\n<p>Medical experts are still unclear on the real cause behind PCOS, but most women who are diagnosed with PCOS develop insulin resistance. Under insulin resistance, your body is unable to use the hormone insulin effectively, which leads to high blood sugar.  Insulin resistance can also greatly influence your ability to get pregnant. Treating this underlying insulin resistance can greatly help manage or reverse PCOS symptoms. The best part &#8212; this can be done naturally, without the use of prescription drugs.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/treat-pcos-naturally-inspiring-success-story\/\">How To Treat PCOS Naturally – An Inspiring Success Story<\/a><\/div>\n<div><\/div>\n<div>\n<h2><span id=\"Why_Natural_Treatment_Is_The_Best_Choice_For_Reversing_PCOS\">Why Natural Treatment Is The Best Choice For Reversing PCOS<\/span><\/h2>\n<p>PCOS is often a warning sign that your body is no longer as sensitive to insulin as it should be. And while medication may help this, these come with unwanted side effects and don’t really address the root cause – an unhealthy lifestyle causing insulin resistance.<\/p>\n<p>Lifestyle changes are the key to reversing PCOS. Losing weight will not only reduce insulin and androgen levels, it will also restore normal ovulation. Leading a healthy lifestyle that depends on eating a clean, healthy LCHF diet and focuses on getting regular exercise to improve insulin-sensitivity is a long-term fix that will also improve your odds of getting pregnant. A healthy lifestyle will not only fix insulin resistance, it also improves quality of life, making you feel stronger, fitter, happier and more at peace.<\/p>\n<h2><span id=\"Three_Steps_To_Reverse_PCOS_Naturally\">Three Steps To Reverse PCOS Naturally<\/span><\/h2>\n<h3><span id=\"Switch_To_A_Low_Carb_High-Fat_Diet\">Switch To A Low Carb High-Fat Diet<\/span><\/h3>\n<div id=\"attachment_19335\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Low-carb-high-fat-diet-for-PCOS.webp\"><img aria-describedby=\"caption-attachment-19335\" class=\"size-full wp-image-19335\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Low-carb-high-fat-diet-for-PCOS.webp\" alt=\"Switch To A Low Carb High-Fat Diet\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19335\" class=\"wp-caption-text\">Switch To A Low Carb High-Fat Diet<\/p><\/div>\n<p>Weight loss is one of the keys to reversing PCOS. While many nutritionists advocate the need for cutting back on fats, reduce portion sizes and cut back on caloric intake, such an extreme step towards weight loss is neither sustainable nor always possible. <strong>A conventional weight loss diet that encourages cutting back on fats will NOT WORK<\/strong>. Who wants to lose weight by starving themselves? And even if you manage to drop a few pounds, can you really sustain such a strict diet for the rest of your life? Chances are – you can’t. And that means that as soon as you go back to eating “normally” (by which I mean, enough to feel full), you’ll gain back all that weight and have to deal with insulin resistance all over again. What’s worse, when you cut back on all fats, you subsequently make up for that caloric deficit by eating more carbs, which truly is a disaster for PCOS.<\/p>\n<p>This is why, changing your approach to “dieting” is crucial to reversing PCOS. Most women are no strangers to “dieting” to lose weight. Which is why we want to steer you towards a diet that will not only help you lose weight, but one that you are likely to sustain and give several health benefits it for life!!!<\/p>\n<p>We’re talking about the LCHF or Low Carb High Fat diet. And this has been proven by <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC1334192\/\">research conducted at Duke University Medical Center<\/a> to study the effects of a low-carbohydrate, high fat diet on revsersing PCOS. Researchers found that such a diet led to significant improvement in weight, percent free testosterone, LH\/FSH ratio, and fasting insulin in women with obesity and PCOS over a 24 week period.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/low-carb-high-fat-lchf-diet-diabetes\/\">Low Carb-High Fat Diet And Diabetes: A Detailed Guide For Beginners<\/a><\/div>\n<p>The best explanation of why a low carb, high fat diet works for reversing PCOS is simple biology. Carbohydrates break down into sugars. The body needs to produce insulin to be able to push these sugars into cells where they’re used for energy. When the body gets excess carbohydrate that converts into excess blood glucose levels (or excess sugars), more and more insulin is produced to address the excess. Extra sugar gets stored as fat. This is a vicious cycle, and over a period of time, the body becomes less sensitive to insulin, resulting in insulin resistance.<\/p>\n<p>Low carbohydrate intake results in lower insulin levels, which reverses insulin resistance in PCOS and helps to balance the hormonal system. As a result, your LCHF diet supports normal ovulation and a normal menstrual cycle, while reducing other symptoms of PCOS naturally. It addresses <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-acne\/\">acne<\/a> and <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-hirsutism\/\">extra facial hair growth<\/a> too, and getting pregnant also becomes easier when you nourish your body with the right diet.<\/p>\n<p>As the name suggests, LCHF or Low Carb-High Fat diet focuses on low carbohydrate, moderate protein &amp; high fat combination. Get your daily quota of carbs by eating lots of vegetables and fruits. Cook vegetables and meats in<a href=\"https:\/\/www.sepalika.com\/living-well\/healthy-fats-why-everyone-must-eat-them\/\"> natural healthy fats<\/a> like grass-fed butter, coconut oil and extra-virgin olive oil. Cooking with these heart-healthy fats helps with satiety and keeps appetite in check too. Also add other healthy sources of fat like avocados, nuts, coconut milk and fatty fish to your diet.<\/p>\n<h3><span id=\"Workout_Regularly_to_Reverse_PCOS\">Workout Regularly to Reverse PCOS<\/span><\/h3>\n<div id=\"attachment_19336\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Exercise-regularly.webp\"><img aria-describedby=\"caption-attachment-19336\" class=\"size-full wp-image-19336\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Exercise-regularly.webp\" alt=\"Workout Regularly to Reverse PCOS\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19336\" class=\"wp-caption-text\">Workout Regularly to Reverse PCOS<\/p><\/div>\n<p>As mentioned in the beginning, improving insulin resistance is crucial for reversing PCOS. <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-does-exercise-help-diabetes\/\">Exercise<\/a> improves insulin resistance. Any kind of exercise helps, but muscle and weight training workouts are particularly helpful as these build lean muscle mass and help the body become more sensitive to insulin. However, cardio workouts are the key to losing weight, so these cannot be ignored either.<\/p>\n<p>Going to a gym and working with a certified personal trainer is definitely the easiest way to chart out the right cardio and weight training routine for your specific needs. However, if you don’t enjoy the gym, don’t force yourself. We are huge believers in staying active by doing activities or workouts that you actually enjoy. Because that’s the only way you will do them, right?! What&#8217;s the point of going to the gym if you hate it and can’t wait to get out?<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\">Reverse PCOS Naturally Through Diet And Exercises<\/a><\/div>\n<p>If you find high-intensity, stress-inducing workouts at the gym too overwhelming, choose a low-impact workout that suits your needs. Some women enjoy group classes, like Zumba, Pilates, Barre Yoga or Aqua Aerobics to help them stay fit. You can also go for a 30-45 minute brisk walk outdoors every day if that’s what you prefer. Walking, jogging, riding a bike and swimming are perfectly good cardio workouts that can be enjoyed in the fresh outdoor air and won’t cost you a dime extra! For weight training, park your car further away at the grocery store and carry your groceries back to your car and all the way up the stairs to your apartment! Yoga is an excellent choice as it uses your own body weight to tone the body, aid flexibility and workout all muscles. There are specific <a href=\"https:\/\/www.sepalika.com\/pcos\/yoga-for-pcos\/\">yoga asanas<\/a> that also help boost fertility, if you’re trying to get pregnant.<\/p>\n<p>In the end, what we want to stress on is this &#8212;- the right workout to reverse PCOS is one that you will stick to. Enjoy your workout so that you look forward to it, and it becomes an intrinsic part of your routine. Be it exercising at the gym, jogging, swimming or cycling, the key is to get moving and stay active! A holistic workout plan that focuses on some cardio workout accompanied by weight training and yoga plus meditation helps to not just encourage weight loss but also improve mood and fight stress.<\/p>\n<h3><span id=\"Effective_Dietary_Supplements_For_PCOS\">Effective Dietary Supplements For PCOS<\/span><\/h3>\n<p>When trying to reverse PCOS through diet and exercises, some supplements can be especially helpful in giving your body the extra nourishment it needs. When chosen correctly, the right dietary supplements increase your intake of nutrients that support your body’s ability to use insulin and can help keep your blood sugar stable. We highly recommend adding Vitamin B Complex, Vitamin D3, Magnesium, Cinnamon, Chromium, ALA, Berberine and Pomegranate Extract to your diet. Supplementing with <a href=\"https:\/\/www.sepalika.com\/pcos\/omega-3-pcos\/\">Omega 3s<\/a> or Fish Cod Liver Oil helps optimize your Omega 6 to Omega 3 ratio. We also highly recommend D-Chiro Inositol, an excellent supplement to alleviate symptoms of PCOS. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/22774396\">Research <\/a>has found that inositol exerts beneficial effects at metabolic, hormonal and ovarian level for women.<\/p>\n<\/div>\n<h2><span id=\"Reversing_PCOS_Why_Conventional_Treatment_Doesn8217t_Work\">Reversing PCOS: Why Conventional Treatment Doesn&#8217;t Work<\/span><\/h2>\n<div id=\"attachment_19339\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Conventional-PCOS-treatment.webp\"><img aria-describedby=\"caption-attachment-19339\" class=\"size-full wp-image-19339\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/Conventional-PCOS-treatment.webp\" alt=\"Why Conventional Treatment Doesn't Work\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19339\" class=\"wp-caption-text\">Why Conventional Treatment Doesn&#8217;t Work<\/p><\/div>\n<p>A quick word on why conventional treatment doesn&#8217;t work for reversing PCOS. Unfortunately, there is no medical cure for PCOS. So the idea behind this medication cocktail is to get a handle on the symptoms and improve your overall quality of life. However, all these medicines come with unwarranted side effects.<\/p>\n<p>Conventional treatment focuses on regulating your menstrual cycle through <a href=\"https:\/\/www.sepalika.com\/pcos\/side-effects-birth-control-pills\/\">birth control pills<\/a>. If you’re trying to become pregnant, your doctor may also prescribe medication to help you ovulate, like an oral anti-estrogen medication during the first part of your menstrual cycle. Anti-androgen drugs are prescribed to reduce acne and excess hair growth. If your blood sugar tests reveal that you have insulin resistance, diabetes medications like Metformin may also be prescribed to lower blood glucose and testosterone levels.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/probiotics-for-pcos\/\">Probiotics For PCOS: Improve Your Gut Health For Relief From PCOS<\/a><\/div>\n<p>While birth control pills will regulate menstrual cycle, they simply mask your symptoms without actually addressing the underlying problem &#8212;- which is insulin resistance, in most cases. Some women don’t feel good when they’re on The Pill as it can lead to weight gain, cause mood changes and interfere with libido. In fact, contraceptives deteriorate insulin sensitivity, as proven by <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/12915645?dopt=Abstract\">research<\/a>. According to a study conducted at Athens University School of Medicine, treatment of adolescent girls with PCOS with oral contraceptives resulted in unfavorable changes of insulin sensitivity. Oral contraceptives have also been linked to increased risk of stroke. The pill can also lead to depression, mood changes and fluid retention. <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/metformin-side-effects\/\">Metformin<\/a> comes with its own set of side-effects too.<\/p>\n<p>To conclude, it is very much possible to reverse PCOS naturally through diet and exercise. Try making simple changes to your lifestyle and you will see how it is possible to overcome the symptoms of PCOS without relying on medicines.<\/p>\n<h4><a href=\"https:\/\/www.sepalika.com\/our-programs\/polycystic-ovary-disorder\/\" target=\"_blank\" rel=\"noopener\">Want To Explore More? Checkout Sepalika Polycystic Ovary Disorder (PCOD) Program<\/a><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>Have you been gaining weight, dealing with troublesome adult acne and wondering why your menstrual cycle has become irregular? <\/p>\n","protected":false},"author":24,"featured_media":16654,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[145,143],"tags":[94,146],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Reverse PCOS Naturally Through Diet and Exercise | Sepalika<\/title>\n<meta name=\"description\" content=\"We discuss what causes PCOS, how it is diagnosed, and how you can get rid of PCOS completely with the right combination of diet and exercise.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Reverse PCOS Naturally\" \/>\n<meta property=\"og:description\" content=\"PCOS is the most common endocrine abnormality of reproductive-aged women in the United States. But it can be reversed naturally!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-05-27T20:00:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T09:35:57+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/PCOS-with-diet-and-exercise.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\",\"name\":\"Reverse PCOS Naturally Through Diet and Exercise | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#primaryimage\"},\"datePublished\":\"2017-05-27T20:00:29+00:00\",\"dateModified\":\"2022-02-19T09:35:57+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"We discuss what causes PCOS, how it is diagnosed, and how you can get rid of PCOS completely with the right combination of diet and exercise.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Reverse PCOS Naturally Through Diet And Exercises\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Reverse PCOS Naturally Through Diet and Exercise | Sepalika","description":"We discuss what causes PCOS, how it is diagnosed, and how you can get rid of PCOS completely with the right combination of diet and exercise.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/","og_locale":"en_US","og_type":"article","og_title":"How To Reverse PCOS Naturally","og_description":"PCOS is the most common endocrine abnormality of reproductive-aged women in the United States. But it can be reversed naturally!","og_url":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-05-27T20:00:29+00:00","article_modified_time":"2022-02-19T09:35:57+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/05\/PCOS-with-diet-and-exercise.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#webpage","url":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/","name":"Reverse PCOS Naturally Through Diet and Exercise | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#primaryimage"},"datePublished":"2017-05-27T20:00:29+00:00","dateModified":"2022-02-19T09:35:57+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"We discuss what causes PCOS, how it is diagnosed, and how you can get rid of PCOS completely with the right combination of diet and exercise.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/pcos\/reverse-pcos-diet-exercise\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Reverse PCOS Naturally Through Diet And Exercises"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/11061"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=11061"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/11061\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16654"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=11061"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=11061"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=11061"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}