{"id":11905,"date":"2017-06-21T20:00:26","date_gmt":"2017-06-21T20:00:26","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=11905"},"modified":"2022-01-19T11:12:08","modified_gmt":"2022-01-19T05:42:08","slug":"oral-health-chronic-conditions","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/","title":{"rendered":"The Surprising Connection Between Oral Health and Chronic Conditions"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Poor_Oral_Health_A_Silent_Epidemic\"><span class=\"toc_number toc_depth_1\">1<\/span> Poor Oral Health: A Silent Epidemic<\/a><\/li><li><a href=\"#Oral_Health_and_Diabetes\"><span class=\"toc_number toc_depth_1\">2<\/span> Oral Health and Diabetes<\/a><\/li><li><a href=\"#Oral_Health_and_Cardiovascular_Disease\"><span class=\"toc_number toc_depth_1\">3<\/span> Oral Health and Cardiovascular Disease<\/a><\/li><li><a href=\"#Other_Chronic_Conditions_Linked_with_Poor_Oral_Health\"><span class=\"toc_number toc_depth_1\">4<\/span> Other Chronic Conditions Linked with Poor Oral Health<\/a><\/li><li><a href=\"#Oral_Health_Is_Also_Connected_To_Mental_Health\"><span class=\"toc_number toc_depth_1\">5<\/span> Oral Health Is Also Connected To Mental Health<\/a><\/li><li><a href=\"#Dont_Depend_On_Root_Canals\"><span class=\"toc_number toc_depth_1\">6<\/span> Don’t Depend On Root Canals<\/a><\/li><li><a href=\"#8_Simple_Tips_To_Improve_Oral_Health_And_Protect_Against_Chronic_Conditions\"><span class=\"toc_number toc_depth_1\">7<\/span> 8 Simple Tips To Improve Oral Health And Protect Against Chronic Conditions<\/a><\/li><\/ul><\/div>\n<p>We have been told time and again that good oral hygiene means healthy teeth and gum. But did you know that your oral health is responsible for more than just your beautiful smile? Yup, you heard us right.<\/p>\n<p>Our mouths are the breeding grounds for lots of germs. These germs don’t just attack the teeth and gums causing yellowing, plaque, decay and gum diseases, they also lead to infections that can make us susceptible to a multitude of chronic disease. Today, tons of scientific evidence point us in a scary direction. Oral health is intrinsically linked to serious chronic conditions, and it’s time we took it a lot more seriously.<\/p>\n<h2><span id=\"Poor_Oral_Health_A_Silent_Epidemic\">Poor Oral Health: A Silent Epidemic<\/span><\/h2>\n<p>According to a report released in December 2011 by Dental Health Services Victoria, 70% of tooth loss is due to tooth decay, 20% due to periodontal diseases and 10% due to other causes. As you can see, tooth decay and periodontal diseases are the two leading causes of poor oral health. Being a warm, moist environment, full of food-laden saliva, the mouth harbors a plethora of germs which makes it vulnerable to infections.<\/p>\n<p>Bacteria in the mouth attack teeth and gums to cause cavities, plaque and gum diseases. These bacteria use sugar from the food eaten to create acid, which is responsible for corroding the teeth to form cavities (or caries) as well as plaque on teeth. These same bacteria are also responsible for causing inflammation of the gums, otherwise known as gingivitis, which causes gums to become swollen and bleed easily. With proper oral hygiene, gingivitis can be reversed. But when left untreated, it leads to periodontitis disease wherein the gums pull away from the teeth to form pockets that become infected.<\/p>\n<p>This infection then starts to spread underneath the gum line, damaging tissue and bones that form the dental structure. Periodontal disease is one of the most common oral diseases. If left untreated, it becomes a serious and destructive chronic infection that also causes tooth loss. Periodontal disease is intrinsically linked to increased risk of heart attacks and diabetes. Diabetics are particularly susceptible to the risk of periodontal disease, especially if their blood sugar levels are not under control.<\/p>\n<h2><span id=\"Oral_Health_and_Diabetes\">Oral Health and Diabetes<\/span><\/h2>\n<p>The connection between diabetes and periodontal disease is a vicious cycle. Diabetics are more susceptible to periodontal disease because they are more susceptible to chronic inflammation as well as contracting infections due to poor immunity. On the other hand, periodontal disease increases blood sugar and diabetic complications. See, it’s a vicious cycle, especially for those who don’t have their blood sugar levels under control.<\/p>\n<p>A <a href=\"http:\/\/www.joponline.org\/doi\/abs\/10.1902\/annals.2001.6.1.99\">report compiled by University of Michigan School of Dentistry<\/a> found evidence of a bidirectional relationship between diabetes and periodontal diseases. Numerous studies provide direct evidence to support periodontal infection having an adverse, yet modifiable effect on glycemic control. Researchers now have evidence that supports diabetes having an adverse effect on periodontal health, as well as periodontal infection having an adverse effect on glycemic control and incidence of diabetic complications. Another Korean study has found a link between tooth loss and diabetes.<\/p>\n<p>So, what’s the common factor? Researchers from University at Buffalo believe that obesity is a significant predictor of periodontal disease and insulin resistance appears to mediate this relationship. They examined the results of the Third National Health and Nutrition Examination Survey (NHANES III) to study the relationship between periodontal disease, obesity, and insulin resistance. They found that obesity is associated with hyper-inflammatory state. This increases the risk for periodontal disease and accounts in part for insulin resistance. Scientists from Department of Periodontology, Malmö University, Sweden have also found that the best predictor of severe periodontal disease in subjects with Type 2 Diabetes is smoking, followed by HbA1c levels.<\/p>\n<p>This crucial connection between oral health and diabetes leads to the development of a clinical guideline by Harvard School of Public Health. It helps the dentists identify patients with undiagnosed diabetes in the hopes that it will improve early identification of diabetes. This will help make diabetes care and management easier.<\/p>\n<h2><span id=\"Oral_Health_and_Cardiovascular_Disease\">Oral Health and Cardiovascular Disease<\/span><\/h2>\n<p>Research has also found a connection between periodontal disease and heart disease. While the detailed cause-and-effect relationship is not yet clear, experts believe that inflammation caused by periodontal disease may be responsible for the association.<\/p>\n<p>A <a href=\"http:\/\/www.joponline.org\/doi\/abs\/10.1902\/jop.2006.050233\">Swedish clinical trial<\/a> found evidence in a study based on 4,254 subjects that the severity of periodontal disease and number of remaining teeth are related to the prevalence of myocardial infarction and hypertension. Research has found that periodontal disease appears to be associated with a 19% increase in the risk of future cardiovascular disease. This increase in risk factors is more prominent (44%) in persons aged ≤65 years. However, other studies have found that dental disease is associated with an increased risk of coronary heart disease even in young men. For those with existing heart conditions, periodontal disease can exacerbate the risk for infective endocarditis, necessitating the need for antibiotics prior to dental procedures.<\/p>\n<p>Research has also found periodontal disease to be a risk factor for ischemic stroke, especially in men and younger subjects. Evidence showed that subjects with severe periodontitis had a 4.3-times higher risk of cerebral ischemia. Data from the First National Health and Nutrition Examination Survey (NHANES I) and its Epidemiologic Follow-up Study (NHEFS) also show that periodontal disease is an important risk factor for total cerebrovascular accidents and non-hemorrhagic stroke in particular.<\/p>\n<h2><span id=\"Other_Chronic_Conditions_Linked_with_Poor_Oral_Health\">Other Chronic Conditions Linked with Poor Oral Health<\/span><\/h2>\n<p>Poor oral health leads to chronic oral infection. It chips away at the body’s immune response over time, essentially wearing out the<a href=\"https:\/\/www.sepalika.com\/immunity\/immune-system-boosters\/\"> immune system.<\/a><\/p>\n<p>One study examined the association between oral health and deaths from cardiovascular diseases, cancer, and respiratory problems among older Japanese to find that poor oral health predicted cardiovascular and respiratory disease mortality. Studies have linked poor oral health with gastric infections. Poor periodontal health, characterized by advanced periodontal pockets, may be <a href=\"http:\/\/ajph.aphapublications.org\/doi\/abs\/10.2105\/AJPH.92.11.1809\">associated with H. pylori infection in adults<\/a>, independent of poverty status. H. pylori are bacteria that grow in the digestive tract that tend to attack the stomach lining. Scientists believe that periodontitis shares pathogenic mechanisms with rheumatoid arthritis and may trigger its onset.<\/p>\n<p>Research has also linked periodontal disease to increased risk of Peripheral Vascular Disease. Scientists have also found that anti-asthmatic medication has adverse effects on dental caries and periodontal disease. Asthmatic patients are recommended to adopt more precautionary oral hygiene practices and keep their caries activity and periodontal health under constant check.<\/p>\n<h2><span id=\"Oral_Health_Is_Also_Connected_To_Mental_Health\">Oral Health Is Also Connected To Mental Health<\/span><\/h2>\n<div id=\"attachment_19544\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Oral-Health-Mental-Health.webp\"><img aria-describedby=\"caption-attachment-19544\" class=\"size-full wp-image-19544\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Oral-Health-Mental-Health.webp\" alt=\"oral health &amp; chronic diseases - Mental Health\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19544\" class=\"wp-caption-text\">oral health &amp; chronic diseases &#8211; Mental Health<\/p><\/div>\n<p>Poor oral health increases susceptibility to infections that negatively impact physical health. But oral health can also play a role in your mental health.<\/p>\n<p>A Japanese study found that elderly subjects with fewer or no teeth were much more likely to suffer from cognitive impairment and memory loss. A Korean study had similar findings concluding that having fewer teeth may be a marker of risk for dementia. This might be explained by specific nutritional deficits, or by other side effects of periodontal disease. Another UK study also found that poor dental health is associated with cognitive impairment.<\/p>\n<h2><span id=\"Dont_Depend_On_Root_Canals\">Don’t Depend On Root Canals<\/span><\/h2>\n<div id=\"attachment_19546\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Root-Canal.webp\"><img aria-describedby=\"caption-attachment-19546\" class=\"size-full wp-image-19546\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Root-Canal.webp\" alt=\"oral health &amp; chronic diseases - Don't depend on root canal\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-19546\" class=\"wp-caption-text\">oral health &amp; chronic diseases &#8211; Don&#8217;t depend on root canal<\/p><\/div>\n<p>Have you noticed how common root canals have become? A treatment for tooth infections (which have been caused by poor oral hygiene),  root canals may be just as evil as the infections they set out to treat.<\/p>\n<p><em>Dental problems such as cavities, infections, toxic or allergy-producing filling materials, root canal, and misalignment of the teeth or jaw can have far-reaching effects throughout the body. <\/em>Alternative health practitioners who are familiar with the principles of biological dentistry have long known about the link between dental problems and degenerative diseases.<\/p>\n<p>Did you know that Norway, Denmark and Sweden have all banned mercury amalgam, citing health and environmental hazards? Mercury amalgams that have long been used for dental fillings have been linked to a long list of health problems. These include fatigue, migraines, poor coordination, autoimmune problems, mood swings, anxiety and tremors.<\/p>\n<p>Dr. Weston A. Price, a Cleveland dentist, has been called the “Isaac Newton of Nutrition”. He had warned of the bacteria that are in and around root canals. He believed that they weaken the immune system and are not restricted to just the mouth. In fact, they enter the bloodstream, traveling to organs and tissues, causing further harm. Dr. Josef M. Issels was one of the first physicians to act upon this fact. In his career of more than 40 years of treating terminal, end-stage cancer patients, Dr. Issels found that 97% of them had root canals. He was so convinced about the dangers of root canals, that he insisted all his patients had them removed before he began treatment.<\/p>\n<p>If your oral health is so far gone that you have to consider root canal, we recommend that you think twice. Instead, find a dentist who will give you an alternative to root canal that can provide you with a more comprehensive, holistic solution for your teeth and not harm your health.<\/p>\n<h2><span id=\"8_Simple_Tips_To_Improve_Oral_Health_And_Protect_Against_Chronic_Conditions\">8 Simple Tips To Improve Oral Health And Protect Against Chronic Conditions<\/span><\/h2>\n<ol>\n<li>Cut back on refined sugar and processed foods. The more sugars you eat, the higher are your risks of getting cavities and gum diseases.<\/li>\n<li>Ensure that you practice good oral hygiene. Brush your teeth post meal using gentle back and forth motions.<\/li>\n<li>Get enough calcium and magnesium through your diet, as these are crucial for healthy teeth and bones. Consider supplements if you suspect you don’t get enough of these through a healthy diet.<\/li>\n<li>Many of us are deficient in Vitamin K2 which is the carrier of calcium. Vitamin D also aids the absorption of Both Vitamins K2 and D3 help strengthen your teeth and boost oral health.<\/li>\n<li>Cod Liver oil does wonders for naturally healing cavities. Give it a try.<\/li>\n<li>Eat more<a href=\"https:\/\/www.sepalika.com\/living-well\/healthy-fats-why-everyone-must-eat-them\/\"> healthy fats<\/a>. Add coconut oil, krill oil and grass-fed butter to your diet, as these natural fats help fight inflammation.<\/li>\n<li>Care for your oral microbiome by avoiding harsh fluoride toothpastes and mouthwashes. Instead, try a natural toothpaste that strengthens your teeth and gums.<\/li>\n<li>Practice <a href=\"https:\/\/www.sepalika.com\/living-well\/six-immediate-benefits-oil-pulling\/\">oil pulling <\/a>every day to give your whole mouth a deep clean and boost <a href=\"https:\/\/www.sepalika.com\/living-well\/oil-pulling-for-oral-health\/\">oral health<\/a>.<\/li>\n<\/ol>\n<p>When it comes to oral health, prevention may be better than cure. So, follow our tips to boost oral health and keep plaque, tartar, caries and gum diseases at bay.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We have been told time and again that good oral hygiene means healthy teeth and gum. But did you know that your oral health is responsible for more than just your beautiful smile? <\/p>\n","protected":false},"author":24,"featured_media":19547,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Can Neglecting Oral Health Lead To Chronic Conditions? | Sepalika<\/title>\n<meta name=\"description\" content=\"Neglecting oral health can lead to chronic conditions such as diabetes and cardiovascular diseases. It can also impact mental health.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Surprising Connection Between Oral Health and Chronic Conditions\" \/>\n<meta property=\"og:description\" content=\"Oral health is responsible for more than just a pretty smile!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-06-21T20:00:26+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-19T05:42:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Oral-Health-Chronic-Disease.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/\",\"name\":\"Can Neglecting Oral Health Lead To Chronic Conditions? | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#primaryimage\"},\"datePublished\":\"2017-06-21T20:00:26+00:00\",\"dateModified\":\"2022-01-19T05:42:08+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Neglecting oral health can lead to chronic conditions such as diabetes and cardiovascular diseases. It can also impact mental health.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Surprising Connection Between Oral Health and Chronic Conditions\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Can Neglecting Oral Health Lead To Chronic Conditions? | Sepalika","description":"Neglecting oral health can lead to chronic conditions such as diabetes and cardiovascular diseases. It can also impact mental health.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/","og_locale":"en_US","og_type":"article","og_title":"The Surprising Connection Between Oral Health and Chronic Conditions","og_description":"Oral health is responsible for more than just a pretty smile!","og_url":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-06-21T20:00:26+00:00","article_modified_time":"2022-01-19T05:42:08+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Oral-Health-Chronic-Disease.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/","name":"Can Neglecting Oral Health Lead To Chronic Conditions? | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#primaryimage"},"datePublished":"2017-06-21T20:00:26+00:00","dateModified":"2022-01-19T05:42:08+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Neglecting oral health can lead to chronic conditions such as diabetes and cardiovascular diseases. It can also impact mental health.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/oral-health-chronic-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Surprising Connection Between Oral Health and Chronic Conditions"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/11905"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=11905"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/11905\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19547"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=11905"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=11905"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=11905"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}