{"id":12009,"date":"2017-06-26T20:00:13","date_gmt":"2017-06-27T03:00:13","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12009"},"modified":"2022-01-19T16:22:14","modified_gmt":"2022-01-19T10:52:14","slug":"gerd-and-hiatal-hernia","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/","title":{"rendered":"Hiatal Hernia: A Hidden Danger of GERD"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#What_are_the_Symptoms_of_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">1<\/span> What are the Symptoms of Hiatal Hernia?<\/a><\/li><li><a href=\"#Types_of_Hiatal_Hernias\"><span class=\"toc_number toc_depth_1\">2<\/span> Types of Hiatal Hernias<\/a><\/li><li><a href=\"#What_Causes_a_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">3<\/span> What Causes a Hiatal Hernia?<\/a><\/li><li><a href=\"#Poor_Eating_Habits_and_GERD_Medication\"><span class=\"toc_number toc_depth_1\">4<\/span> Poor Eating Habits and GERD Medication<\/a><\/li><li><a href=\"#Chronic_Acid_Reflux_or_GERD\"><span class=\"toc_number toc_depth_1\">5<\/span> Chronic Acid Reflux or GERD<\/a><\/li><li><a href=\"#Complications_Due_to_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">6<\/span> Complications Due to Hiatal Hernia<\/a><\/li><li><a href=\"#Treating_a_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">7<\/span> Treating a Hiatal Hernia<\/a><\/li><li><a href=\"#Surgery_to_Correct_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">8<\/span> Surgery to Correct Hiatal Hernia<\/a><\/li><li><a href=\"#Chiropractic_Manipulation_To_Resolve_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">9<\/span> Chiropractic Manipulation To Resolve Hiatal Hernia<\/a><\/li><li><a href=\"#DIY_for_Hiatal_Hernia\"><span class=\"toc_number toc_depth_1\">10<\/span> DIY for Hiatal Hernia<\/a><\/li><li><a href=\"#Conclusion\"><span class=\"toc_number toc_depth_1\">11<\/span> Conclusion<\/a><\/li><\/ul><\/div>\n<p>A hernia is a condition where an organ bulges through an opening in a muscle or a tissue that’s supposed to hold the organ in place. The hiatus is a small opening in the diaphragm (the muscular wall that separates organs of the chest cavity such as lungs and the heart, and those in the abdomen such as the stomach, the intestines, the liver, the spleen, and the pancreas) through which the food pipe (esophagus) passes and opens into the stomach.<\/p>\n<p>A hiatal hernia (also called hiatus hernia) is a condition when a part of the stomach squeezes out above the diaphragm through the hiatus. This weakens the muscular valve (lower esophageal sphincter or LES) that guards the junction between the esophagus and the stomach. A weak LES allows acidic contents of the stomach to slosh back into the esophagus, causing chronic heartburn that can eventually lead to GERD. The connection between hiatal hernia and GERD connection is very strong and a majority of people with this condition also suffer from GERD.<\/p>\n<h2><span id=\"What_are_the_Symptoms_of_Hiatal_Hernia\">What are the Symptoms of Hiatal Hernia?<\/span><\/h2>\n<p>Hiatal hernias are known as “great mimics” because their symptoms mimic those of many other disorders. For instance, a severe pain in the chest may be mistaken for a heart attack or a severe pain in the stomach can be confused with an ulcer.<\/p>\n<p>As discussed above, a weak LES can cause acidic stomach contents to slosh back into the esophagus. This can lead to spasms in the esophagus, heartburn and inflammation of the esophageal tube, and other symptoms associated with GERD such as<\/p>\n<ul>\n<li>Dry mouth<\/li>\n<li>Irritation, tenderness and bleeding of gums<\/li>\n<li>Bad breath<\/li>\n<li>Bloating after meals<\/li>\n<li>Regurgitation of acidic contents<\/li>\n<li>Nausea<\/li>\n<li>Bitter taste in the mouth<\/li>\n<\/ul>\n<p><strong>Other more severe symptoms of hiatal hernia are:<\/strong><\/p>\n<ul>\n<li>Vomiting blood and black stools (a sign of bleeding due to an ulcer in the stomach or in the esophagus)<\/li>\n<li>Gassiness after meals<\/li>\n<li>Difficulty swallowing (possibly due to constriction of the esophagus)<\/li>\n<li>Unexplained loss of weight<\/li>\n<li>Discomfort while bending over<\/li>\n<li>Hoarseness in the voice<\/li>\n<li>Chronic cough<\/li>\n<\/ul>\n<p>Shallow breathing is another symptom of a hiatal hernia. During breathing, the diaphragm muscles pull downwards and expand the chest cavity. This helps the lungs to inflate. A hiatal hernia will interfere with the diaphragm muscles and restrict their movement. This will make the person resort to shallow breathing because deep breathing can cause them discomfort. In particular, the condition is bad for asthmatics and may make their asthma worse.<\/p>\n<p>There are also symptoms associated with the vagus nerve, the longest, autonomic nerve in the human body that passes through the esophagus and the stomach. The constriction of the esophagus and a part of the stomach coming out of the hiatal opening can put the vagus nerve under stress. Since the nerve controls, among other things, the secretion of acid in the stomach in response to food, its constriction can lead to under- or over-secretion of hydrochloric acid in the stomach.<\/p>\n<p>The vagus nerve also controls the action of another muscular valve (the pyloric sphincter) that guards the junction between the stomach and the small intestines. A stressed vagus nerve can lead to deregulation of the lower sphincter. This may cause leakage of digestive juices from the stomach into the small intestines. This may also impair proper digestion and lead to digestive problems.<\/p>\n<p>The irritation of the vagus nerve can load to complications in many organs through which the nerve passes through, such as the heart, the esophagus, the lungs, the stomach, the small intestines, the liver, the gall bladder, the pancreas and the colon.<\/p>\n<h2><span id=\"Types_of_Hiatal_Hernias\">Types of Hiatal Hernias<\/span><\/h2>\n<p>Hiatal hernias are essentially of two types &#8211; sliding and paraesophageal. The sliding type of hiatal hernia is the more common one in which the upper part of the stomach (that joins with the esophagus) comes out through the hiatal opening above the diaphragm.<\/p>\n<p>The paraesophageal hiatal hernia is less common (only about 5% of all the cases of hiatal hernia) but is a more serious complication. In this condition, the part of the stomach that herniates lies besides the esophageal tube.<\/p>\n<p>Sliding hiatal hernias are a major risk factor for GERD and more often than not, the two conditions are seen together. Conversely, GERD can also cause a hiatal hernia. In sliding hiatal hernia, the lower esophageal sphincter (LES), which is normally at the same level as the diaphragm, squeezes above the diaphragm. This further weakens the LES as it does not get support from the diaphragm to remain closed. This can aggravate the symptoms of GERD.<\/p>\n<h2><span id=\"What_Causes_a_Hiatal_Hernia\">What Causes a Hiatal Hernia?<\/span><\/h2>\n<p>There are many causes of a hiatal hernia. A mechanical cause may include improper lifting of heavy load, chronic cough, sharp physical blows to the abdomen, poor posture and tight-fitting clothes.<\/p>\n<h2><span id=\"Poor_Eating_Habits_and_GERD_Medication\">Poor Eating Habits and GERD Medication<\/span><\/h2>\n<div id=\"attachment_19550\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Poor-Eating-Habits-and-GERD-Medication.webp\"><img aria-describedby=\"caption-attachment-19550\" class=\"wp-image-19550 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Poor-Eating-Habits-and-GERD-Medication.webp\" alt=\"GERD and Hiatal Hernia\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19550\" class=\"wp-caption-text\">Poor Eating Habits and GERD Medication<\/p><\/div>\n<p>Hiatal hernias may also be caused due to poor eating habits. Bad dietary choices (wrong food combinations) and habits (eating while stressed, drinking along with meals or overeating) may lead to the inflammation of the <em>ileocecal valve<\/em>. This valve guards the junction between the small and large intestines. When food is being digested, it moves from the stomach to the small intestines and from the small intestines into the large intestines. At every junction, there is a valve that allows the food to move forward.<\/p>\n<p>The ileocecal valve may get inflamed and swollen from bad dietary choices and habits. Inflammation and swelling can weaken the ileocecal valve and force it to open backwards leading to a backflow of digested food from the large intestines into the small intestines. The re-entry of digested food back into the small intestines may lead to its fermentation by gut bacteria. This fermentation leads to formation of gas, which exerts pressure on the stomach. The physical pressure of the gas and the backflow of digested food material may force the stomach out of the hiatus.<\/p>\n<p>If you understand how this exact process happens as a <a href=\"https:\/\/www.sepalika.com\/gerd\/gerd-medications-worsen-symptoms\/\" data-wplink-edit=\"true\">side effect of long term antacid use <\/a>you can clearly see why chronic GERD sufferers are at higher risk for hiatus hernia.<\/p>\n<h2><span id=\"Chronic_Acid_Reflux_or_GERD\">Chronic Acid Reflux or GERD<\/span><\/h2>\n<p>An already present acid reflux (or GERD) can itself be a cause of hiatal hernia. When acidic contents reflux into the esophagus, they can sometimes reflux as far as the base of the mouth. Many of us have experienced “tasting bile in the mouth,” that is nothing but refluxing back of stomach contents and travelling up to the mouth. When reflux enters the throat, it inflames and irritates the throat, leading to persistent cough. Cough is a natural bodily reflex to remove the irritant. In this case, the reflux will continue to irritate the throat and can cause persistent coughing, leading to immense pressure on the diaphragm and associated stomach muscles. With every cough, the diaphragm is pulled upwards. This action can cause the hiatus to open up more and make the stomach to herniate.<\/p>\n<h2><span id=\"Complications_Due_to_Hiatal_Hernia\">Complications Due to Hiatal Hernia<\/span><\/h2>\n<p>While the hernia itself isn’t physically dangerous, it can make your GERD worse. And an untreated GERD can lead to serious problems like inflammation of the esophagus (esophagitis) and cancer of the esophagus. A bad GERD can also cause ulcerations in the stomach and bleeding.<\/p>\n<h2><span id=\"Treating_a_Hiatal_Hernia\">Treating a Hiatal Hernia<\/span><\/h2>\n<p>Not all people with hernia experience any symptoms. In people who do have symptoms, it is all about treating GERD that worsens due to hiatal hernia. GERD can be treated by regulating digestion and acid production. This is often achieved by modifications to diet, lifestyle changes and supplementation.<\/p>\n<h2><span id=\"Surgery_to_Correct_Hiatal_Hernia\">Surgery to Correct Hiatal Hernia<\/span><\/h2>\n<p>In severe case, however, where the constriction is bad enough that it cuts off blood supply, a surgery is done to correct the problem. Surgeries can achieve a variety of things and the end result is decided upon the condition of the patient and their symptoms. A surgical intervention can either fix or remove the hernia sac or tuck the stomach back into its original position. With surgery, the hiatus is made smaller for not allowing the hernia to occur again. In some cases, the weak LES is reconstructed. In many cases, surgery may not be a complete success because a cut in any part of the body only weakens it. The hernia may come back within a short period of time. Remember though that if the initial cause of the hernia was chronic GERD or acid Reflux, an operation alone will not solve the root cause. The root cause must be addressed with lifestyle changes to minimize the risk of a second hernia developing.<\/p>\n<h2><span id=\"Chiropractic_Manipulation_To_Resolve_Hiatal_Hernia\">Chiropractic Manipulation To Resolve Hiatal Hernia<\/span><\/h2>\n<div id=\"attachment_19551\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Chiropractic-Manipulation-To-Resolve-Hiatal-Hernia.webp\"><img aria-describedby=\"caption-attachment-19551\" class=\"size-full wp-image-19551\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/Chiropractic-Manipulation-To-Resolve-Hiatal-Hernia.webp\" alt=\"GERD and Hiatal Hernia\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19551\" class=\"wp-caption-text\">Chiropractic Manipulation To Resolve Hiatal Hernia<\/p><\/div>\n<p>Some people try to treat the problems through a non-invasive physical means like manipulating the stomach by hand through massaging, either by a trained chiropractor or massage therapist. Chiropractic is a government licensed medical modality with a long history in the United States, so you may want to try this method with a good chiropractor. While most chiropractors are skilled at manipulation of the spinal vertebrae, there are chiropractors who specialize in something called “visceral” manipulation (manipulation of soft organs). There are several cases reported in chiropractic literature of hiatal hernias that have been fixed, through a combination of this sort of manipulation and follow up with proper lifestyle changes.<\/p>\n<h2><span id=\"DIY_for_Hiatal_Hernia\">DIY for Hiatal Hernia<\/span><\/h2>\n<p>The internet has people who swear by DIY recommendations like drinking a pint (around half a liter) of warm water first thing each morning and then standing on your toes and dropping suddenly to your heels. By doing this several times, it is believed that the sudden dropping can help the stomach to slide down to its original position. The warm water helps loosen the muscles of the stomach and the diaphragm and also puts some weight on the stomach. There is, however, no scientific evidence to prove if this therapy works and it could even present a risk to the sufferer, so we do not recommend it.<\/p>\n<p>GERD is a major problem in people with hiatal hernia and should be treated to avoid further complications like ulcers and cancer. We’ve talked extensively about supplements that can help alleviate symptoms of acid reflux as well as treat the condition from the root. We advise you to use this information only as a guide. Any treatment regimen must be created along with your friendly neighborhood medical practitioner.<\/p>\n<p>Lifestyle changes are vital for the treatment of this condition. Smoking and drinking are known to weaken the LES and making GERD worse. As a first line of treatment, it is advisable to stop smoking and drinking completely. Also minor lifestyle modifications like not lying down immediately after a meal, eating smaller meals, etc. can be practiced while the problem is being solved.<\/p>\n<h2><span id=\"Conclusion\">Conclusion<\/span><\/h2>\n<p>Hiatal hernia can be caused by an underlying acid reflux problem. Once hiatal hernia occurs, it can, in turn, worsen an existing GERD. Thus, both are risk factors for the other. While hiatal hernia can be corrected by surgery, the treatment of GERD requires a holistic approach that involves correcting your diet and lifestyle. Natural supplements that provide symptomatic relief as well as help treat the root cause of the problem can also be of help.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hiatal hernias are known as “great mimics” because their symptoms mimic those of many other disorders.<\/p>\n","protected":false},"author":85,"featured_media":19549,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[14,31],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>GERD and Hiatal Hernia: Understand The Connection | Sepalika<\/title>\n<meta name=\"description\" content=\"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"GERD and Hiatal Hernia: Understand The Connection | Sepalika\" \/>\n<meta property=\"og:description\" content=\"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\" \/>\n<meta property=\"article:published_time\" content=\"2017-06-27T03:00:13+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-19T10:52:14+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/visceral-manipulation.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jitendra Rathod\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/\",\"name\":\"GERD and Hiatal Hernia: Understand The Connection | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#primaryimage\"},\"datePublished\":\"2017-06-27T03:00:13+00:00\",\"dateModified\":\"2022-01-19T10:52:14+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\"},\"description\":\"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Hiatal Hernia: A Hidden Danger of GERD\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\",\"name\":\"Jitendra Rathod\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Jitendra Rathod\"},\"description\":\"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.\",\"sameAs\":[\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\"],\"url\":\"https:\/\/www.sepalika.com\/author\/jitendra\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"GERD and Hiatal Hernia: Understand The Connection | Sepalika","description":"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/","og_locale":"en_US","og_type":"article","og_title":"GERD and Hiatal Hernia: Understand The Connection | Sepalika","og_description":"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.","og_url":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs","article_published_time":"2017-06-27T03:00:13+00:00","article_modified_time":"2022-01-19T10:52:14+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/06\/visceral-manipulation.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Jitendra Rathod","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#webpage","url":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/","name":"GERD and Hiatal Hernia: Understand The Connection | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#primaryimage"},"datePublished":"2017-06-27T03:00:13+00:00","dateModified":"2022-01-19T10:52:14+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d"},"description":"The connection between hiatal hernia and GERD connection is very strong. Find out the symptoms, causes and treatment options.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/gerd\/gerd-and-hiatal-hernia\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Hiatal Hernia: A Hidden Danger of GERD"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d","name":"Jitendra Rathod","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Jitendra Rathod"},"description":"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.","sameAs":["https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs"],"url":"https:\/\/www.sepalika.com\/author\/jitendra\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12009"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/85"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12009"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12009\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19549"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12009"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12009"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12009"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}