{"id":12293,"date":"2017-07-12T08:34:51","date_gmt":"2017-07-12T08:34:51","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12293"},"modified":"2022-01-21T16:13:09","modified_gmt":"2022-01-21T10:43:09","slug":"diabetic-gastroparesis","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/","title":{"rendered":"Diabetic Gastroparesis Or Delayed Emptying Of Stomach: What You Need To Know"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Why_are_Diabetics_More_Susceptible_to_Gastroparesis\"><span class=\"toc_number toc_depth_1\">1<\/span> Why are Diabetics More Susceptible to Gastroparesis?<\/a><\/li><li><a href=\"#What_are_the_Symptoms_of_Diabetic_Gastroparesis\"><span class=\"toc_number toc_depth_1\">2<\/span> What are the Symptoms of Diabetic Gastroparesis?<\/a><\/li><li><a href=\"#Tests_to_Diagnose_Diabetic_Gastroparesis\"><span class=\"toc_number toc_depth_1\">3<\/span> Tests to Diagnose Diabetic Gastroparesis<\/a><ul><li><a href=\"#Upper_Gastrointestinal_GI_Endoscopy\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Upper Gastrointestinal (GI) Endoscopy<\/a><\/li><li><a href=\"#Upper_GI_Series\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Upper GI Series<\/a><\/li><li><a href=\"#Ultrasound\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Ultrasound<\/a><\/li><li><a href=\"#Gastric_Emptying_Scintigraphy\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Gastric Emptying Scintigraphy<\/a><\/li><li><a href=\"#SmartPill\"><span class=\"toc_number toc_depth_2\">3.5<\/span> SmartPill<\/a><\/li><li><a href=\"#Gastric_Emptying_Breath_Test\"><span class=\"toc_number toc_depth_2\">3.6<\/span> Gastric Emptying Breath Test<\/a><\/li><li><a href=\"#Blood_Tests\"><span class=\"toc_number toc_depth_2\">3.7<\/span> Blood Tests<\/a><\/li><\/ul><\/li><li><a href=\"#How_is_Diabetic_Gastroparesis_Treated\"><span class=\"toc_number toc_depth_1\">4<\/span> How is Diabetic Gastroparesis Treated?<\/a><\/li><li><a href=\"#The_Role_of_Medication_in_Diabetic_Gastroparesis\"><span class=\"toc_number toc_depth_1\">5<\/span> The Role of Medication in Diabetic Gastroparesis<\/a><\/li><li><a href=\"#Supplements_for_Diabetic_Gastroparesis\"><span class=\"toc_number toc_depth_1\">6<\/span> Supplements for Diabetic Gastroparesis<\/a><ul><li><a href=\"#Try_Adding_These_Supplements_to_Your_Diet\"><span class=\"toc_number toc_depth_2\">6.1<\/span> Try Adding These Supplements to Your Diet<\/a><\/li><\/ul><\/li><li><a href=\"#Diet_and_Other_Changes\"><span class=\"toc_number toc_depth_1\">7<\/span> Diet and Other Changes<\/a><\/li><li><a href=\"#Some_Other_Helpful_Tips_For_Diabetic_Gastroparesis_Include\"><span class=\"toc_number toc_depth_1\">8<\/span> Some Other Helpful Tips For Diabetic Gastroparesis Include<\/a><\/li><\/ul><\/div>\n<p>Gastroparesis, which is sometimes also known as delayed gastric emptying, is a disorder that slows down the movement of food ingested from the stomach to the small intestine. One-third of diabetics suffer from diabetic gastroparesis wherein uncontrolled sugar levels are the main cause behind the disease. It’s caused by damage or injury to the vagus nerve, which controls muscle contractions in the stomach causing food to break down and move through the GI (gastrointestinal) tract. The result – sluggish, delayed, impaired, or restricted movement of food from the stomach to small intestines.<\/p>\n<h2><span id=\"Why_are_Diabetics_More_Susceptible_to_Gastroparesis\">Why are Diabetics More Susceptible to Gastroparesis?<\/span><\/h2>\n<p>Diabetic gastroparesis is more common in patients with uncontrolled blood sugar levels. High blood glucose causes chemical changes in nerves and damages the blood vessels that carry oxygen and nutrients to the nerves. Like with all kinds of <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-neuropathy-treatment-sooth-nourish-nerves\/\">diabetic neuropathy<\/a>, high blood sugar levels can cause damage to the vagus nerve that controls the contraction of stomach muscles.<\/p>\n<p>The bad news &#8211; gastroparesis can worsen diabetes as it gets harder to manage blood glucose levels. When there is a delay in the emptying of the stomach, blood glucose levels tend to spike up.<\/p>\n<h2><span id=\"What_are_the_Symptoms_of_Diabetic_Gastroparesis\">What are the Symptoms of Diabetic Gastroparesis?<\/span><\/h2>\n<div id=\"attachment_19685\" style=\"width: 810px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/What-are-the-Symptoms-of-Diabetic-Gastroparesis.webp\"><img aria-describedby=\"caption-attachment-19685\" class=\"wp-image-19685 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/What-are-the-Symptoms-of-Diabetic-Gastroparesis.webp\" alt=\"Diabetic Gastroparesis\" width=\"800\" height=\"2000\" \/><\/a><p id=\"caption-attachment-19685\" class=\"wp-caption-text\">What are the Symptoms of Diabetic Gastroparesis?<\/p><\/div>\n<p>Gastroparesis symptoms in most patients show either a pattern of cycling with flare-ups, or daily occurrences persisting for years. The most common symptoms of gastroparesis are:<\/p>\n<ul>\n<li>Nausea<\/li>\n<li>Feeling very full after eating a small meal<\/li>\n<li>Vomiting undigested food—sometimes several hours after a meal<\/li>\n<li>Heartburn<\/li>\n<li>Acid Reflux<\/li>\n<li>Pain in the stomach<\/li>\n<li>Abdominal bloating<\/li>\n<li>Lack of appetite<\/li>\n<li>Weight loss<\/li>\n<li>Erratic blood glucose levels<\/li>\n<li>Spasms of the stomach wall<\/li>\n<\/ul>\n<p>Symptoms may range from mild or severe, depending on the extent of damage to the vagus nerve. Symptoms can worsen after eating oily and greasy foods, consuming large quantities of fiber-rich foods like raw fruits and vegetables, or drinking carbonated beverages.<\/p>\n<h2><span id=\"Tests_to_Diagnose_Diabetic_Gastroparesis\">Tests to Diagnose Diabetic Gastroparesis<\/span><\/h2>\n<p>Before we can discuss diabetic gastroparesis treatment, let’s take a look at a few tests used to diagnose diabetic gastroparesis. Most commonly used gastric emptying tests try to identify blockage or structural problems in the GI tract, while some could identify a nutritional disorder or underlying disease.<\/p>\n<h3><span id=\"Upper_Gastrointestinal_GI_Endoscopy\">Upper Gastrointestinal (GI) Endoscopy<\/span><\/h3>\n<p>An endoscope is fed down the esophagus and into the stomach and duodenum. The tiny camera mounted on the endoscope helps identify blockage or mass of undigested food.<\/p>\n<h3><span id=\"Upper_GI_Series\">Upper GI Series<\/span><\/h3>\n<p>The patient is given a barium solution to drink, which makes signs of gastroparesis show up more clearly using X-ray. Gastroparesis is likely if the x ray shows food in the stomach after fasting.<\/p>\n<h3><span id=\"Ultrasound\">Ultrasound<\/span><\/h3>\n<p>Ultrasound is used to study the GI tract so your doctor can rule out gallbladder disease and pancreatitis as the cause for your digestive distress.<\/p>\n<h3><span id=\"Gastric_Emptying_Scintigraphy\">Gastric Emptying Scintigraphy<\/span><\/h3>\n<p>Patient is asked to eat a bland meal containing a small amount of radioactive material. An external camera is then used to scan the abdomen to see where the radioactive material is located every hour for four hours to measure the rate of gastric emptying. If more than 10 percent of the meal is still in the stomach at 4 hours, the diagnosis of gastroparesis is confirmed.<\/p>\n<h3><span id=\"SmartPill\">SmartPill<\/span><\/h3>\n<p>This is a small electronic device in capsule form which is swallowed. As it moves through the entire digestive tract, it sends and records information to a receiver worn by the patient. Thus, it gives a detailed record of the rate at which food travels through each part of the digestive tract.<\/p>\n<h3><span id=\"Gastric_Emptying_Breath_Test\">Gastric Emptying Breath Test<\/span><\/h3>\n<p>The patient is given a special test meal containing a special type of carbon. Then, breath samples taken over a period of several hours help measure the rate of gastric emptying.<\/p>\n<h3><span id=\"Blood_Tests\">Blood Tests<\/span><\/h3>\n<p>Hypothyroidism is often an ignored cause of <a href=\"https:\/\/www.sepalika.com\/constipation\/constipation-could-it-be-hypothyroidism\/\">poor stomach motility<\/a>, so ask your doctor for a test to measure the right things – FT, FT4 and take action if needed to improve under-active thyroid function. Your doctor may also order laboratory tests to check blood counts and to measure chemical and electrolyte levels.<\/p>\n<p><strong>Stomach or Small Intestine<\/strong> <strong>Biopsy:<\/strong> A small sample of tissue is taken from the stomach or small intestine to confirm the diagnosis of gastroparesis.<\/p>\n<h2><span id=\"How_is_Diabetic_Gastroparesis_Treated\">How is Diabetic Gastroparesis Treated?<\/span><\/h2>\n<p>There is no cure for gastroparesis, which is why diabetic <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC2920593\/\" target=\"_blank\" rel=\"noopener noreferrer\">gastroparesis treatment<\/a> focuses on how to better manage this condition and its symptoms. Making strategic changes to eating habits can sometimes help control the severity of gastroparesis symptoms. Here are a few simple tips that go a long way towards improving gastroparesis symptoms.<\/p>\n<ul>\n<li>Eat small portions of food at a time<\/li>\n<li>Chew your food well; digestion begins in your mouth<\/li>\n<li>Don’t lie down immediately after a meal<\/li>\n<li>Go for a gentle walk after your meal<\/li>\n<li>Eat only natural high-quality fats, like grass-fed butter, coconut oil and extra virgin olive oil<\/li>\n<li>If you like to add fiber-rich vegetables to your diet, eat only smaller portions as these are harder to digest<\/li>\n<li>Add more probiotics to your diet, or eat more of fermented foods like kimchi and sauerkraut<\/li>\n<\/ul>\n<p>Controlling your blood sugar is the key for treating diabetic gastroparesis. Discuss a better insulin therapy routine with your doctor and make sure to check your sugar levels more often. The idea is to manage your blood glucose levels as well as possible.<\/p>\n<h2><span id=\"The_Role_of_Medication_in_Diabetic_Gastroparesis\">The Role of Medication in Diabetic Gastroparesis<\/span><\/h2>\n<p>You must be thinking &#8212; why haven’t we listed out a bunch of allopathy medicines as the best diabetic gastroparesis treatment? Most doctors rely on conventional prescription medications to treat gastroparesis. Commonly, a combination of Metoclopramide (Reglan) and Erythromycin is prescribed. However, allopathic meds only provide symptomatic relief.<\/p>\n<p>While allopathic medicines can provide relief from symptoms, the real cause behind diabetic gastroparesis is often damage to vagus nerve caused by high blood sugar. This is why; we highly recommend early intervention to protect the <a href=\"https:\/\/www.facebook.com\/sepalikahealth\/videos\/1160846964013915\/\" target=\"_blank\" rel=\"noopener noreferrer\">vagus nerve<\/a>. In case a patient is diagnosed with gastroparesis, there are several holistic diabetic gastroparesis treatment ideas that can offer relief, without the unwarranted side-effects that often accompany allopathic medication. There are many ways to naturally stimulate the vagus nerve. Stimulating the vagus nerve increases the release of histamine in stomach cells, which helps with the release of stomach acid. Try:<\/p>\n<ul>\n<li>Deep breathing techniques<\/li>\n<li>Gargling<\/li>\n<li>Chanting or Singing works the muscles in the back of the throat to activate the vagus<\/li>\n<li>Wash your face with cold water<\/li>\n<li>Yoga increases<strong> vagus nerve activity and your parasympathetic system in general<\/strong><\/li>\n<li>Walk barefoot on the ground<\/li>\n<li>Balancing the gut microbiome, as the presence of healthy bacteria in the gut creates a positive feedback loop through the vagus nerve, increasing its tone.<\/li>\n<\/ul>\n<h2><span id=\"Supplements_for_Diabetic_Gastroparesis\">Supplements for Diabetic Gastroparesis<\/span><\/h2>\n<div id=\"attachment_19687\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Supplements-for-Diabetic-Gastroparesis.webp\"><img aria-describedby=\"caption-attachment-19687\" class=\"wp-image-19687 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Supplements-for-Diabetic-Gastroparesis.webp\" alt=\"Diabetic Gastroparesis\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19687\" class=\"wp-caption-text\">Supplements for Diabetic Gastroparesis<\/p><\/div>\n<p>While diabetic gastroparesis treatment may vary from patient to patient, depending on the degree or severity of symptoms, adding a few supplements to your diet will show definite improvements. Given that diabetic gastroparesis is an affliction that affects digestion, your doctor may advise you to change your diet to help reduce symptoms. Be aware that a diet which comes with limitations and restrictions, thanks to gastroparesis, may lead to crucial vitamins and minerals deficiencies. Avoiding certain food groups can lead to lack of nutrients, while at the same time inefficient digestion results in the nutrient loss.<\/p>\n<p>Also, conventional treatment of diabetic gastroparesis involves the use of antibiotics, which can aggravate further health problems as these cannot differentiate between good and bad bacteria, wiping out gut-healthy bacteria that are crucial for digestion and absorption of food. Some of the side effects of erythromycin include antibiotic-resistance, neurological impairment, liver problems, skin rashes, hives, vertigo, pancreatitis, and even hallucinations.<\/p>\n<h3><span id=\"Try_Adding_These_Supplements_to_Your_Diet\">Try Adding These Supplements to Your Diet<\/span><\/h3>\n<ol>\n<li><strong>Magnesium citrate<\/strong> &#8211; For the regular functioning of the nervous system, muscles and the cardiovascular system, <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/magnesium-and-diabetes-type-2\/\">magnesium<\/a> is absolutely essential. As it’s also a mild laxative, it facilitates movement of food along the GI tract.<\/li>\n<li><strong>Probiotics<\/strong> – Balancing the gut microbiome by supplementing with probiotics is extremely useful in diabetic gastroparesis. These gut-friendly bacteria help digest food and prevent infections caused by undigested food sitting in the stomach for too long.<\/li>\n<li><strong>Vitamin D<\/strong> &#8211; Gastroparesis is one of many diseases that often lead to low vitamin D levels. Vitamin D is needed for a reliable immune system. Furthermore, as vitamin D is crucial in absorbing calcium, a lack can lead to poor bone and skin health.<\/li>\n<li><strong>Ginger<\/strong> – Ginger root improves <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/18403946\" target=\"_blank\" rel=\"noopener noreferrer\">gastric emptying<\/a> and also helps combat gastroparesis symptoms such as nausea, vomiting and stomach pain.<\/li>\n<li><strong>Vitamin B12<\/strong> – It boosts the central nervous system. <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/vitamin-b12-and-diabetes-connection\/\">Vitamin B12<\/a> is found in animal products, and many diabetics may be deficient in this important vitamin (diabetes medications often interferes with B12 assimilation).<\/li>\n<\/ol>\n<h2><span id=\"Diet_and_Other_Changes\">Diet and Other Changes<\/span><\/h2>\n<div id=\"attachment_19688\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diet-and-Other-Changes.webp\"><img aria-describedby=\"caption-attachment-19688\" class=\"wp-image-19688 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diet-and-Other-Changes.webp\" alt=\"Diabetic Gastroparesis\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19688\" class=\"wp-caption-text\">Diet and Other Changes<\/p><\/div>\n<p>If you have gastroparesis, your food is being absorbed more slowly and at unpredictable times. To better manage blood glucose, you may need to try the following:<\/p>\n<ul>\n<li>Increase the number of times you take insulin<\/li>\n<li>Take your insulin after you eat your meal, instead of taking it before<\/li>\n<li>Check your blood glucose levels frequently after you eat and administer insulin whenever necessary<\/li>\n<\/ul>\n<p>Add gut-healing foods to your diabetic gastroparesis diet. <a href=\"https:\/\/www.sepalika.com\/osteoporosis\/should-the-fear-of-fractures-prevent-you-from-taking-prescription-medications-for-osteoporosis\/\">Bone Broth<\/a> is very nutritious and healing for your gut, as it contains calcium, magnesium, phosphorus, sodium, potassium, glucosamine, chondroitin, and glycine to ease digestion and soothe inflammation. We also recommend a diet rich in Lacto-fermented foods such as sauerkraut, kimchi, black garlic, and kefir.<\/p>\n<h2><span id=\"Some_Other_Helpful_Tips_For_Diabetic_Gastroparesis_Include\">Some Other Helpful Tips For Diabetic Gastroparesis Include<\/span><\/h2>\n<ul>\n<li>Be consistent with the amount of carbohydrates you eat with each meal, as it impacts your blood -glucose levels.<\/li>\n<li>Pay attention to your daily symptom pattern. Go for an easy walk if symptoms allow.<\/li>\n<li>Remember, regular exercise helps to improve <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/top-5-yoga-asanas-for-diabetes\/\" data-wplink-edit=\"true\">blood –glucose control<\/a>.<\/li>\n<li>Keep a record of blood -glucose levels and bothersome foods.<\/li>\n<li>Regular dental checkups are a must. Stomach acid is damaging to teeth if vomiting, regurgitation or acid reflux is a regular problem.<\/li>\n<li>Review all medications with your doctor, especially any over-the-counter purchases. Many medications can slow down digestion.<\/li>\n<\/ul>\n<p>Start slowly and experiment until you get a combination that works best for you and your own individual needs. These natural treatments can improve your digestion and return you your healthier self.<\/p>\n<h1><\/h1>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Why are Diabetics More Susceptible to Gastroparesis?2 What are the Symptoms of Diabetic Gastroparesis?3 Tests to Diagnose Diabetic Gastroparesis3.1 Upper Gastrointestinal (GI) Endoscopy3.2 Upper GI Series3.3 Ultrasound3.4 Gastric Emptying Scintigraphy3.5 SmartPill3.6 Gastric Emptying Breath Test3.7 Blood Tests4 How is Diabetic Gastroparesis Treated?5 The Role of Medication in Diabetic Gastroparesis6 Supplements for Diabetic [&hellip;]<\/p>\n","protected":false},"author":24,"featured_media":19689,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[123,112],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika<\/title>\n<meta name=\"description\" content=\"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika\" \/>\n<meta property=\"og:description\" content=\"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-07-12T08:34:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-21T10:43:09+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp\",\"width\":706,\"height\":340,\"caption\":\"Diabetic Gastroparesis\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/\",\"name\":\"Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#primaryimage\"},\"datePublished\":\"2017-07-12T08:34:51+00:00\",\"dateModified\":\"2022-01-21T10:43:09+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Diabetic Gastroparesis Or Delayed Emptying Of Stomach: What You Need To Know\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika","description":"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/","og_locale":"en_US","og_type":"article","og_title":"Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika","og_description":"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.","og_url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-07-12T08:34:51+00:00","article_modified_time":"2022-01-21T10:43:09+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Diabetic-Gastroparesis.webp","width":706,"height":340,"caption":"Diabetic Gastroparesis"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#webpage","url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/","name":"Diabetic Gastroparesis Or Delayed Emptying Of Stomach | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#primaryimage"},"datePublished":"2017-07-12T08:34:51+00:00","dateModified":"2022-01-21T10:43:09+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"A holistic approach towards diabetic gastroparesis treatment and diet changes can greatly help alleviate its symptoms.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-gastroparesis\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Diabetic Gastroparesis Or Delayed Emptying Of Stomach: What You Need To Know"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12293"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12293"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12293\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19689"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12293"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12293"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}