{"id":12408,"date":"2017-07-18T20:00:32","date_gmt":"2017-07-19T03:00:32","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12408"},"modified":"2022-01-22T17:14:17","modified_gmt":"2022-01-22T11:44:17","slug":"diabetic-socks-ultimate-guide","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/","title":{"rendered":"The Ultimate Guide To Diabetic Socks"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#You_Can_Lose_Your_Foot\"><span class=\"toc_number toc_depth_1\">1<\/span> You Can Lose Your Foot!<\/a><\/li><li><a href=\"#Diabetic_Neuropathy_How_Does_It_Manifest\"><span class=\"toc_number toc_depth_1\">2<\/span> Diabetic Neuropathy – How Does It Manifest?<\/a><ul><li><a href=\"#Signs_and_symptoms_of_peripheral_neuropathy_include\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Signs and symptoms of peripheral neuropathy include:<\/a><\/li><\/ul><\/li><li><a href=\"#What_are_Diabetic_Socks\"><span class=\"toc_number toc_depth_1\">3<\/span> What are Diabetic Socks?<\/a><\/li><li><a href=\"#What_Do_Diabetic_Socks_Do\"><span class=\"toc_number toc_depth_1\">4<\/span> What Do Diabetic Socks Do?<\/a><\/li><li><a href=\"#Features_of_Diabetic_Socks\"><span class=\"toc_number toc_depth_1\">5<\/span> Features of Diabetic Socks<\/a><\/li><li><a href=\"#When_Should_You_Wear_These_Socks\"><span class=\"toc_number toc_depth_1\">6<\/span> When Should You Wear These Socks?<\/a><\/li><li><a href=\"#What_are_Compression_Socks\"><span class=\"toc_number toc_depth_1\">7<\/span> What are Compression Socks?<\/a><\/li><li><a href=\"#Are_Diabetic_Socks_For_You\"><span class=\"toc_number toc_depth_1\">8<\/span> Are Diabetic Socks For You?<\/a><\/li><li><a href=\"#Types_of_Diabetic_and_Compression_Socks\"><span class=\"toc_number toc_depth_1\">9<\/span> Types of Diabetic and Compression Socks<\/a><ul><li><a href=\"#Enter_Celliant\"><span class=\"toc_number toc_depth_2\">9.1<\/span> Enter Celliant<\/a><\/li><li><a href=\"#Silver_Socks\"><span class=\"toc_number toc_depth_2\">9.2<\/span> Silver Socks<\/a><\/li><li><a href=\"#Teflon-Reinforced_Yarn\"><span class=\"toc_number toc_depth_2\">9.3<\/span> Teflon-Reinforced Yarn<\/a><\/li><li><a href=\"#Smart_Socks\"><span class=\"toc_number toc_depth_2\">9.4<\/span> Smart Socks<\/a><\/li><\/ul><\/li><li><a href=\"#Tips_to_Help_You_Choose_the_Right_Diabetic_Socks\"><span class=\"toc_number toc_depth_1\">10<\/span> Tips to Help You Choose the Right Diabetic Socks<\/a><\/li><li><a href=\"#Taking_Care_of_Your_Diabetic_Socks\"><span class=\"toc_number toc_depth_1\">11<\/span> Taking Care of Your Diabetic Socks<\/a><\/li><li><a href=\"#Parting_Words\"><span class=\"toc_number toc_depth_1\">12<\/span> Parting Words<\/a><\/li><\/ul><\/div>\n<p>As a diabetic, you should be aware of the damage your condition can do to your legs and feet. If your diabetes isn’t properly controlled, your nerves can get damaged as a result of high blood sugar, a condition called<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-neuropathy-treatment-sooth-nourish-nerves\/\"> diabetic neuropathy<\/a>. The condition starts with a loss of sensation in the legs and feet. This can further develop into foot ulcers. Advanced ulceration can even result in an amputation. But you can avoid such a terrible fate for your feet if you use protective foot care devices like diabetic socks.<\/p>\n<h2><span id=\"You_Can_Lose_Your_Foot\">You Can Lose Your Foot!<\/span><\/h2>\n<p>A loss of sensation to the legs and the feet results in reduced blood flow to these parts. As a result, you become vulnerable to numerous infections. Pain is our body’s primary response towards many stimuli. If we get hurt, pain is a signal that something is wrong with a part of our body and it needs care. If you cannot feel pain due to nerve damage, any injury, whether large or small, will go undetected and may develop into an ulcer or an infection.<\/p>\n<p>Regardless of the type of diabetes you have, research shows that the risk of ulceration increases by two to four times with age. As a result, the chances of you getting a foot ulcer during your lifetime are 1 in 4, or 25%! More often than not, foot ulcers lead to amputations, which account for two-thirds of <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/16291066\" target=\"_blank\" rel=\"noopener noreferrer\">all non-traumatic amputations<\/a> in the world. If you develop an ulcer there is a high chance of you losing your foot. The good news is foot amputations are <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/17934144\" target=\"_blank\" rel=\"noopener noreferrer\">completely preventable<\/a> through simple interventions.<\/p>\n<h2><span id=\"Diabetic_Neuropathy_How_Does_It_Manifest\">Diabetic Neuropathy – How Does It Manifest?<\/span><\/h2>\n<p>Essentially four types of neuropathies affect diabetics: Peripheral neuropathy, proximal (radiculoplexus) neuropathy, autonomic neuropathy and mononeuropathy (or, focal neuropathy). Out of these, peripheral neuropathy is the most common one. It often affects the legs and feet first.<\/p>\n<h3><span id=\"Signs_and_symptoms_of_peripheral_neuropathy_include\">Signs and symptoms of peripheral neuropathy include:<\/span><\/h3>\n<ul>\n<li>Numbness or reduced ability to feel pain or temperature differences<\/li>\n<li>Burning (or tingling) sensation<\/li>\n<li>Increased sensitivity to touch<\/li>\n<li>Sharp pains<\/li>\n<li>Cramps<\/li>\n<li>Muscle weakness<\/li>\n<li>Difficulty in balancing and loss of coordination<\/li>\n<li>Foot problems like ulcers, infections, deformities and pain in the bones and joints.<\/li>\n<\/ul>\n<p>Proximal neuropathy is the second most common type of neuropathy in diabetics. It causes muscle weakness. Specifically, it affects muscles of the upper part of your legs, hips and buttocks. More often than not, a shooting pain, also known as sciatica, accompanies this kind of neuropathy. Autonomic and focal neuropathies aren’t very common among diabetics.<\/p>\n<p>The symptoms of neuropathy are worsened by poor circulation of blood to your legs and feet that can cause swelling.<\/p>\n<h2><span id=\"What_are_Diabetic_Socks\">What are Diabetic Socks?<\/span><\/h2>\n<p>Diabetic socks are close-fitting socks made up of a mix of cotton, acrylic, merino wool, bamboo and spandex. These socks provide support and mild compression to the legs and feet. Some brands also have bamboo fibers for their enhanced moisture-wicking and cooling properties. They are seamless and have a non-binding top. Diabetic socks come in various lengths – from crew to above-calf and above-knee. Since diabetics are at a risk of injuries and infections due to decrease in blood circulation and diabetic neuropathy, diabetic socks can be of help in protecting their legs and feet.<\/p>\n<h2><span id=\"What_Do_Diabetic_Socks_Do\">What Do Diabetic Socks Do?<\/span><\/h2>\n<ul>\n<li>Diabetic socks are designed to cover your legs and feet and protect them from external damage.<\/li>\n<li>They reduce pressure in the lower leg and foot and minimize irritation.<\/li>\n<li>Due to their moisture-wicking abilities, they minimize accumulation of moisture, prevent blistering and offer comfort. They also help keep the feet dry and reduce the risks of fungal infections.<\/li>\n<li>In contrast to regular socks, diabetic socks aren’t made of elastic and thus are seamless.<\/li>\n<li>They do not form lumps even if worn for long. Also, they fit snugly to avoid lumping.<\/li>\n<li>Because they are non-elastic, diabetic socks prevent constriction. Their seamless design minimizes friction and pressure points to avoid discomfort and pain.<\/li>\n<li>They are also slightly cushioned to offer support to the soles.<\/li>\n<\/ul>\n<p>While regular diabetic socks offer little or no compression, special socks called “compression socks” provide all the benefits of diabetic socks along with providing compression to reduce swelling of legs and feet due to edema.<\/p>\n<h2><span id=\"Features_of_Diabetic_Socks\">Features of Diabetic Socks<\/span><\/h2>\n<ul>\n<li>Diabetic socks are less constricting and resistant to wrinkling. This minimizes abrasion of the material on the skin.<\/li>\n<li>Expensive diabetic socks have silver or copper threads that actively fight microbial infections and foot odor.<\/li>\n<li>Diabetic socks come with differing levels of padding. You can choose the thickness of the socks and padding depending on your preferences. If you are an active individual and like to remain on your feet for long, socks with adequate heel padding can offer long-lasting support and comfort to you. For individuals who love to play sports, special socks with padding near the toes and heels are useful. Padding could either be made with the same material as the socks by simply increasing the thickness of the material, or it could be made of a special gel.<\/li>\n<li>The length of the socks will also depend on your choice. Both over-the-calf and over-the-knee designs are popular with individuals having circulation problems. These days, you can also incorporate diabetic socks into your day-to-day lifestyle, such as wearing them to office, as they are available in different colors and patterns.<\/li>\n<\/ul>\n<h2><span id=\"When_Should_You_Wear_These_Socks\">When Should You Wear These Socks?<\/span><\/h2>\n<p>Preferably immediately after you get up in the morning till you go back to sleep. The more you keep your feet and legs covered, the better they are protected from harm. It is recommended to change your socks during the day, clean your feet and replace them with a fresh pair of socks.<\/p>\n<p>If you are a frequent air traveler, diabetic socks are a must for you. As air travel involves sitting at one place for too long, it <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/traveling-with-diabetes\/\">can be very difficult for diabetics<\/a>. Your socks will protect you from circulatory problems that get magnified while sitting at the same place for hours at length. These socks will also help in dealing with the changes in pressure during boarding and flying.<\/p>\n<h2><span id=\"What_are_Compression_Socks\">What are Compression Socks?<\/span><\/h2>\n<p>As the name suggests, compression socks exert pressure around your legs to increase blood pressure. They avoid blood fluid seeping outside of the blood vessels and causing swelling. Compression socks are tight and binding. These socks for diabetics are usually made with pressure gradients, starting from the ankle upwards. The greatest degree of compression is applied at the ankle and level of compression decreases with height. These are usually above-knee length socks and are made under strict medical and technical specifications.<\/p>\n<p>A word of caution here. All diabetics DO NOT need compression socks.<\/p>\n<p>Most diabetics are at an increased risk of developing what is known as Deep Vein Thrombosis (DVT), a condition in which reduced blood flow to the legs and feet and other factors cause the development of a blood clot (called thrombus). Wearing graduated compression socks can greatly help you to prevent the <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4081237\/\" target=\"_blank\" rel=\"noopener noreferrer\">risk of DVT <\/a>and its complications.<\/p>\n<p>But in diabetics who suffer from peripheral arterial disease (PAD), compression socks can actually exacerbate their condition. In PAD, the arteries of the legs and feet are partially blocked. This leads to reduced blood flow in the legs and feet. Now if you were to wear compression socks, you would only make the condition worse as the compression from all sides would further restrict the flow of oxygenated blood in the legs, leading to a future risk of amputation.<\/p>\n<p>However, you should NEVER wear compression socks unless specifically advised by your physician.<\/p>\n<h2><span id=\"Are_Diabetic_Socks_For_You\">Are Diabetic Socks For You?<\/span><\/h2>\n<div id=\"attachment_19775\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Are-Diabetic-Socks-For-You.webp\"><img aria-describedby=\"caption-attachment-19775\" class=\"wp-image-19775 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Are-Diabetic-Socks-For-You.webp\" alt=\"Are Diabetic Socks For You?\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19775\" class=\"wp-caption-text\">Are Diabetic Socks For You?<\/p><\/div>\n<p>Not every diabetic requires diabetic socks. If you have symptoms of neuropathy only then do you need to wear diabetic socks and only after consulting your physician. If your diabetes is well controlled with a healthy diet and a disciplined exercise regimen, you might not suffer from neuropathies, and so you won’t really need diabetic socks.<\/p>\n<p>Diabetic socks are excellent for pregnant women who have <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/what-is-gestational-diabetes\/\">gestational diabetes<\/a>. These socks will provide comfort and support to swollen feet and will also minimize the risks of DVT.<\/p>\n<p>You may, of course need these socks while you travel, because sitting at one place for hours may make your feet and legs prone to swelling.<\/p>\n<h2><span id=\"Types_of_Diabetic_and_Compression_Socks\">Types of Diabetic and Compression Socks<\/span><\/h2>\n<p>Diabetic sock manufacturing technology has come a long way from the old all-cotton socks that simply covered the legs and feet of diabetics and protected them from external injuries. Newer materials are now being used in diabetic socks that not only provide comfort and protection, but also help in relieving pain and promote quicker healing of wounds.<\/p>\n<h3><span id=\"Enter_Celliant\">Enter Celliant<\/span><\/h3>\n<p>A new synthetic yarn that turns body heat into infrared energy, which is then reabsorbed by the body. Infrared light has shown to boost the flow of blood, enhance cell performance and regeneration, regulate temperature and improve sleep quality, among other benefits. Reflexa Diabetic Socks use celliant technology in their socks.<\/p>\n<h3><span id=\"Silver_Socks\">Silver Socks<\/span><\/h3>\n<p>These contain threads of pure silver along with other yarns. These socks minimize heat loss and keep feet warm. They also fight bacterial infections.<\/p>\n<h3><span id=\"Teflon-Reinforced_Yarn\">Teflon-Reinforced Yarn<\/span><\/h3>\n<p>Diabetic socks are also available with a Teflon-reinforced yarn that is used in the toe and heel areas. This reduces friction against the skin and also makes the socks more durable.<\/p>\n<h3><span id=\"Smart_Socks\">Smart Socks<\/span><\/h3>\n<p>The latest development in diabetic socks is the” which utilizes fiber optic technology. These socks incorporate pressure, moisture and temperature sensors inside the socks and provide real-time feedback to the wearer on these parameters via a mobile app. For instance, these readings make the wearer aware of fluctuations in temperature that may indicate an impending infection. Pressure fluctuations will tell the wearer if the foot is about to get swollen. With real time feedback, you can make the necessary adjustments to avoid further harm to the foot.<\/p>\n<h2><span id=\"Tips_to_Help_You_Choose_the_Right_Diabetic_Socks\">Tips to Help You Choose the Right Diabetic Socks<\/span><\/h2>\n<p>As mentioned earlier, diabetic socks come in all colors and patterns. However, we recommend traditional white-colored socks as they make it easier to spot an injury. With diabetics with advanced nerve damage, the white color makes it easy to detect any discharge from wounds.<\/p>\n<p>If you do not need compression but still need some amount of pressure to be applied on your legs and feet, choose longer socks that cut either just above the knee or over the calf. They will keep your legs and feet warm and also help minimize swelling in the legs by improving circulation.<\/p>\n<p>Just because you have found the perfect diabetic socks doesn’t mean that you overstock them. Socks tend to lose their natural elasticity and other properties if not used for long. We recommend to start off with a single pair. Try them out for a few days, and see how you feel and ease into them. If you find them useful, you can always buy a couple of extra pairs for daily use.<\/p>\n<h2><span id=\"Taking_Care_of_Your_Diabetic_Socks\">Taking Care of Your Diabetic Socks<\/span><\/h2>\n<p>You need to wash your socks as soon as possible after removing them. This helps in preventing bacterial growth from any discharge from an existing wound or blister. Use warm water and a mild disinfectant along with a gentle detergent. Wash them either with hand or in a gentle tumble wash.<\/p>\n<p>Your diabetic socks will last as long as you handle them delicately and with care. Do not overuse your diabetic socks. Remember these aren’t regular socks. If they show signs of wear and tear, is time to discard them and get a new pair as won’t be able to perform their key function of protecting your legs and feet. It. With regular wear, you can expect a good quality pair of diabetic socks to last for around six months. Pilling on any other cloth is okay, but not on your diabetic socks as it may lead to friction and blisters. If you observe pilling, you may use a fabric shaver to remove it.<\/p>\n<h2><span id=\"Parting_Words\">Parting Words<\/span><\/h2>\n<p>If diabetes isn’t controlled properly, it often leads to peripheral neuropathy and reduced blood circulation in the legs and feet. A loss of sensation in the legs and feet may hamper your ability to detect injuries. Also reduced blood circulation and other problems make your legs and feet vulnerable to blisters, wounds, bruises and ulcers.<\/p>\n<p>Diabetes socks help prevent these problems by offering protection and comfort due to their seamless form and breathable, moisture-wicking material. For diabetics at risk of developing DVT, compression socks are available that provide mild compression to regulate blood circulation and provide relief from painful and uncomfortable conditions.<\/p>\n<p>The best way to not need diabetic socks is to control your condition so that future health complications do not occur. Type 2 diabetics, specially, should aim to reverse their condition by following a well-drawn program. Along with diet, exercise and healthy lifestyle choices, stress management techniques like <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/stress-meditation-type-2-diabetes\/\" data-wplink-edit=\"true\">meditation<\/a> help a lot. <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/supplements-for-type-2-diabetes\/\">Dietary supplements<\/a> can also help in controlling blood sugar naturally and reduce the burden of side effects of diabetes medications.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 You Can Lose Your Foot!2 Diabetic Neuropathy – How Does It Manifest?2.1 Signs and symptoms of peripheral neuropathy include:3 What are Diabetic Socks?4 What Do Diabetic Socks Do?5 Features of Diabetic Socks6 When Should You Wear These Socks?7 What are Compression Socks?8 Are Diabetic Socks For You?9 Types of Diabetic and Compression [&hellip;]<\/p>\n","protected":false},"author":85,"featured_media":19776,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[116,112],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diabetic Socks: The Ultimate Guide | Sepalika<\/title>\n<meta name=\"description\" content=\"Since diabetics are at a risk of injuries and infections due to decrease in blood circulation and diabetic neuropathy, diabetic socks can be of help in protecting their legs and feet.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Ultimate Guide To Diabetic Socks\" \/>\n<meta property=\"og:description\" content=\"Diabetic socks can be of great help in protecting legs and feet in case of diabetes.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\" \/>\n<meta property=\"article:published_time\" content=\"2017-07-19T03:00:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-22T11:44:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Pressure-Socks-2nd-image.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jitendra Rathod\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/\",\"name\":\"Diabetic Socks: The Ultimate Guide | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#primaryimage\"},\"datePublished\":\"2017-07-19T03:00:32+00:00\",\"dateModified\":\"2022-01-22T11:44:17+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\"},\"description\":\"Since diabetics are at a risk of injuries and infections due to decrease in blood circulation and diabetic neuropathy, diabetic socks can be of help in protecting their legs and feet.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Ultimate Guide To Diabetic Socks\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d\",\"name\":\"Jitendra Rathod\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Jitendra Rathod\"},\"description\":\"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.\",\"sameAs\":[\"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs\"],\"url\":\"https:\/\/www.sepalika.com\/author\/jitendra\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diabetic Socks: The Ultimate Guide | Sepalika","description":"Since diabetics are at a risk of injuries and infections due to decrease in blood circulation and diabetic neuropathy, diabetic socks can be of help in protecting their legs and feet.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/","og_locale":"en_US","og_type":"article","og_title":"The Ultimate Guide To Diabetic Socks","og_description":"Diabetic socks can be of great help in protecting legs and feet in case of diabetes.","og_url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs","article_published_time":"2017-07-19T03:00:32+00:00","article_modified_time":"2022-01-22T11:44:17+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/07\/Pressure-Socks-2nd-image.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Jitendra Rathod","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#webpage","url":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/","name":"Diabetic Socks: The Ultimate Guide | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#primaryimage"},"datePublished":"2017-07-19T03:00:32+00:00","dateModified":"2022-01-22T11:44:17+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d"},"description":"Since diabetics are at a risk of injuries and infections due to decrease in blood circulation and diabetic neuropathy, diabetic socks can be of help in protecting their legs and feet.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-socks-ultimate-guide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Ultimate Guide To Diabetic Socks"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/fec461b310e8bff8a4a3f79afc4de45d","name":"Jitendra Rathod","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Jitendra Rathod"},"description":"Jitendra is a microbiologist and a passionate student of the human body. He is a firm believer in the power of alternative and holistic medicine. He believes nature holds the key to restore us back to health and balance.","sameAs":["https:\/\/www.facebook.com\/jitendra.rathod.319?ref=br_rs"],"url":"https:\/\/www.sepalika.com\/author\/jitendra\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12408"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/85"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12408"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12408\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/19776"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12408"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12408"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12408"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}