{"id":12677,"date":"2017-08-01T20:01:32","date_gmt":"2017-08-01T20:01:32","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=12677"},"modified":"2022-01-25T12:57:16","modified_gmt":"2022-01-25T07:27:16","slug":"healthy-but-delicious-foods","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/","title":{"rendered":"6 Food Items that You Love and Are Actually Good for You"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Heres_A_List_Of_Foods_That_You_Love_to_Eat_And_Are_Actually_Good_For_You\"><span class=\"toc_number toc_depth_1\">1<\/span> Here’s A List Of Foods That You Love to Eat And Are Actually Good For You.<\/a><ul><li><a href=\"#Cheese\"><span class=\"toc_number toc_depth_2\">1.1<\/span> Cheese<\/a><\/li><li><a href=\"#Dark_Chocolate\"><span class=\"toc_number toc_depth_2\">1.2<\/span> Dark Chocolate<\/a><\/li><li><a href=\"#Red_Wine\"><span class=\"toc_number toc_depth_2\">1.3<\/span> Red Wine<\/a><\/li><li><a href=\"#Egg_Yolk\"><span class=\"toc_number toc_depth_2\">1.4<\/span> Egg Yolk<\/a><\/li><li><a href=\"#Red_Meat\"><span class=\"toc_number toc_depth_2\">1.5<\/span> Red Meat<\/a><\/li><li><a href=\"#Whole-Grain_Bread\"><span class=\"toc_number toc_depth_2\">1.6<\/span> Whole-Grain Bread<\/a><\/li><\/ul><\/li><li><a href=\"#Final_Takeaway\"><span class=\"toc_number toc_depth_1\">2<\/span> Final Takeaway<\/a><\/li><\/ul><\/div>\n<p>Whether you are trying to make healthier food choices to help manage Diabetes Type 2 or are giving ‘Clean Eating’ a go to lose that belly pudge, chances are that you’ve been handed a list of food items to avoid. And it may seem like almost everything you love eating is bad for your health! Or is it?<\/p>\n<p>We live in a world where eating healthy has become rather confusing. Diet trends come and go faster than most of us can keep track, and so many foods we’ve grown up thinking to be ‘healthy’ have been labelled as ‘bad-for-you’ by so called diet-gurus. To make matters worse, there will be another set of ‘experts’ who will tell you the same foods are actually good for you! From red meat to dairy to egg yolks and fiber-rich bread &#8212;- do these foods really deserve the bad rep they get?<\/p>\n<p>Yes, diet trends aren’t just annoying; they can also be anxiety-inducing when you simply can’t understand if the food items you love are actually good for you or really bad for you.  Don’t worry; we’ve got your back!<\/p>\n<h2><span id=\"Heres_A_List_Of_Foods_That_You_Love_to_Eat_And_Are_Actually_Good_For_You\">Here’s A List Of Foods That You Love to Eat And Are Actually Good For You.<\/span><\/h2>\n<h3><span id=\"Cheese\">Cheese<\/span><\/h3>\n<div id=\"attachment_19864\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Cheese.webp\"><img aria-describedby=\"caption-attachment-19864\" class=\"size-full wp-image-19864\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Cheese.webp\" alt=\"healthy but delicious foods - Cheese\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19864\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Cheese<\/p><\/div>\n<p>A lot of us wrongly assume that eating cheese makes us fat. Yes, cheese (and most dairy, for that matter) is high in saturated fats, and saturated fats have been linked to weight gain and increased risk for diabetes and cardiovascular disease. But not all saturated fats are created equal. In fact, a <a href=\"http:\/\/ajcn.nutrition.org\/content\/96\/2\/382.short\">study<\/a> published in American Journal of Clinical Nutrition in 2012 found that an inverse association of cheese intake and combined fermented dairy product intake with diabetes.<\/p>\n<p>Cheese is a good source of calcium and protein, while being rich in vitamins A and B12, along with zinc, phosphorus, and riboflavin. Studies from Finland as well as India have found that cheese is good for dental health. Cheese is an integral part of the Mediterranean Diet that significantly lowers risk of heart disease and diabetes.<\/p>\n<p>However, do remember that cheese is a high-fat and high-calorie food. On an average, each ounce of cheese contains 100 calories and 6-9gm of saturated fat. But not all cheeses are created equal. For example – Mozzarella Cheese contains 85 calories and 6.3g fat per ounce, while Feta Cheese contains only 75 calories and 6g fat per ounce. On the other hand, Cheddar Cheese contains 115 calories and 9.6g fat per ounce.<\/p>\n<p><strong>Our Verdict: <\/strong>Moderation is the key to enjoying cheese. A few cubes of cheese eaten with some fruit for dessert or a couple tablespoons sprinkled over grilled veggie will not do you harm, but the same cannot be said for cheese-covered nachos or extra-large pizzas covered with extra cheese. If you’re worried about weight gain, try part-skim Mozzarella, Swiss cheese, and Feta cheese. These low fat cheeses contain the same amount of bone-building calcium and vitamin D, while keeping the saturated fat content in check too.<\/p>\n<h3><span id=\"Dark_Chocolate\">Dark Chocolate<\/span><\/h3>\n<div id=\"attachment_19866\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Dark-chocolate-1-1.webp\"><img aria-describedby=\"caption-attachment-19866\" class=\"size-full wp-image-19866\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Dark-chocolate-1-1.webp\" alt=\"healthy but delicious foods - Dark chocolate\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19866\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Dark chocolate<\/p><\/div>\n<p>Chocolate lovers can rejoice &#8212; dark chocolate and cacao nibs have been linked to health benefits, which is why they make it on this list of delicious that are actually healthy!  Experts believe that if you crave a sweet snack in the middle of the day or must have a sweet treat post dinner, a square of dark chocolate might be the healthiest choice.<\/p>\n<p>Research has found that dark chocolate prevents arterial stiffness and white blood cell adhesion &#8212;known factors that play a significant role in atherosclerosis. Studies have found it also improves endothelial function and improves plasma epicatechin concentrations. An <a href=\"http:\/\/ajcn.nutrition.org\/content\/81\/3\/611.short\">Italian study<\/a> found that dark chocolate also decreases blood pressure and improves insulin sensitivity in healthy persons.<\/p>\n<p>Studies have also found that cocoa polyphenols may increase the concentration of HDL cholesterol (the good kind of cholesterol), whereas chocolate fatty acids may modify the fatty acid composition of LDL (bad cholesterol) and make it more resistant to oxidative damage.<\/p>\n<p><strong>Our Verdict:<\/strong> Since most chocolates can be loaded with sugars, we recommend you buy minimally processed dark chocolate with at least 70% cacao content. Avoid those with hydrogenated or partially hydrogenated oils in the ingredient list and pick chocolate that’s made with cocoa butter. Most importantly, eat in moderation, like a small square after meal and avoid overindulging.<\/p>\n<h3><span id=\"Red_Wine\">Red Wine<\/span><\/h3>\n<div id=\"attachment_19871\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Red-Wine-1.webp\"><img aria-describedby=\"caption-attachment-19871\" class=\"size-full wp-image-19871\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Red-Wine-1.webp\" alt=\"healthy but delicious foods - Red Wine\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19871\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Red Wine<\/p><\/div>\n<p>Enjoy a glass of wine with your dinner? You don’t have to give it up, as long as you are careful not to overindulge! Red wines that have higher levels of polyphenols and antioxidants can be good for you. In fact darker the wine, higher the antioxidant content &#8212; this is why cabernet sauvignon is an excellent choice.<\/p>\n<p>Resveratrol in red wine is the key ingredient that gives it the ‘heart-healthy’ label.  Resveratrol prevents damage to blood vessels, reduces LDL cholesterol and prevents blood clots. <a href=\"http:\/\/www.nature.com\/nature\/journal\/v414\/n6866\/full\/414863a.html#B1\">Studies<\/a> have found that compounds in red wine are associated with preventing coronary heart disease and atherosclerosis. Also, moderate consumption of<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/alcohol-and-diabetes\/\"> alcohol <\/a>has been linked with decreased risk of <a href=\"http:\/\/care.diabetesjournals.org\/content\/28\/3\/719.short\">diabetes<\/a> as well as cognitive decline.<\/p>\n<p>However, moderation is the key here. It’s very easy to overdo alcohol, and wine is no exception. The best way to drink wine is to do it with a Mediterranean meal in a social, relaxed setting that improves both your physical and mental health. Unless you can exercise great control and can safely imbibe just a glass of wine every day, it may be best to not drink every day.<\/p>\n<p><strong>Our Verdict: <\/strong>Be mindful of how much you’re drinking. That means, restrict yourself to a 175ml medium size glass of red wine a day is you’re a woman, and if you’re a man, drink no more than a large 250ml glass of wine per day. If you have a weak liver, restrict yourself to an occasional glass but avoid drinking every day.<\/p>\n<h3><span id=\"Egg_Yolk\">Egg Yolk<\/span><\/h3>\n<div id=\"attachment_19868\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Egg-yolks.webp\"><img aria-describedby=\"caption-attachment-19868\" class=\"size-full wp-image-19868\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Egg-yolks.webp\" alt=\"healthy but delicious foods - Egg Yolks\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19868\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Egg Yolks<\/p><\/div>\n<p>Take a look at any ‘healthy breakfast list’ and you’ll most certainly find the egg-white omelet. But what about the egg yolk?! Old-school advice for improved heart health made egg-white synonymous with ‘healthy’, but this couldn’t be more far away from the truth. Egg yolks are not just delicious; they also pack a nutritious punch. Rich in vitamins A, D, E and K along with saturated omega-3 fats, the yolk contains more vitamin B12, folate and choline than egg-whites. Also, lutein and zeaxanthin – the two antioxidants found in eggs are found in the yolk, not the whites! And while egg yolks do contain cholesterol and saturated fat, adding these highly bioavailable carotenoids &#8211; lutein and zeaxanthin – into your diet with egg yolk is counterbalanced by potential LDL-cholesterol elevation from the added dietary cholesterol, according to research.<\/p>\n<p>One egg yolk contains about 210 mg of cholesterol but scientists have found that eating cholesterol-rich food, like eggs, doesn’t have much of an influence on serum cholesterol levels, and by extension, on risk of cardiovascular disease. A <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/15721501\">study conducted at Yale Prevention Research Center<\/a> in 2005 found that egg consumption does not adversely affect endothelial function in healthy adults, supporting the view that dietary cholesterol may be less detrimental to cardiovascular health than previously thought. Another Finish study found that egg or cholesterol intakes were not associated with increased cardiovascular disease risk, even highly susceptible individuals (who are the ApoE4 gene carriers).<\/p>\n<p><strong>Our Verdict:<\/strong> Eat whole eggs several times a week. We recommend you opt for eggs from organically raised chickens as these are fed a healthy, natural, pesticide-free diet. These free-range eggs are more nutritious than commercially raised eggs.<\/p>\n<h3><span id=\"Red_Meat\">Red Meat<\/span><\/h3>\n<div id=\"attachment_19872\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Red-Meat-1-1.webp\"><img aria-describedby=\"caption-attachment-19872\" class=\"size-full wp-image-19872\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Red-Meat-1-1.webp\" alt=\"healthy but delicious foods - Red meat\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19872\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Red meat<\/p><\/div>\n<p>You may have heard that white is better than red when it comes to meat, because red meat is higher in saturated fats. But did you know that red meat, like beef, is also a great source of zinc, vitamin B3, B6 and B12, iron, riboflavin, Selenium and many more vitamins, minerals and nutrient.<\/p>\n<p>Iron helps deliver oxygen to tissues and organs, while zinc supports the immune system. Red meat is also rich in creatine and carnosine which are important for brain and muscle health. In fact, <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/16500874\">grass-fed beef<\/a> is even healthier as it contains more CLA and omega-3 fatty acids.<\/p>\n<p><strong>Our Verdict: <\/strong>We highly recommend a<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/low-carb-high-fat-lchf-diet-diabetes\/\"> Low Carb-High Fat diet<\/a>, which is why we think that lean cuts of red meats can greatly benefit your healthy diet. Aim for two or three portions (2 to 3 ounces each) per week. Avoid any processed red meats and choose organic grass-fed beef.<\/p>\n<h3><span id=\"Whole-Grain_Bread\">Whole-Grain Bread<\/span><\/h3>\n<div id=\"attachment_19873\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Whole-grain-bread-1.webp\"><img aria-describedby=\"caption-attachment-19873\" class=\"size-full wp-image-19873\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Whole-grain-bread-1.webp\" alt=\"healthy but delicious foods - Whole Grain Bread\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-19873\" class=\"wp-caption-text\">healthy but delicious foods &#8211; Whole Grain Bread<\/p><\/div>\n<p>Are you caught up in the recent gluten-free craze too? No, giving up gluten will not make you healthier if you don’t suffer from celiac disease or gluten sensitivity. In fact, <a href=\"https:\/\/www.sepalika.com\/living-well\/dangers-gluten-free-diet\/\">giving up gluten can have serious consequences<\/a>. Not only can gluten-free foods make you gain weight, they can also make you <a href=\"http:\/\/onlinelibrary.wiley.com\/doi\/10.1046\/j.1365-2036.2002.01283.x\/full\">deficient in key vitamins and minerals<\/a>. Most breads and cereals are fortified with B vitamins and iron.<\/p>\n<p>Also, whole grains are the easiest way to eat more fiber, especially if your meals don’t focus on whole foods and cooked at home to include plenty of fresh fruit and vegetable. <a href=\"http:\/\/www.bmj.com\/content\/357\/bmj.j1892\">Researchers<\/a> have not been able to find any link between long-term dietary intake of gluten and risk of coronary heart disease. On the other hand, the avoidance of gluten may result in reduced consumption of beneficial whole grains, which may affect cardiovascular risk.<\/p>\n<p><strong>Our Verdict: <\/strong>The key to eating whole grains without any discomfort is to soak them overnight and allow them to ferment. Sourdough bread made with whole wheat flour in this way, when eaten with<a href=\"https:\/\/www.sepalika.com\/living-well\/healthy-fats-why-everyone-must-eat-them\/\"> grass-fed butter<\/a>, is highly nutritious and also easy to digest.<\/p>\n<h2><span id=\"Final_Takeaway\">Final Takeaway<\/span><\/h2>\n<p>At Sepalika, we believe that the best way to overhaul your diet is to aim for balanced nutrition. When eaten in moderation, all whole foods – be it healthy proteins from meats and fish, healthy saturated fats or carb-rich whole grains, are good for you. As long as you avoid processed foods and your diet is made up with whole, fresh foods, eat everything in moderation to achieve nutritional balance.<\/p>\n<p>However, when it comes to diet and chronic illness, one man’s food is another man’s poison. Talk to a doctor or a nutritionist and make sure that the ‘good’ foods you are considering are in fact “safe” for you. For example, while diabetics can enjoy cheese occasionally, cheese can be trigger food for those suffering from GERD. And when it comes to dark chocolate, both diabetics and GERD sufferers would be better off avoiding it completely &#8212; most chocolates contain sugar which diabetics should advice and chocolate is also a common<a href=\"https:\/\/www.sepalika.com\/gerd\/ten-foods-avoid-acid-reflux\/\"> GERD food trigger<\/a>. In simpler words &#8211; there&#8217;s no blanket good or bad foods…..your health and medical history will decide which foods are actually ‘good’ as well as ‘safe’ for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Diet trends aren’t just annoying; they can also be anxiety-inducing when you simply can’t understand if the food items you love are actually good for you or really bad for you.  Don’t worry; we’ve got your back! <\/p>\n","protected":false},"author":24,"featured_media":17151,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>6 Healthy But Delicious Foods We All Love | Sepalika<\/title>\n<meta name=\"description\" content=\"A list of healthy but delicious foods that we all love to eat. From red meat to dairy and egg yolks, do these foods really deserve the bad rep\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"6 Food Items that You Love and Are Actually Good for You!\" \/>\n<meta property=\"og:description\" content=\"Here&#039;s a list of healthy yet delicious foods that we all love to eat.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-08-01T20:01:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-25T07:27:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Healthy-foods-that-are-healthy.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/\",\"name\":\"6 Healthy But Delicious Foods We All Love | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#primaryimage\"},\"datePublished\":\"2017-08-01T20:01:32+00:00\",\"dateModified\":\"2022-01-25T07:27:16+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"A list of healthy but delicious foods that we all love to eat. From red meat to dairy and egg yolks, do these foods really deserve the bad rep\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"6 Food Items that You Love and Are Actually Good for You\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"6 Healthy But Delicious Foods We All Love | Sepalika","description":"A list of healthy but delicious foods that we all love to eat. From red meat to dairy and egg yolks, do these foods really deserve the bad rep","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/","og_locale":"en_US","og_type":"article","og_title":"6 Food Items that You Love and Are Actually Good for You!","og_description":"Here's a list of healthy yet delicious foods that we all love to eat.","og_url":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-08-01T20:01:32+00:00","article_modified_time":"2022-01-25T07:27:16+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/08\/Healthy-foods-that-are-healthy.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#webpage","url":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/","name":"6 Healthy But Delicious Foods We All Love | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#primaryimage"},"datePublished":"2017-08-01T20:01:32+00:00","dateModified":"2022-01-25T07:27:16+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"A list of healthy but delicious foods that we all love to eat. From red meat to dairy and egg yolks, do these foods really deserve the bad rep","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/living-well\/healthy-but-delicious-foods\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"6 Food Items that You Love and Are Actually Good for You"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12677"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=12677"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/12677\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/17151"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=12677"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=12677"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=12677"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}