{"id":13430,"date":"2017-09-06T20:00:06","date_gmt":"2017-09-06T20:00:06","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=13430"},"modified":"2022-02-19T14:58:04","modified_gmt":"2022-02-19T09:28:04","slug":"pcos-weight-gain-master-guide","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/","title":{"rendered":"PCOS Weight Gain: The Complete Master Guide To Win That Battle!"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#PCOS_Weight_Gain_The_Reasons\"><span class=\"toc_number toc_depth_1\">1<\/span> PCOS Weight Gain: The Reasons<\/a><\/li><li><a href=\"#Why_Should_You_Care_About_PCOS_Weight_Gain\"><span class=\"toc_number toc_depth_1\">2<\/span> Why Should You Care About PCOS Weight Gain?<\/a><ul><li><a href=\"#You_Are_At_High_Risk_to_Pre-Diabetes\"><span class=\"toc_number toc_depth_2\">2.1<\/span> You Are At High Risk to Pre-Diabetes<\/a><\/li><li><a href=\"#You_Could_Develop_Diabetes_Type_2\"><span class=\"toc_number toc_depth_2\">2.2<\/span> You Could Develop Diabetes Type 2<\/a><\/li><li><a href=\"#You_Are_Susceptible_To_High_Cholesterol\"><span class=\"toc_number toc_depth_2\">2.3<\/span> You Are Susceptible To High Cholesterol<\/a><\/li><li><a href=\"#You_Are_At_Increased_Risk_to_High_Blood_Pressure\"><span class=\"toc_number toc_depth_2\">2.4<\/span> You Are At Increased Risk to High Blood Pressure<\/a><\/li><li><a href=\"#You_Could_Even_Get_Sleep_Apnea\"><span class=\"toc_number toc_depth_2\">2.5<\/span> You Could Even Get Sleep Apnea<\/a><\/li><li><a href=\"#It_Increases_Your_Risk_to_Coronary_Heart_Disease\"><span class=\"toc_number toc_depth_2\">2.6<\/span> It Increases Your Risk to Coronary Heart Disease<\/a><\/li><li><a href=\"#Your_Risk_To_Hypothyroidism_Is_Increased\"><span class=\"toc_number toc_depth_2\">2.7<\/span> Your Risk To Hypothyroidism Is Increased<\/a><\/li><\/ul><\/li><li><a href=\"#Combat_PCOS_Weight_Gain_With_These_8_Tips\"><span class=\"toc_number toc_depth_1\">3<\/span> Combat PCOS Weight Gain With These 8 Tips!<\/a><ul><li><a href=\"#Keep_Insulin_Resistance_In_Check\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Keep Insulin Resistance In Check<\/a><\/li><li><a href=\"#Choose_The_Right_Diet\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Choose The Right Diet<\/a><\/li><li><a href=\"#Stay_Active\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Stay Active<\/a><\/li><li><a href=\"#Learn_To_Manage_Stress\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Learn To Manage Stress<\/a><\/li><li><a href=\"#Dont_Under-Eat_and_Over-Exercise\"><span class=\"toc_number toc_depth_2\">3.5<\/span> Don’t Under-Eat and Over-Exercise<\/a><\/li><li><a href=\"#Replace_Missing_Nutrients\"><span class=\"toc_number toc_depth_2\">3.6<\/span> Replace Missing Nutrients<\/a><\/li><li><a href=\"#Some_Natural_Supplements_Can_Help\"><span class=\"toc_number toc_depth_2\">3.7<\/span> Some Natural Supplements Can Help<\/a><\/li><li><a href=\"#Dietary_Probiotics_and_Prebiotics_Are_Important_Too\"><span class=\"toc_number toc_depth_2\">3.8<\/span> Dietary Probiotics and Prebiotics Are Important Too<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p>Diagnosed with PCOS? Bet your doc has given you strict instructions to lose weight! But honestly, that’s easier said than done. PCOS weight gain is not an easy animal to tame.<\/p>\n<p>Polycystic Ovary Syndrome or PCOS makes it rather hard to lose weight and most fad diets simply don’t work. Some of us manage to lose some weight with a very low-carb, low- fat diet. Sadly, such a diet will not only leave you very hungry, the weight will often creep back as soon as you start eating ‘normal’ again. Yes, tough luck.<\/p>\n<p>Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? What’s the secret here? And why should you even care? You’re in luck, my friend. Because this here is the complete master guide on PCOS and weight gain. And yes, we will focus on that elusive weight loss with PCOS as well.<\/p>\n<h2><span id=\"PCOS_Weight_Gain_The_Reasons\">PCOS Weight Gain: The Reasons<\/span><\/h2>\n<p>Women with PCOS gain weight rather easily.  The abnormally high levels of androgens (male sex hormones) makes it difficult to lose weight. Also, insulin resistance only the problem. Here’s a quick look at the <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-weight-gain-connection\/\">reasons behind PCOS weight gain<\/a>:<\/p>\n<ol>\n<li>You have Insulin Resistance, and your sugar levels are high<\/li>\n<li>Your body stores more Abdominal Fat, and your diet doesn’t cater to this specific problem<\/li>\n<li>You have a sluggish Metabolism, and your daily caloric intake is still on the higher side<\/li>\n<li>You suffer from Mood Disorders, and see comfort food as a quick fix<\/li>\n<li>You have disturbed Appetite Regulation, and feel you need to eat more often to feel satiated<\/li>\n<\/ol>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-weight-gain-connection\/\">PCOS And Weight Gain: What’s The Connection?<\/a><\/div>\n<h2><span id=\"Why_Should_You_Care_About_PCOS_Weight_Gain\">Why Should You Care About PCOS Weight Gain?<\/span><\/h2>\n<div id=\"attachment_20161\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/pcos-weight-gain.webp\"><img aria-describedby=\"caption-attachment-20161\" class=\"wp-image-20161 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/pcos-weight-gain.webp\" alt=\"pcos weight gain\" width=\"706\" height=\"340\" \/><\/a><p id=\"caption-attachment-20161\" class=\"wp-caption-text\">Why Should You Care About PCOS Weight Gain?<\/p><\/div>\n<p>Now that you understand the reasons behind PCOs weight gain, it’s important to understand why you should really care. Yes, it’s hard to lose weight when you have PCOS, but that doesn’t mean you stop trying.<\/p>\n<h3><span id=\"You_Are_At_High_Risk_to_Pre-Diabetes\">You Are At High Risk to Pre-Diabetes<\/span><\/h3>\n<p>It’s estimated that <a href=\"http:\/\/www.sciencedirect.com\/science\/article\/pii\/S0015028205003730\" target=\"_blank\" rel=\"noopener noreferrer\">64% of the women diagnosed with PCOS also have insulin resistance<\/a>. Insulin resistance is more common in overweight women. This insensitivity to insulin very likely contributes to excess male-sex hormones. These hormones are responsible for the symptoms and signs of PCOS. Insulin resistance, weight gain, PCOS and prediabetes are all linked. Left unchecked, insulin resistance makes your cells less sensitive to insulin over time, leading to Type 2 Diabetes. If your fasting glucose levels are between 100 -125 mg\/dl, you probably have insulin resistance and are also pre-diabetic.<\/p>\n<h3><span id=\"You_Could_Develop_Diabetes_Type_2\">You Could Develop Diabetes Type 2<\/span><\/h3>\n<p>Women with PCOS are almost 5 times more at risk for gestational diabetes and Type 2 Diabetes. Once again, insulin resistance is the link between <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-connection-diabetes\/\">PCOS and Diabetes<\/a>. If you don’t get your insulin levels and blood sugar levels under control, you will most likely end up with Diabetes Type 2. Scientific evidence suggests that women with PCOS have a unique disorder of insulin action. This disorder increases their risk to develop Diabetes Type 2. And you guessed it right; body-weight may an intrinsic <a href=\"https:\/\/search.proquest.com\/openview\/df5e6d53d0ccd1ba90d6ba0353da7046\/1?pq-origsite=gscholar&amp;cbl=40569\" target=\"_blank\" rel=\"noopener noreferrer\">part of the equation that connects PCOS to Diabetes<\/a>.<\/p>\n<h3><span id=\"You_Are_Susceptible_To_High_Cholesterol\">You Are Susceptible To High Cholesterol<\/span><\/h3>\n<p>Women with PCOS often have low levels of HDL or ‘good’ cholesterol. And their LDL ‘bad’ cholesterol levels are higher. Some also have high triglycerides levels, which is why doctors order a lipid profile test for women with PCOS. Left unchecked, your high LDL and low HDL levels can wreak havoc on your cardiovascular health. British researchers have studied this elevated low density lipoprotein (LDL)-cholesterol and reduced high density lipoprotein (HDL)-cholesterol in women with PCOS. They found these two conditions are related more closely to adiposity\/insulin metabolism than to circulating androgen levels.<\/p>\n<h3><span id=\"You_Are_At_Increased_Risk_to_High_Blood_Pressure\">You Are At Increased Risk to High Blood Pressure<\/span><\/h3>\n<p>If you have PCOS, you are at increased risk to hypertension. PCOS and Hypertension are a dangerous combination. High blood pressure or hypertension is dubbed as a ‘silent killer’ in women with PCOS. The condition is usually caused by insulin-resistance related weight gain. In a Dutch study, scientists found that hypertension also occurred significantly more in the younger women with PCOS, aged 35-44 years. This was particularly true if they were overweight or obese.<\/p>\n<h3><span id=\"You_Could_Even_Get_Sleep_Apnea\">You Could Even Get Sleep Apnea<\/span><\/h3>\n<p>Polycystic ovary syndrome is associated with obstructive sleep apnea and daytime sleepiness. Again these sleep disorders are linked to insulin resistance. The study also found that PCOS patients were 30 times more likely to suffer from sleep disordered breathing (SDB). Obstructive sleep apnea (OSA) adversely affects multiple organs and systems. In particular, it makes one vulnerable to heart disease. Research has found that obesity and high waist\/hip ratio are significant risk factors for OSA in women.<\/p>\n<h3><span id=\"It_Increases_Your_Risk_to_Coronary_Heart_Disease\">It Increases Your Risk to Coronary Heart Disease<\/span><\/h3>\n<p><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC5085114\/\" target=\"_blank\" rel=\"noopener noreferrer\">Scientific studies<\/a> suggest that PCOS is significantly associated with increased CHD risk. Cardiac disease is the number one killer in women. Obese women with PCOS have an increased prevalence of cardiovascular risk factors. So, not caring about PCOS weight gain puts you at increased risk of stroke and heart attack.<\/p>\n<h3><span id=\"Your_Risk_To_Hypothyroidism_Is_Increased\">Your Risk To Hypothyroidism Is Increased<\/span><\/h3>\n<p>Studies have found a high prevalence of thyroid disorders in PCOS patients, which maybe correlated with obesity. Hypothyroidism may also cause cystic ovaries and worsen insulin resistance. And this will worsen all those symptoms of PCOS you hate.<\/p>\n<p>So you see; there are a lot of reasons you should care about your PCOS weight gain. As if living with PCOS isn’t hard enough! You really don’t want to increase your risk to other chronic diseases by ignoring your weight gain.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-loss-tips\/\">PCOS Weight Loss: 13 Tips To Get Back In Shape<\/a><\/div>\n<h2><span id=\"Combat_PCOS_Weight_Gain_With_These_8_Tips\">Combat PCOS Weight Gain With These 8 Tips!<\/span><\/h2>\n<div id=\"attachment_20162\" style=\"width: 716px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Combat-PCOS-Weight-Gain-With-These-8-Tips.webp\"><img aria-describedby=\"caption-attachment-20162\" class=\"wp-image-20162 size-full\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Combat-PCOS-Weight-Gain-With-These-8-Tips.webp\" alt=\"pcos weight gain\" width=\"706\" height=\"378\" \/><\/a><p id=\"caption-attachment-20162\" class=\"wp-caption-text\">Combat PCOS Weight Gain With These 8 Tips!<\/p><\/div>\n<p>We’ve established that losing weight with PCOS is not that easy. But it surely can be done! The only thing we want to remind you once again – be patient. It takes time for the right diet, exercise plan and stress management techniques to show results.<\/p>\n<h3><span id=\"Keep_Insulin_Resistance_In_Check\">Keep Insulin Resistance In Check<\/span><\/h3>\n<p>None of your diet and exercise efforts will work if your insulin and blood sugar levels are not under control. Higher insulin levels can increase appetite, rendering your weight loss efforts futile. Aim to get your fasting glucose levels below 100 mg\/dl. Get your fasting insulin level to below 8.4mIU\/ml, ideally at 5.0mIU\/ml or lower.<\/p>\n<h3><span id=\"Choose_The_Right_Diet\">Choose The Right Diet<\/span><\/h3>\n<p>One of the best ways to treat insulin resistance and combat PCOS weight gain is to cut back on carbohydrates. If you haven’t already, cutting back sugars and processed grains is an excellent starting point. We highly recommend a <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/low-carb-high-fat-lchf-diet-diabetes\/\">LCHF or Low Carb-High Fat diet<\/a> to treat insulin resistance. Eating good fats like ghee, grass-fed butter, avocados, coconut oil, oily fish and avocados ensure you stay full without eating too many calories. Some women find that a Ketogenic diet is especially effective to lose stubborn weight and balance hormones. A keto diet restricts carbohydrate intake to 20-30gm\/day. A low glycemic index (GI) diet can also be helpful in the management of PCOS.<\/p>\n<h3><span id=\"Stay_Active\">Stay Active<\/span><\/h3>\n<p>Don’t expect metformin to help you lose weight (though your doctor may tell you so). Regular exercise improves insulin sensitivity and helps lose weight. Any kind of a gentle workout will assist you in your weight-loss journey. Walking, cycling, dancing, swimming and yoga are all good options. If you’re carrying excess abdominal fat, resistance training can be especially beneficial. Try weight lifting plus body weight exercises for maximum results. However, remember that those who exercise regularly but don’t fix their diet can <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/24415616\">also ga<\/a>i<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/24415616\">n weight<\/a>.<\/p>\n<h3><span id=\"Learn_To_Manage_Stress\">Learn To Manage Stress<\/span><\/h3>\n<p><a href=\"https:\/\/academic.oup.com\/jcem\/article\/91\/1\/336\/2843549\/Reactive-Oxygen-Species-Induced-Oxidative-Stress\">Stress<\/a> contributes to a pro-inflammatory state. And this state induces insulin resistance and androgen excess in women with PCOS. It also makes it very hard for your body to lose weight. Different stress management techniques work for different people. For some, deep breathing during a stressful situation is enough. Others like to use a stress ball or dance their blues away. For some, combining relaxation with physical activity is often a great stress reliever. This is why yoga and meditation are helpful for everyone. You may have to try a bunch of different strategies to find one that works for you. Learning the right blend of coping mechanisms is well-worth the efforts. Additionally, sleep deprivation will also hinder your weight loss efforts. Aim for 7-8 hours of restful sleep every night.<\/p>\n<h3><span id=\"Dont_Under-Eat_and_Over-Exercise\">Don’t Under-Eat and Over-Exercise<\/span><\/h3>\n<p>This one is important. Research has shown that women with PCOs have a reduced BMR or Basal Metabolic Rate. And so they need fewer calories per day (around 1445 Kcals\/day). However, don’t think that this means you can under-eat and over-exercise. Forget those 900-1200 calories\/day diet plans. Those fad diets are not sustainable. You simply cannot eat such a calorie-restricted diet for the rest of your life. Especially if you are exercising, your body needs more calories for fuel. If you don’t eat enough and are exercising for over 2 hours a day, your body will simply hold on to the weight. Low-calorie diets, coupled with overtraining and stress will zap energy. It also puts you at high risk of hormonal imbalances, thyroid disorders, eating disorders and autoimmune disorders. It also leads to worsened PCOS symptoms like irregular and missed periods.<\/p>\n<h3><span id=\"Replace_Missing_Nutrients\">Replace Missing Nutrients<\/span><\/h3>\n<p>PCOS will often lead to nutrient and mineral deficiencies. Women with PCOS can be deficient in <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4669857\/\" target=\"_blank\" rel=\"noopener noreferrer\">Vitamin D<\/a>, calcium, zinc, magnesium, manganese, chromium, copper, B vitamins and essential fatty acids. Those on Metformin can become deficient in Vitamin B12. These nutritional deficiencies fuel weight gain. They also lead to the progression of insulin resistance to diabetes type 2 and heart disease. Correct these nutritional imbalances with the right foods, and don’t be afraid to resort to supplements.<\/p>\n<h3><span id=\"Some_Natural_Supplements_Can_Help\">Some Natural Supplements Can Help<\/span><\/h3>\n<p>Dietary supplements like Aloe Vera, fenugreek, flaxseed, licorice root and fish oils can also improve insulin sensitivity. These are great to naturally stabilize your insulin levels. This will help your diet and exercise efforts to take you closer to your weight-loss goals.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/pcos\/motivation-tips-pcos\/\">Top 7 Motivation Tips For Fighting PCOS<\/a><\/div>\n<h3><span id=\"Dietary_Probiotics_and_Prebiotics_Are_Important_Too\">Dietary Probiotics and Prebiotics Are Important Too<\/span><\/h3>\n<p>Changes in gut microbiome can affect weight loss, metabolism and body fat. They also encourage inflammation. This is why healthy probiotics, which improve gut flora, help combat PCOS weight gain. Kombucha, miso, sauerkraut, yogurt, buttermilk and tempeh are excellent natural probiotics. Foods that require fermentation also contain live gut-healthy bacteria. Examples of these foods are dhoklas, idlis and dosas.  You must also eat prebiotic foods that particularly feed these healthy gut bacteria. Garlic, onions, asparagus, leeks, apple cider vinegar and sprouted whole grains are all good prebiotic foods.<\/p>\n<p>Don’t be sad if you don’t see immediate results. Losing weight while managing PCOS takes time. Consistency and patience will go a long way towards combating PCOS weight gain, and keep the weight off for life.<\/p>\n<h4><a href=\"https:\/\/www.sepalika.com\/our-programs\/polycystic-ovary-disorder\/\" target=\"_blank\" rel=\"noopener\">Want To Explore More? Checkout Sepalika Polycystic Ovary Disorder (PCOD) Program<\/a><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 PCOS Weight Gain: The Reasons2 Why Should You Care About PCOS Weight Gain?2.1 You Are At High Risk to Pre-Diabetes2.2 You Could Develop Diabetes Type 22.3 You Are Susceptible To High Cholesterol2.4 You Are At Increased Risk to High Blood Pressure2.5 You Could Even Get Sleep Apnea2.6 It Increases Your Risk to [&hellip;]<\/p>\n","protected":false},"author":24,"featured_media":20163,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[143,152],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>PCOS Weight Gain: The Complete Master Guide To Win That Battle!<\/title>\n<meta name=\"description\" content=\"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here&#039;s a complete guide that answers all your questions.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Win The Battle Against PCOS Weight Gain!\" \/>\n<meta property=\"og:description\" content=\"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here&#039;s a complete guide that answers all your questions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2017-09-06T20:00:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T09:28:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Weight-loss-and-PCOS.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/\",\"name\":\"PCOS Weight Gain: The Complete Master Guide To Win That Battle!\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#primaryimage\"},\"datePublished\":\"2017-09-06T20:00:06+00:00\",\"dateModified\":\"2022-02-19T09:28:04+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here's a complete guide that answers all your questions.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"PCOS Weight Gain: The Complete Master Guide To Win That Battle!\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"PCOS Weight Gain: The Complete Master Guide To Win That Battle!","description":"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here's a complete guide that answers all your questions.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/","og_locale":"en_US","og_type":"article","og_title":"Win The Battle Against PCOS Weight Gain!","og_description":"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here's a complete guide that answers all your questions.","og_url":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2017-09-06T20:00:06+00:00","article_modified_time":"2022-02-19T09:28:04+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/Weight-loss-and-PCOS.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#webpage","url":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/","name":"PCOS Weight Gain: The Complete Master Guide To Win That Battle!","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#primaryimage"},"datePublished":"2017-09-06T20:00:06+00:00","dateModified":"2022-02-19T09:28:04+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Why is PCOS weight gain such a huge problem? Is it even possible to lose weight despite PCOS? Here's a complete guide that answers all your questions.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"PCOS Weight Gain: The Complete Master Guide To Win That Battle!"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13430"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=13430"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13430\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/20163"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=13430"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=13430"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=13430"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}