{"id":13716,"date":"2017-09-20T18:00:45","date_gmt":"2017-09-21T01:00:45","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=13716"},"modified":"2022-02-19T13:25:32","modified_gmt":"2022-02-19T07:55:32","slug":"pcos-symptoms","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/","title":{"rendered":"30 PCOS Symptoms You Don’t Want To Ignore"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#The_Complete_List_Of_PCOS_Symptoms\"><span class=\"toc_number toc_depth_1\">1<\/span> The Complete List Of PCOS Symptoms<\/a><ul><li><a href=\"#Irregular_Periods\"><span class=\"toc_number toc_depth_2\">1.1<\/span> Irregular Periods<\/a><\/li><li><a href=\"#Ovarian_Cysts\"><span class=\"toc_number toc_depth_2\">1.2<\/span> Ovarian Cysts<\/a><\/li><li><a href=\"#High_Levels_of_Male-Sex_Hormones_in_Lab_Tests\"><span class=\"toc_number toc_depth_2\">1.3<\/span> High Levels of Male-Sex Hormones in Lab Tests<\/a><\/li><li><a href=\"#Excess_Body_Hair_growth\"><span class=\"toc_number toc_depth_2\">1.4<\/span> Excess Body Hair growth<\/a><\/li><li><a href=\"#Scalp_Hair_Loss\"><span class=\"toc_number toc_depth_2\">1.5<\/span> Scalp Hair Loss<\/a><\/li><li><a href=\"#Pimples_or_Acne\"><span class=\"toc_number toc_depth_2\">1.6<\/span> Pimples or Acne<\/a><\/li><li><a href=\"#Upper_Body_Weight_Gain\"><span class=\"toc_number toc_depth_2\">1.7<\/span> Upper Body Weight Gain<\/a><\/li><li><a href=\"#Inability_to_Lose_Weight\"><span class=\"toc_number toc_depth_2\">1.8<\/span> Inability to Lose Weight<\/a><\/li><li><a href=\"#Stretch_Marks\"><span class=\"toc_number toc_depth_2\">1.9<\/span> Stretch Marks<\/a><\/li><li><a href=\"#Weight_Loss\"><span class=\"toc_number toc_depth_2\">1.10<\/span> Weight Loss<\/a><\/li><li><a href=\"#Darkening_Thickening_of_Skin\"><span class=\"toc_number toc_depth_2\">1.11<\/span> Darkening &amp; Thickening of Skin<\/a><\/li><li><a href=\"#Skin_Tags\"><span class=\"toc_number toc_depth_2\">1.12<\/span> Skin Tags<\/a><\/li><li><a href=\"#TirednessFatigue\"><span class=\"toc_number toc_depth_2\">1.13<\/span> Tiredness\/Fatigue<\/a><\/li><li><a href=\"#Depression_or_Anger\"><span class=\"toc_number toc_depth_2\">1.14<\/span> Depression or Anger<\/a><\/li><li><a href=\"#Breathlessness_or_Wheezing\"><span class=\"toc_number toc_depth_2\">1.15<\/span> Breathlessness or Wheezing<\/a><\/li><li><a href=\"#Swelling_in_Legs_or_Feet\"><span class=\"toc_number toc_depth_2\">1.16<\/span> Swelling in Legs or Feet<\/a><\/li><li><a href=\"#Migraines_or_Headaches\"><span class=\"toc_number toc_depth_2\">1.17<\/span> Migraines or Headaches<\/a><\/li><li><a href=\"#Body_Pain\"><span class=\"toc_number toc_depth_2\">1.18<\/span> Body Pain<\/a><\/li><li><a href=\"#Inability_to_Gain_Height\"><span class=\"toc_number toc_depth_2\">1.19<\/span> Inability to Gain Height<\/a><\/li><li><a href=\"#Brain_Fog\"><span class=\"toc_number toc_depth_2\">1.20<\/span> Brain Fog<\/a><\/li><li><a href=\"#Moon_Face\"><span class=\"toc_number toc_depth_2\">1.21<\/span> Moon Face<\/a><\/li><li><a href=\"#Buffalo_Hump\"><span class=\"toc_number toc_depth_2\">1.22<\/span> Buffalo Hump<\/a><\/li><li><a href=\"#Oiliness_of_Face\"><span class=\"toc_number toc_depth_2\">1.23<\/span> Oiliness of Face<\/a><\/li><li><a href=\"#Long_and_Heavy_periods\"><span class=\"toc_number toc_depth_2\">1.24<\/span> Long and Heavy periods<\/a><\/li><li><a href=\"#Painful_Periods\"><span class=\"toc_number toc_depth_2\">1.25<\/span> Painful Periods<\/a><\/li><li><a href=\"#Infertility\"><span class=\"toc_number toc_depth_2\">1.26<\/span> Infertility<\/a><\/li><li><a href=\"#Gestational_Diabetes\"><span class=\"toc_number toc_depth_2\">1.27<\/span> Gestational Diabetes<\/a><\/li><li><a href=\"#Miscarriages\"><span class=\"toc_number toc_depth_2\">1.28<\/span> Miscarriages<\/a><\/li><li><a href=\"#Hypertension_During_Pregnancy\"><span class=\"toc_number toc_depth_2\">1.29<\/span> Hypertension During Pregnancy<\/a><\/li><li><a href=\"#Pelvic_Pain_Painful_Intercourse\"><span class=\"toc_number toc_depth_2\">1.30<\/span> Pelvic Pain \/ Painful Intercourse<\/a><\/li><\/ul><\/li><li><a href=\"#Final_Thoughts\"><span class=\"toc_number toc_depth_1\">2<\/span> Final Thoughts<\/a><\/li><\/ul><\/div>\n<p>Polycystic Ovarian Syndrome (PCOS) can be a complex condition to diagnose. This is one disease wherein the symptoms actually vary dramatically from person to person, making it harder to identify. The list of PCOS symptoms is rather long.<\/p>\n<p>The name of the condition is a bit misleading too. It suggests that all women with PCOS would have many cysts on their ovaries, but that is not always the case.<\/p>\n<p>You don’t have to display all PCOS symptoms to be diagnosed as having the condition. In fact, very few women display the exact same signs. PCOS Symptoms present themselves in varying combinations, making every woman’s experience with PCOS different. This could be why PCOS is among the most under-diagnosed conditions in women between the ages of 15-45 years.<\/p>\n<p>Most of these PCOS symptoms are a result of excess androgens, or male sex hormones, circulating through the body. However, the underlying causes for excess male sex hormones may differ from one person to another. This could be the reason why PCOS symptoms vary so much from one patient to another.<\/p>\n<h2><span id=\"The_Complete_List_Of_PCOS_Symptoms\">The Complete List Of PCOS Symptoms<\/span><\/h2>\n<h3><span id=\"Irregular_Periods\">Irregular Periods<\/span><\/h3>\n<p><a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-irregular-periods\/\">Irregular periods<\/a> is often the first tell-tale sign that all is not well with your hormones, making this as one of the most important&nbsp;symptom of PCOS. Some women have delayed periods that are more than 35 days apart, while others have completely absent\/missed\/skipped periods. Quite a few PCOS patients have less than 10 periods a year. Some women also experience issues with ovulation. In some women, the ovaries fail to release an egg. While in others the ovaries release a mature egg only infrequently.<\/p>\n<h3><span id=\"Ovarian_Cysts\">Ovarian Cysts<\/span><\/h3>\n<p>A trans-vaginal ultrasound (a type of pelvic ultrasound test) can reveal numerous cyst-like growths on the ovaries. A woman’s ovaries contain tiny, fluid-filled sacs known as ‘follicles,’ which hold the eggs. Every month, one mature egg is supposed to be released by the follicles and it makes its way into the uterus. If it meets a sperm there, it will undergo successful fertilization to form a baby. After the one mature egg is released from the ovary, the other follicles are meant to disintegrate naturally. When this does not happen, it can be a symptom of PCOS. Immature follicles bunch together to form cysts, which makes it difficult for one egg to mature correctly or release itself. This is one of the reasons why PCOS patients find it difficult to conceive.<\/p>\n<h3><span id=\"High_Levels_of_Male-Sex_Hormones_in_Lab_Tests\">High Levels of Male-Sex Hormones in Lab Tests<\/span><\/h3>\n<p>The underlying <a href=\"https:\/\/www.sepalika.com\/pcos\/what-causes-pcos\/\">cause for PCOS <\/a>is an excess of male sex hormones circulating through a woman’s body. Testosterone, DHEA, androstenedione, or DHT are some examples of male sex hormones. If your lab tests show high levels of these hormones, you will be diagnosed with PCOS.<\/p>\n<h3><span id=\"Excess_Body_Hair_growth\">Excess Body Hair growth<\/span><\/h3>\n<p>Excess body hair or <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-hirsutism\/\">hirsutism <\/a>is one of the most dreaded PCOS symptoms. PCOS is considered as the most common <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3002408\/\" target=\"_blank\" rel=\"noopener noreferrer\">cause of hirsutism<\/a>. You may start to notice thick, dark, masculine pattern hair growth on various parts of the body. These parts include the chin, along the jawline, around the mouth, arms, legs and torso. Again, the underlying cause of excess hair growth is hormonal imbalance with high androgen levels.<\/p>\n<h3><span id=\"Scalp_Hair_Loss\">Scalp Hair Loss<\/span><\/h3>\n<p>Along with excess hair on the skin, a common PCOS symptom is male-pattern baldness. Scalp <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-hair-loss\/\">hair loss<\/a> or Androgenic&nbsp;Alopecia is also caused by excess androgens.<\/p>\n<h3><span id=\"Pimples_or_Acne\">Pimples or Acne<\/span><\/h3>\n<p>Another commonly-experienced PCOS symptom is <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-acne\/\">cystic acne<\/a> (a more severe form of general acne.) PCOS acne is characterized by tender knots under the skin instead of surface bumps. These cysts are concentrated along the more &#8220;hormonally sensitive” areas of the skin – namely the jawline, cheeks, chin and upper neck, but can also occur on the chest and back. These under-the-skin cysts are often very painful and get especially worse at period onset.<\/p>\n<p>The above PCOS symptoms are what regular medical doctors are supposed to use to diagnose confirmed cases of the condition. However, in my own practice and in my discussion with other holistic practitioners, I have found that there are other tell-tale symptoms that can help confirm a PCOS-like condition. Since holistic medicine addresses root causes, patients who come in with these PCOS-like symptoms will also benefit hugely from the right <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-diet\/\">diet<\/a>, dietary supplements, <a href=\"https:\/\/www.sepalika.com\/pcos\/acupressure-for-pcos\/\">acupressure<\/a>, and exercise.<\/p>\n<h3><span id=\"Upper_Body_Weight_Gain\">Upper Body Weight Gain<\/span><\/h3>\n<p>PCOS patients notice unexplained weight gain, especially excess fat around the shoulders, neck, and arms. This PCOS symptom is often caused by high levels of androgens coupled with insulin resistance and a reduced BMR (Basal Metabolic Rate).<\/p>\n<h3><span id=\"Inability_to_Lose_Weight\">Inability to Lose Weight<\/span><\/h3>\n<p>The biggest problem with PCOS-related <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-gain-master-guide\/\">weight gain<\/a> is that it’s rather hard to lose. Usual low fat-low calorie diets simply do not work for such weight gain. Since these diets don’t help balance out your hormones, they don’t assist in weight loss.&nbsp; If you don’t have the right fats in your diet, you cannot produce good hormones. If you have been gaining weight despite making healthy lifestyle changes, it can be a symptom of PCOS.<\/p>\n<h3><span id=\"Stretch_Marks\">Stretch Marks<\/span><\/h3>\n<p>If you are not pregnant but are noticing stretch marks, these could be caused by a sudden increase in fat storage underneath the skin cells.&nbsp; Usually noticeable around abdomen, buttocks, thighs, and arms, these unexplained stretch marks could be another PCOS symptom.<\/p>\n<h3><span id=\"Weight_Loss\">Weight Loss<\/span><\/h3>\n<p>Unexplained <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-weight-loss-tips\/\">weight loss <\/a>can also be a PCOS symptom. Most people, doctors included, don’t realize that up to 1\/3<sup>rd<\/sup> of patients with PCOS are of normal weight or are underweight. The weight loss is usually a result of too much stress – physical or mental. Younger women, often in high-stress jobs or too concerned about their figure and are going on crash diets, are more prone to this PCOS symptom. The condition is sometimes called “Adrenal PCOS”. The stress that causes the weight loss also causes the PCOS.<\/p>\n<h3><span id=\"Darkening_Thickening_of_Skin\">Darkening &amp; Thickening of Skin<\/span><\/h3>\n<p>PCOS can also lead to darkening and thickening of skin, also known as <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-dark-skin-patches\/\">acanthosis nigricans<\/a>. This condition is characterized by black velvety skin in the neck, armpits, elbows or groin area. This is a skin pigmentation disorder that is often caused by insulin resistance and can be another symptom of PCOS. These dark patches of skin can sometimes also be found on knees, knuckles, soles of feet and palms, and may also itch.<\/p>\n<h3><span id=\"Skin_Tags\">Skin Tags<\/span><\/h3>\n<p>Another common symptom of PCOS is skin tags, also known as Acrochordons. These small skin growths form in skinfolds, especially around armpits, neck, and groin. You’ll notice flaps of extra skin with a small stalk.<\/p>\n<h3><span id=\"TirednessFatigue\">Tiredness\/Fatigue<\/span><\/h3>\n<p>Fatigue is another leading PCOS symptom. Imbalanced hormones are the reason behind fatigue in women with PCOS. For some women, <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-fatigue\/\">fatigue <\/a>can present itself in the form of an afternoon slump, but is often more severe than normal sluggishness. If you notice an intense desire to sleep post lunch, have severe muscle fatigue, shakes, sweating and nervousness, PCOS could very well be the cause.<\/p>\n<h3><span id=\"Depression_or_Anger\">Depression or Anger<\/span><\/h3>\n<p>Mood disorders like anxiety, <a href=\"https:\/\/www.sepalika.com\/pcos\/pcos-and-depression\/\">depression<\/a>, panic attacks and mood swings can all be caused by PCOS. These are often the result of imbalanced hormones wreaking havoc on your mental health and wellbeing.<\/p>\n<h3><span id=\"Breathlessness_or_Wheezing\">Breathlessness or Wheezing<\/span><\/h3>\n<p>This is a much lesser known symptom of PCOS. It is seen more commonly in women who may be on birth control pills. You may also notice excessive yawning, despite leading an active lifestyle. PCOS can also increase the risk of asthma, making it crucial to get an early diagnosis. In some cases, the body attacks its own organs (something called autoimmune disease). These diseases happen for unknown reasons and can increase inflammation in the body. Asthma is one such condition. These diseases can often be a symptom of hidden hormonal imbalances. Since PCOS is also caused by hormonal imbalances, some practitioners feel this may be the underlying connection.<\/p>\n<h3><span id=\"Swelling_in_Legs_or_Feet\">Swelling in Legs or Feet<\/span><\/h3>\n<p>Fluid retention is another symptom of PCOS, and it often causes abdominal bloating and swollen, tender breasts. Some women could also notice swelling in legs and feet. Imbalanced, fluctuating hormones are often the culprit.<\/p>\n<h3><span id=\"Migraines_or_Headaches\">Migraines or Headaches<\/span><\/h3>\n<p>Women with PCOS often report an increase in the frequency of headaches or migraine attacks. Hormonal imbalances are often the cause, since many women with PCOS are estrogen dominant. Nutritional deficiencies caused by PCOS can also be a contributing factor to headaches.<\/p>\n<h3><span id=\"Body_Pain\">Body Pain<\/span><\/h3>\n<p>While a moderate amount of pain in legs, thighs and back is common during menstruation, PCOS patients may experience more regular episodes of body pain. In particular, they may experience this pain in their neck, back, legs and joints. Low-grade chronic inflammation, which is commonly noticed in PCOS, is often to blame.<\/p>\n<h3><span id=\"Inability_to_Gain_Height\">Inability to Gain Height<\/span><\/h3>\n<p>PCOS can affect any woman post puberty, and a common symptom seen in younger girls is the inability to gain height. Early onset PCOS can cause weight-height discrepancy in growing girls, when imbalanced sex hormones affect growth hormones.<\/p>\n<h3><span id=\"Brain_Fog\">Brain Fog<\/span><\/h3>\n<p>Brain fog or the inability to concentrate&nbsp;is another common symptom of PCOS. Imbalanced hormones coupled with insulin resistance, high blood sugar levels and chronic low grade inflammation can all affect your ability to focus and concentrate. If your thoughts feel muddled and foggy and you have difficulty concentrating on simple tasks, PCOS could be to blame.<\/p>\n<h3><span id=\"Moon_Face\">Moon Face<\/span><\/h3>\n<p>If your face has gradually become rounder and looks swollen, it’s called as moon facies or moon face. This happens due to excess fat deposits around the face and neck, giving your face a rounder appearance.&nbsp; Hormonal imbalances result in excess cortisol (the stress hormone), which causes abnormal fat deposits around face.<\/p>\n<h3><span id=\"Buffalo_Hump\">Buffalo Hump<\/span><\/h3>\n<p>Excess cortisol can also lead to abnormal fat deposits around shoulders and arms, referred to as a buffalo hump. While moon face and buffalo hump are typically associated more with Cushing’s disease, increased levels of testosterone, DHEA-S, and cortisol can be another cause.<\/p>\n<h3><span id=\"Oiliness_of_Face\">Oiliness of Face<\/span><\/h3>\n<p>Excess androgens in the body can send the oil-producing glands into overdrive, so that they produce more oil. If you notice sudden oiliness of the face, imbalanced hormones could be the reason. Left unchecked, this can lead to clogged pores causing acne and pimples.<\/p>\n<h3><span id=\"Long_and_Heavy_periods\">Long and Heavy periods<\/span><\/h3>\n<p>Heavy periods that last for more than 7 days are another PCOS symptom. Clinically known as Menorrhagia, large blood clots may be passed during periods. In some cases, the bleeding may be heavy enough to restrict daily activities. Many women with menorrhagia report shortness of breath and fatigue as well.<\/p>\n<h3><span id=\"Painful_Periods\">Painful Periods<\/span><\/h3>\n<p>If your periods are accompanied by pain that’s beyond a little discomfort, this could be another warning sign of PCOS. Known as Dysmenorrhea, painful periods are characterized by abdominal cramping with a dull deep ache in the lower abdomen. Pain may radiate to your back, hips and thighs as well.<\/p>\n<h3><span id=\"Infertility\">Infertility<\/span><\/h3>\n<p>Menstrual irregularities with absent\/missed\/skipped periods are the hallmark of PCOS, causing problems with fertility. As PCOS affects ovulation, it can make it difficult for you to conceive a baby. Regulating your period and promoting healthy, natural ovulation may be the key to <a href=\"https:\/\/www.sepalika.com\/pcos\/getting-pregnant-with-pcos\/\">getting pregnant with PCOS<\/a>.<\/p>\n<h3><span id=\"Gestational_Diabetes\">Gestational Diabetes<\/span><\/h3>\n<p>Women with PCOS can also notice Gestational Diabetes or diabetes during pregnancy. PCOS increases the&nbsp;risk to gestational diabetes, thanks to glucose intolerance and insulin resistance.<\/p>\n<h3><span id=\"Miscarriages\">Miscarriages<\/span><\/h3>\n<p>PCOS also increases the risk of miscarriages. Scientists believe that insulin resistance and higher Lutenizing Hormone (LH) levels in PCOS patients are often to blame. Altered hormone levels caused by PCOS can result in miscarrying of less than 90 day-old fetus in pregnant women. If you have had a fertility problem and miscarried in the past, get checked for PCOS.<\/p>\n<h3><span id=\"Hypertension_During_Pregnancy\">Hypertension During Pregnancy<\/span><\/h3>\n<p>Normal blood pressure (BP) before pregnancy but elevated BP during gestation may also be a symptom of PCOS. Left untreated, it can cause preeclampsia and other birth-related problems. Talk to your healthcare provider and get screened for PCOS.<\/p>\n<h3><span id=\"Pelvic_Pain_Painful_Intercourse\">Pelvic Pain \/ Painful Intercourse<\/span><\/h3>\n<p>PCOs can also cause pelvic pain and inflammation. In some women, it is the reason behind painful intercourse and can also negatively affect sex drive.<\/p>\n<h2><span id=\"Final_Thoughts\">Final Thoughts<\/span><\/h2>\n<p>Irregular periods, ovarian cysts and excess hair growth are classic clinical PCOS symptoms which directly point to excessive male hormones. However, holistic practitioners follow a more elaborate list when they look for PCOS symptoms.&nbsp;Because they look for &#8216;the story behind the story&#8217;, they consider a wider range of symptoms to diagnose PCOS-like conditions and treat them, often before they become full blown PCOS or PCOD.<\/p>\n<p>After going through the checklist of PCOS symptoms, if some of these PCOS symptoms seem a bit too familiar, please understand what PCOS is and learn how you can deal with it through a more natural, holistic approach. Wish you all vibrant health and well being!<\/p>\n\n\n<p>Finding out that you have PCOD after suffering from its symptoms can be distressing, but the good news is that the condition can be reversed naturally using a holistic approach with Sepalika’s 5-Petal PCOD Programme. Our personalised protocols help treat PCOD at the root through diet, nutrition, exercise, Ayurveda and magnet acutherapy. What’s more, expert consults via phone and WhatsApp help you always stay on track in your journey to overcome PCOD. <a href=\"https:\/\/sepalika.com\/campaigns\/pcod\/?utm_source=Website&amp;utm_medium=PCOD%20Blog&amp;utm_campaign=Blog_Footer\">Click here<\/a> to know more.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4><a href=\"https:\/\/www.sepalika.com\/our-programs\/polycystic-ovary-disorder\/\" target=\"_blank\" rel=\"noreferrer noopener\">Want To Explore More? Checkout Sepalika Polycystic Ovary Disorder (PCOD) Program<\/a><br><\/h4>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 The Complete List Of PCOS Symptoms1.1 Irregular Periods1.2 Ovarian Cysts1.3 High Levels of Male-Sex Hormones in Lab Tests1.4 Excess Body Hair growth1.5 Scalp Hair Loss1.6 Pimples or Acne1.7 Upper Body Weight Gain1.8 Inability to Lose Weight1.9 Stretch Marks1.10 Weight Loss1.11 Darkening &amp; Thickening of Skin1.12 Skin Tags1.13 Tiredness\/Fatigue1.14 Depression or Anger1.15 Breathlessness [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":20297,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[143,150],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>30 PCOS Symptoms Every Woman Should Know | Sepalika<\/title>\n<meta name=\"description\" content=\"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Here’s a checklist of 30 PCOS symptoms no woman should ignore.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"30 PCOS Symptoms You Don’t Want To Ignore\" \/>\n<meta property=\"og:description\" content=\"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Find out 30 PCOS symptoms no woman should ignore.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\" \/>\n<meta property=\"article:published_time\" content=\"2017-09-21T01:00:45+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-19T07:55:32+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/symptoms-of-PCOS-header.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mahesh Jayaraman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/\",\"name\":\"30 PCOS Symptoms Every Woman Should Know | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#primaryimage\"},\"datePublished\":\"2017-09-21T01:00:45+00:00\",\"dateModified\":\"2022-02-19T07:55:32+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\"},\"description\":\"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Here’s a checklist of 30 PCOS symptoms no woman should ignore.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"30 PCOS Symptoms You Don’t Want To Ignore\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\",\"name\":\"Mahesh Jayaraman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"caption\":\"Mahesh Jayaraman\"},\"description\":\"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.\",\"sameAs\":[\"http:\/\/sepalika.com\",\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"30 PCOS Symptoms Every Woman Should Know | Sepalika","description":"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Here’s a checklist of 30 PCOS symptoms no woman should ignore.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/","og_locale":"en_US","og_type":"article","og_title":"30 PCOS Symptoms You Don’t Want To Ignore","og_description":"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Find out 30 PCOS symptoms no woman should ignore.","og_url":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/profile.php?id=100009879845215","article_published_time":"2017-09-21T01:00:45+00:00","article_modified_time":"2022-02-19T07:55:32+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2017\/09\/symptoms-of-PCOS-header.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Mahesh Jayaraman","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#webpage","url":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/","name":"30 PCOS Symptoms Every Woman Should Know | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#primaryimage"},"datePublished":"2017-09-21T01:00:45+00:00","dateModified":"2022-02-19T07:55:32+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4"},"description":"PCOS can be a complex condition to diagnose. Its symptoms come in different forms. Here’s a checklist of 30 PCOS symptoms no woman should ignore.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/pcos\/pcos-symptoms\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"30 PCOS Symptoms You Don’t Want To Ignore"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4","name":"Mahesh Jayaraman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","caption":"Mahesh Jayaraman"},"description":"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.","sameAs":["http:\/\/sepalika.com","https:\/\/www.facebook.com\/profile.php?id=100009879845215","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13716"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=13716"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/13716\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/20297"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=13716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=13716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=13716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}