{"id":15600,"date":"2019-04-23T20:00:11","date_gmt":"2019-04-24T03:00:11","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=15600"},"modified":"2022-02-17T17:56:17","modified_gmt":"2022-02-17T12:26:17","slug":"intermittent-fasting-for-weight-loss","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/","title":{"rendered":"Myths and Facts on Intermittent Fasting for Weight Loss"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Myths_and_Facts_on_Intermittent_Fasting_for_Weight_Loss\"><span class=\"toc_number toc_depth_1\">1<\/span> Myths and Facts on Intermittent Fasting for Weight Loss<\/a><\/li><li><a href=\"#Myth_No1_Everyone_says_fasting_slows_down_metabolism_Is_it_true\"><span class=\"toc_number toc_depth_1\">2<\/span> Myth No#1:  Everyone says fasting slows down metabolism: Is it true?<\/a><\/li><li><a href=\"#Myth_No2_If_I_fast_I_will_faint_from_low_energy_or_get_acidity_and_headaches\"><span class=\"toc_number toc_depth_1\">3<\/span> Myth No#2:  If I fast, I will faint from low energy or get acidity and headaches.<\/a><\/li><li><a href=\"#Myth_No_3_Why_does_it_matter_what_I_eat_during_non-fasting_hours_I_should_be_able_to_eat_anything_on_IF_too\"><span class=\"toc_number toc_depth_1\">4<\/span> Myth No #3:  Why does it matter what I eat during non-fasting hours? I should be able to eat anything on IF too.<\/a><\/li><li><a href=\"#Myth_No_4_6_meals_a_day_8211_If_its_so_bad_how_come_its_so_popular\"><span class=\"toc_number toc_depth_1\">5<\/span> Myth No #4:  6 meals a day &#8211; If it’s so bad, how come it’s so popular?<\/a><\/li><li><a href=\"#Myth_No_5_I_have_hormonal_issues_Will_fasting_still_help_me_lose_weight\"><span class=\"toc_number toc_depth_1\">6<\/span> Myth No #5:  I have hormonal issues. Will fasting still help me lose weight?<\/a><\/li><li><a href=\"#Myth_No_6_I_dont_see_weight_loss_Inch_loss_isnt_weight_loss\"><span class=\"toc_number toc_depth_1\">7<\/span> Myth No #6:  I don’t see weight loss. Inch loss isn’t weight loss.<\/a><\/li><li><a href=\"#Myth_No_7_Its_been_a_week_and_I_see_no_difference_How_long_will_it_take_my_body_to_adjust_to_fasting\"><span class=\"toc_number toc_depth_1\">8<\/span> Myth No #7:  It’s been a week and I see no difference. How long will it take my body to adjust to fasting?<\/a><\/li><li><a href=\"#Myth_No_8_I_cant_do_without_roti_or_rice_So_fasting_will_not_work_for_me\"><span class=\"toc_number toc_depth_1\">9<\/span> Myth No #8:  I can’t do without roti or rice. So fasting will not work for me.<\/a><\/li><li><a href=\"#Myth_No_9_Why_cant_I_gym_to_lose_weight\"><span class=\"toc_number toc_depth_1\">10<\/span> Myth No #9:  Why can’t I gym to lose weight?<\/a><\/li><\/ul><\/div>\n\n<p>Your doctor has recommended Intermittent Fasting for weight loss, and now you’re really worried. We get it….Intermittent Fasting or IF can sound very intimidating to a newbie. After all, the word has ‘fasting’ in it!!!<\/p>\n\n\n\n<h2><span id=\"Myths_and_Facts_on_Intermittent_Fasting_for_Weight_Loss\"><strong>Myths and Facts on Intermittent Fasting for Weight Loss<\/strong><\/span><\/h2>\n\n\n\n<p>Many of us wrongly presume that Intermittent Fasting equals starving yourself. This couldn’t be further from the truth. In fact, many people who practice Intermittent Fasting actually consume the same number of calories as they did when they were on any other healthy diet. The only difference is that they consume most of their calories in a set number of hours instead of munching throughout the day. The advantage &#8211; <a href=\"https:\/\/www.sepalika.com\/living-well\/intermittent-fasting-guide-health-benefits\/\">IF<\/a><a href=\"https:\/\/www.sepalika.com\/living-well\/intermittent-fasting-guide-health-benefits\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"  (opens in a new tab)\"> <\/a><a href=\"https:\/\/www.sepalika.com\/living-well\/intermittent-fasting-guide-health-benefits\/\">is a scientifically proven<\/a> way to lose weight naturally and effectively and at the same time also improve insulin sensitivity, sleep patterns, mental clarity, as well as hormonal balance.<\/p>\n\n\n\n<p>With that said, let’s explore some of the common myths and facts on Intermittent Fasting for weight loss, so that you can be assured that this isn’t just another FAD diet.<\/p>\n\n\n\n<h2><span id=\"Myth_No1_Everyone_says_fasting_slows_down_metabolism_Is_it_true\"><strong>Myth No#1:  Everyone says fasting slows down metabolism: Is it true?<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/Everyone-says-fasting-slows-down-metabolism.webp\" alt=\"intermittent fasting for weight loss\" class=\"wp-image-21079\"\/><figcaption>Everyone says fasting slows down metabolism<\/figcaption><\/figure>\n\n\n\n<p>The short answer &#8211; Nope. The simple reason is that Intermittent Fasting is not a severely calorie-restrictive diet. It is a well-known fact that severe calorie restriction over prolonged periods of time lead to permanent down-regulation of metabolic rate. This is the main reason why people who follow crash-diets tend to regain all the lost weight within a few years.<\/p>\n\n\n\n<p>However, with IF, you don’t drastically change your calorie intake – you simply change “when to eat”, not necessarily “how much to eat”. <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/10837292\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Research<\/a> has found that resting energy expenditure increases in the early stages of fasting, due to a decline in serum glucose and may be the initial signal for positive metabolic changes. Test subjects found that their metabolism increased by an impressive 14% after a 3-day fast.<\/p>\n\n\n\n<p>There is <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/15640462\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">scientific evidence<\/a> that alternate-day fasting diet doesn’t have any negative effects on rate of metabolism when practised over 22 days. This is the reason why IF doesn’t result in loss of lean muscle mass, which is why doctors and athletes prefer it to traditional calorie-restrictive diets.<\/p>\n\n\n\n<h2><span id=\"Myth_No2_If_I_fast_I_will_faint_from_low_energy_or_get_acidity_and_headaches\"><strong>Myth No#2:  If I fast, I will faint from low energy or get acidity and headaches.<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/low-energy-or-get-acidity-and-headaches.webp\" alt=\"intermittent fasting for weight loss\" class=\"wp-image-21081\"\/><figcaption>low energy or get acidity and headaches<\/figcaption><\/figure>\n\n\n\n<p>A few people can experience bouts of low energy in the beginning of their IF journey. But these initial hiccups are usually temporary sugar withdrawal symptoms that can be managed with the right guidance.<\/p>\n\n\n\n<p>Think about it this way – no one goes from being a couch potato to a marathon runner overnight! Similarly, when you restrict your ‘eating window’, your body needs time to acclimate to the changes. Acidity, headaches and low energy can be some of the initial side effects, but your doctor can work with you to help you deal with them.<\/p>\n\n\n\n<p>It is crucial to stay well hydrated during fasting, which is why drinking ample water, black coffee, soothing teas and bone broth can go a long way towards combating headaches, heartburn and low energy levels. Headaches can also be a result of blood sugar levels decreasing during fasting periods, but your body will soon get used to your new eating schedule. Since your body no longer gets constant fuel through all-day eating, expect to feel a bit sluggish and even irritable. To avoid dizzy spells, keep your workouts low-impact in the first few days of starting IF. Try yoga or walking instead of running or kickboxing.<\/p>\n\n\n\n<p>If you suffer from heartburn, you may experience some mild discomfort in the initial few days. It is not uncommon to experience burping, stomach growling, constipation and mild acidity during fasting (especially if you are used to a heavy breakfast early in the morning or late night dinners). Stay hydrated, avoid restrictive clothing and prop yourself on pillows while sleeping to avoid GERD. Another way to avoid heartburn is to steer clear of greasy, spicy and oily food in your first few days of Intermittent Fasting. The most important thing &#8212; stay stress free and give your body time to adjust to Intermittent Fasting before you decide to ditch it.<\/p>\n\n\n\n<h2><span id=\"Myth_No_3_Why_does_it_matter_what_I_eat_during_non-fasting_hours_I_should_be_able_to_eat_anything_on_IF_too\"><strong>Myth No #3:  Why does it matter what I eat during non-fasting hours? I should be able to eat anything on IF too.<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/Why-does-it-matter-what-I-eat-during-non-fasting-hours.webp\" alt=\"intermittent fasting for weight loss\" class=\"wp-image-21082\"\/><figcaption>Why does it matter what I eat during non-fasting hours<\/figcaption><\/figure>\n\n\n\n<p>We mentioned in the beginning that IF doesn’t change “how much you eat” but “when you eat”, and that is true. But that being said, it is important to understand that Intermittent Fasting can only be integrated into your life when you’re eating the right foods during your feeding window.<\/p>\n\n\n\n<p>Weight loss via fasting is achieved by lowering levels of insulin in the blood. If you eat insulin-spiking foods during your feeding window, you will nullify this effect. Not just that, but most carbs and sugars (which are insulin-spiking foods) are also the first fuel your body will burn, making you feel hungry again soon after your meal. On the other hand, nutrition-dense foods that are high in good fats, fibre and protein will not only fill you up, but also keep you satiated for many hours after your meal.<\/p>\n\n\n\n<p>Another thing many of us don’t realise is that eating more of healthy fats adds a lot more flavour to your meals and also ensures you stay full for longer. The human body is designed to burn fat more efficiently than sugar, which means more fat gets stored for future use as energy. Hence, when your body burns fats instead of burning simple carbs and sugar, your metabolism will benefit. And you are going to get hungry less often and require fewer calories to maintain your energy when fasting.<\/p>\n\n\n\n<h2><span id=\"Myth_No_4_6_meals_a_day_8211_If_its_so_bad_how_come_its_so_popular\"><strong>Myth No #4:  6 meals a day &#8211; If it’s so bad, how come it’s so popular?<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/If-its-so-bad-how-come-its-so-popular.webp\" alt=\"intermittent fasting for weight loss\" class=\"wp-image-21083\"\/><figcaption>If it’s so bad, how come it’s so popular<\/figcaption><\/figure>\n\n\n\n<p>Perhaps, the biggest problem here is that many of us have been made to believe we should eat 5 or more “mini-meals” a day to keep our metabolism revved up!!! Intermittent Fasting is a style of eating that alternates periods of fasting with eating, and closely mimics the ancestral hunter-gatherer lifestyle where humans ate a majority of their daily caloric intake within a 4 to 6 hour window, and fasted for rest of the day.<\/p>\n\n\n\n<p>Our ancestors didn’t have 24&#215;7 access to food, so they ate maybe 1 to 2 meals all day. And guess what – the human body is still running on that 1.0 design….there never has been an upgrade since evolution of time! Which means that fasting is actually more “natural” that eating 5-6 meals every day, as this is what the human body is naturally designed to do.<\/p>\n\n\n\n<p>The concept of eating 6 meals a day began with body builders who worked out 6 hours (or more) a day. They needed small, protein rich meals between gym sets to rebuild muscle breakdown and add bulk and weight. Now let’s cut back to real everyday life for most of us – we lead a more sedentary lifestyle where we spend 6-8 hours glued to our office desk. We don’t burn enough calories in the span of a day to warrant a diet comprising of 5-6 “mini-meals” – especially considering that “mini” meals don’t come with a definition.<\/p>\n\n\n\n<p>In fact, eating several small meals a day is the complete opposite of what you need to do to lose weight. And if we are being honest, eating 5 to 6 meals a day is the easiest way to overeat without even realising it.<\/p>\n\n\n\n<h2><span id=\"Myth_No_5_I_have_hormonal_issues_Will_fasting_still_help_me_lose_weight\"><strong>Myth No #5:  I have hormonal issues. Will fasting still help me lose weight?<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/Will-fasting-still-help-me-lose-weight.webp\" alt=\"intermittent fasting for weight loss\" class=\"wp-image-21084\"\/><figcaption>Will fasting still help me lose weight<\/figcaption><\/figure>\n\n\n\n<p>Absolutely! Many of us wrongly believe that fasting has negative effects of hormones. In fact, Intermittent Fasting causes improvements in fat burning hormones, making it a helpful tool for weight loss.<\/p>\n\n\n\n<p>Insulin is a hormone. Intermittent Fasting <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/19106250\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">has been linked<\/a> to lowering insulin levels and improving insulin sensitivity. Once insulin is balanced, other hormones like testosterone, estrogen, etc. also begin to fall in balance and you lose weight. Intermittent Fasting also results in <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/1548337\">increased levels of Human Growth Hormone<\/a> (HGH) which promotes weight loss.<\/p>\n\n\n\n<p>Additionally, IF can have positive effects on the <a rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\" href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC2622429\/\" target=\"_blank\">hunger hormone Ghrelin<\/a> (via the gut-brain axis at work) which can help regulate your appetite as well as improve cognitive function. With Intermittent Fasting comes glucose stability and your body is also able to fight <a href=\"https:\/\/jackkruse.com\/intermittent-fasting-and-leptin\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">leptin resistance<\/a>.<\/p>\n\n\n\n<p>However, for some women, Intermittent Fasting without supervision can result in missing your period or throwing off your menstrual cycle in the first few months. That doesn’t mean IF will not work for you. It only means that you need to work with a professional to try a gentler approach and find the right intermittent fasting protocol for you.<\/p>\n\n\n\n<h2><span id=\"Myth_No_6_I_dont_see_weight_loss_Inch_loss_isnt_weight_loss\"><strong>Myth No #6:  I don’t see weight loss. Inch loss isn’t weight loss.<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"706\" height=\"340\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/I-dont-see-weight-loss.-Inch-loss-isnt-weight-loss.webp\" alt=\" I don’t see weight loss. Inch loss isn’t weight loss\" class=\"wp-image-21085\"\/><figcaption> I don’t see weight loss. Inch loss isn’t weight loss<\/figcaption><\/figure>\n\n\n\n<p>Many people who are new to Intermittent Fasting wonder what will they see first – weight loss or inch loss? The answer – usually, it is inch loss. And there is a reason for this. Initial weight loss is water weight loss. Water retention causes bloating, which is why many people will first see an inch loss on their IF weight loss journey. Fasting allows you to purge excess water weight so you will see immediate weight loss.<\/p>\n\n\n\n<p>Sugar from simple carbs gets deposited in areas like the waist and hip. So when that gets used up during fasting periods, inch loss shows up first. It’s a good thing if you are witnessing inch loss and your clothes are becoming loser, but your weight hasn’t reduced drastically. This means that you aren’t losing precious muscle mass on your new diet. Remember – muscles weigh more than fat. But muscles are denser, so you will notice that you have gone down in a dress\/pant size with Intermittent Fasting, even if the weighing scale isn’t showing a drastic reduction. Stick to your IF diet along with gentle exercise; soon you will see the number going down on the weighing scale as your fat deposits melt away and your muscles become stronger.<\/p>\n\n\n\n<p>However, this may vary from person to person. For those who are obese, losing water weight can result in noticeable weight loss in the initial few days. It all depends on your current size and health, and how much weight you need to lose to achieve ‘your’ healthy weight.<\/p>\n\n\n\n<h2><span id=\"Myth_No_7_Its_been_a_week_and_I_see_no_difference_How_long_will_it_take_my_body_to_adjust_to_fasting\"><strong>Myth No #7:  It’s been a week and I see no difference. How long will it take my body to adjust to fasting?<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><a class=\"img-responsive\" href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/12-hr-fasting.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/12-hr-fasting.jpg\" alt=\"\" class=\"wp-image-15612\"\/><\/a><\/figure>\n\n\n\n<p>One of the best things about Intermittent Fasting is that it’s highly flexible. You can fast for shorter or longer periods, as per your convenience, and tweak your &#8220;eating periods&#8221; and &#8220;fasting periods” into any kind of schedule. Since Intermittent Fasting <a href=\"https:\/\/www.sepalika.com\/living-well\/intermittent-fasting-guide-health-benefits\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">comprises of different approaches<\/a> to find the ideal fasting-eating window, the results will vary depending on which method you choose.<\/p>\n\n\n\n<p>In general, you can expect to see positive transformation in a week to ten days. However, it is highly recommended that you give any new diet changes at least 10 weeks before you expect to see some concrete results.<\/p>\n\n\n\n<p>Eating a nutritionally dense diet that focuses on healthy fats and lean proteins take longer to digest will set you up on the right path. Eat more coconut oil, avocados, nuts and seeds along with lean cuts of meat. With the right guidance on non-insulin spiking beverages like lemon-infused water, black coffee, green tea and bone broth, you can minimize any adjustment side effects too.<\/p>\n\n\n\n<h2><span id=\"Myth_No_8_I_cant_do_without_roti_or_rice_So_fasting_will_not_work_for_me\"><strong>Myth No #8:  I can’t do without roti or rice. So fasting will not work for me.<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><a class=\"img-responsive\" href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/traditioonal-indian-meal.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/traditioonal-indian-meal.jpg\" alt=\"\" class=\"wp-image-15613\"\/><\/a><\/figure>\n\n\n\n<p>Wrong again! If you are the kind of person who needs a traditional Indian meal, you can most certainly give Intermittent Fasting a go with some minor dietary tweaks!<\/p>\n\n\n\n<p>India has a rich heritage of yummy rotis made with pulses, millets, bajra and more grains. Don’t limit yourself to maida or wheat rotis – just change the kind of roti you eat! You can also make rotis using buckwheat flour, quinoa flour, chickpea flour, or water chestnut flour.<\/p>\n\n\n\n<p>The same holds true for rice eaters. For those trying to make the switch from white rice, there are plenty of good alternatives like brown rice, wild rice, bamboo rice, black rice and red rice. Another great grain-free option is <a href=\"https:\/\/www.sepalika.com\/living-well\/make-lchf-diet-sustainable\/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">cauliflower rice<\/a> that is made with grating fresh cauliflower (or broccoli) and sautéing it in a teaspoon of coconut oil or ghee.<\/p>\n\n\n\n<p>The whole idea behind trying to eat more nutrient-dense foods on Intermittent Fasting is to pick options that are high in fibre and lower in refined carbohydrates. Walk into any health food store and you’ll find a plethora of rice and grain options that don’t cause an immediate spike in insulin levels.<\/p>\n\n\n\n<h2><span id=\"Myth_No_9_Why_cant_I_gym_to_lose_weight\"><strong>Myth No #9:  Why can’t I gym to lose weight?<\/strong><\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><a class=\"img-responsive\" href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/Fasting-and-gym.jpg\" target=\"_blank\" rel=\"noreferrer noopener\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/04\/Fasting-and-gym.jpg\" alt=\"\" class=\"wp-image-15635\"\/><\/a><\/figure>\n\n\n\n<p>No one said you cannot lose weight by religiously going to the gym. You can, and you probably will.<\/p>\n\n\n\n<p>But the truth is that there is only so much weight loss that is possible from weight training. Yes, weight training and even long cardio sessions can reduce insulin-resistance. However, with extra workout comes an increased appetite, since the body sends signal to your brain that it’s running in a calorie deficit. Trying to restrict calories while you also work out hard at the gym comes with three drawbacks:<\/p>\n\n\n\n<ul><li>You can lose some muscle mass<\/li><li>You start to feel deprived as you are constantly feeling hungry post workout but aren’t consuming too many calories to promote weight-loss<\/li><li>You risk putting your body under unnecessary “stress” which can cause the body to hold on to the extra weight<\/li><\/ul>\n\n\n\n<p>As a result, over-exercising while under-eating is not a sustainable way to lose excess weight. On the other hand, it is possible to lose more weight with Intermittent Fasting as you force your body to burn accumulated fat deposits, without sending your body into stress-mode with long workouts. Coupled with a gentle workout of cycling, walking or swimming every day, IF can result in the maximum weight loss without losing muscle mass or feeling deprived (which is what commonly happens on most diet.<\/p>\n\n\n\n<p>In the end, I would like to add that when it comes to weight loss, there is no “One Size Fits All” approach. And the same holds very true for Intermittent Fasting. This is why it’s very important that you work with your doctor or naturopath to create an individualised eating plan that caters to your specific health goals.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Myths and Facts on Intermittent Fasting for Weight Loss2 Myth No#1: Everyone says fasting slows down metabolism: Is it true?3 Myth No#2: If I fast, I will faint from low energy or get acidity and headaches.4 Myth No #3: Why does it matter what I eat during non-fasting hours? I should be [&hellip;]<\/p>\n","protected":false},"author":24,"featured_media":16658,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[163,12],"tags":[164,165,166],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Intermittent Fasting for Weight Loss| Myths and Facts You Must Know<\/title>\n<meta name=\"description\" content=\"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Intermittent Fasting for Weight Loss| Myths and Facts You Must Know\" \/>\n<meta property=\"og:description\" content=\"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/maneerasaxena\" \/>\n<meta property=\"article:published_time\" content=\"2019-04-24T03:00:11+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-02-17T12:26:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"706\" \/>\n\t<meta property=\"og:image:height\" content=\"340\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@https:\/\/twitter.com\/search?q=maneerasaxena&amp;src=typd\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maneera Saxena Behl\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg\",\"width\":706,\"height\":340},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/\",\"name\":\"Intermittent Fasting for Weight Loss| Myths and Facts You Must Know\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#primaryimage\"},\"datePublished\":\"2019-04-24T03:00:11+00:00\",\"dateModified\":\"2022-02-17T12:26:17+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\"},\"description\":\"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Myths and Facts on Intermittent Fasting for Weight Loss\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099\",\"name\":\"Maneera Saxena Behl\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Maneera Saxena Behl\"},\"description\":\"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.\",\"sameAs\":[\"https:\/\/www.facebook.com\/maneerasaxena\",\"https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd\",\"logicalsteps19@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/maneera\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Intermittent Fasting for Weight Loss| Myths and Facts You Must Know","description":"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/","og_locale":"en_US","og_type":"article","og_title":"Intermittent Fasting for Weight Loss| Myths and Facts You Must Know","og_description":"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.","og_url":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/maneerasaxena","article_published_time":"2019-04-24T03:00:11+00:00","article_modified_time":"2022-02-17T12:26:17+00:00","og_image":[{"width":706,"height":340,"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Maneera Saxena Behl","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/IF.jpg","width":706,"height":340},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#webpage","url":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/","name":"Intermittent Fasting for Weight Loss| Myths and Facts You Must Know","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#primaryimage"},"datePublished":"2019-04-24T03:00:11+00:00","dateModified":"2022-02-17T12:26:17+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099"},"description":"Facts and myths on Intermittent fasting for weight loss. It helps with weight loss and inch loss. It helps lower blood sugar and improve insulin sensitivity. Eat nutrient dense foods, low carbs, good fats and high fiber.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/intermittent-fasting\/intermittent-fasting-for-weight-loss\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Myths and Facts on Intermittent Fasting for Weight Loss"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/76aeb800c7c101831a28ba058033a099","name":"Maneera Saxena Behl","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Maneera Saxena Behl"},"description":"Maneera is a health and fitness enthusiast who is also a firm believer in the power of dietary supplements. A health buff, she likes to help others improve their overall well-being by achieving the right balance between nutrition, exercise and mindfulness.","sameAs":["https:\/\/www.facebook.com\/maneerasaxena","https:\/\/twitter.com\/https:\/\/twitter.com\/search?q=maneerasaxena&src=typd","logicalsteps19@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/maneera\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/15600"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/24"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=15600"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/15600\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16658"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=15600"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=15600"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=15600"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}