{"id":15993,"date":"2020-05-27T04:14:00","date_gmt":"2020-05-27T04:14:00","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=15993"},"modified":"2021-04-26T08:30:56","modified_gmt":"2021-04-26T08:30:56","slug":"covid-19-eat-boost-immunity","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/","title":{"rendered":"COVID-19: What Should You Eat To Boost Your Immunity?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Why_Are_These_Diet_Changes_Necessary\"><span class=\"toc_number toc_depth_1\">1<\/span> Why Are These Diet Changes Necessary?<\/a><\/li><li><a href=\"#12_Simple_Diet_Tips_To_Follow_At_Home\"><span class=\"toc_number toc_depth_1\">2<\/span> 12 Simple Diet Tips To Follow At Home<\/a><ul><li><a href=\"#1_Eat_Nutrient_Dense_Foods\"><span class=\"toc_number toc_depth_2\">2.1<\/span> 1. Eat Nutrient Dense Foods<\/a><\/li><li><a href=\"#2_Vegetables_are_Complex_Carbohydrates_Have_More_of_Them\"><span class=\"toc_number toc_depth_2\">2.2<\/span> 2. Vegetables are Complex Carbohydrates – Have More of Them<\/a><\/li><li><a href=\"#3_Dont_Forget_to_Eat_Healthy_Proteins_Each_Day\"><span class=\"toc_number toc_depth_2\">2.3<\/span> 3. Don’t Forget to Eat Healthy Proteins Each Day<\/a><\/li><li><a href=\"#4_Add_Good_Fats_to_Every_Meal\"><span class=\"toc_number toc_depth_2\">2.4<\/span> 4. Add Good Fats to Every Meal<\/a><\/li><li><a href=\"#5_Limit_Wheat_Rice\"><span class=\"toc_number toc_depth_2\">2.5<\/span> 5. Limit Wheat &amp; Rice<\/a><\/li><li><a href=\"#6_Try_and_keep_dinner_as_light_as_possible\"><span class=\"toc_number toc_depth_2\">2.6<\/span> 6. Try and keep dinner as light as possible<\/a><\/li><li><a href=\"#7_Tap_into_the_power_of_spices\"><span class=\"toc_number toc_depth_2\">2.7<\/span> 7. Tap into the power of spices <\/a><\/li><li><a href=\"#8_Cook_One_Pot_Meals\"><span class=\"toc_number toc_depth_2\">2.8<\/span> 8. Cook One Pot Meals<\/a><\/li><li><a href=\"#9_Beware_of_the_5pm_Hunger_8211_a_Big_Villain\"><span class=\"toc_number toc_depth_2\">2.9<\/span> 9. Beware of the 5pm Hunger &#8211; a Big Villain<\/a><\/li><li><a href=\"#10_Avoid_Eating_or_Drinking_anything_Cold\"><span class=\"toc_number toc_depth_2\">2.10<\/span> 10. Avoid Eating or Drinking anything Cold<\/a><\/li><li><a href=\"#11_Keep_Your_Weight_In_Check\"><span class=\"toc_number toc_depth_2\">2.11<\/span> 11. Keep Your Weight In Check<\/a><\/li><li><a href=\"#12_Manage_Sugar_Cravings\"><span class=\"toc_number toc_depth_2\">2.12<\/span> 12. Manage Sugar Cravings<\/a><\/li><\/ul><\/li><\/ul><\/div>\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-large\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Corona-Virus.jpg\" alt=\"COVID-19: What Should You Eat To Boost Your Immunity?\" class=\"wp-image-16004\"\/><\/figure><\/div>\n\n\n\n<p>We’re living in extraordinary times. With\nIndia on a 21-day lockdown to fight against COVID-19 coronavirus, we are all confined\nto our homes. <\/p>\n\n\n\n<p>Not only are we working from home, dealing\nwith household chores while self-isolating in the absence of house help, and\nmanaging bored kids, we are also struggling with limited availability of\ngroceries and fresh produce. In times like these, most of us have one question\n– what can we eat to help boost immunity?<\/p>\n\n\n\n<p>&nbsp;Truth be told, now is the time to make a few\nchanges to your diet. Even if you are otherwise healthy, it’s important to make\nsome key diet changes that help strengthen your body, give you some much needed\nenergy and also keep unwanted infections at bay.<\/p>\n\n\n\n<h2><span id=\"Why_Are_These_Diet_Changes_Necessary\"><strong>Why Are These Diet Changes Necessary?<\/strong><\/span><\/h2>\n\n\n\n<p>The human body is designed to crave\nhomeostasis – which means balance, stability and normalcy. <\/p>\n\n\n\n<p>But considering these extraordinary times, nothing feels normal. The two big changes most of us are currently dealing with are:<br><br>1.The fear\/stress\/anxiety that many of us feel because of the coronavirus pandemic. Most of us are on multiple WhatsApp groups, each of them shelling out confusing and conflicting information (which btw, is rarely accurate or even correct). This information overload throws the human body into fight or flight mode &#8212; which not only increases stress and anxiety levels but also, hampers digestion. When the body is under stress, it downregulates digestion.&nbsp; This is because digesting food requires the maximum energy consumption. When the body anticipates stress that puts it into that fight or flight state, its only job is to protect you and cut out all unnecessary physiological functions &#8212;- of which digestion is among the first. <br><br>2. Secondly, as most of us stay at home in self-isolation, our energy expenditure has gone down. Simply meaning – we are not burning as much calories as we used to before this pandemic. Gyms are closed, and most of us are avoiding morning walks and runs. Even simple tasks like walking to your car, taking a flight of stairs to your office, or going to the bus stop to pick up kids have disappeared from our lives. In such a case, there’s no need for us to eat as many calories as we did earlier, as we simply will not be able to burn them. <\/p>\n\n\n\n<p>Hence,\nthe diet that worked for you for years may not be the best right now. In this\nchanged environment, there are some simple yet effective diet changes that can\nhelp your body achieve homeostasis and also boost your immunity. Also, this\nwill help you avoid diet mistakes that could unknowingly make you gain weight.\nThe idea is to help you eat better with whatever groceries you have available\nat home, so that your diet nourishes and protects you in these uncertain times.<\/p>\n\n\n\n<h2><span id=\"12_Simple_Diet_Tips_To_Follow_At_Home\"><strong>12 Simple Diet Tips To Follow At Home<\/strong><\/span><\/h2>\n\n\n\n<h3><span id=\"1_Eat_Nutrient_Dense_Foods\">1. <strong>Eat Nutrient Dense Foods<\/strong><\/span><\/h3>\n\n\n\n<p>What are nutrient dense foods? These are foods that offer you maximum amount of nutrition with every mouthful. Think healthy carbs, protein rich foods and good fats. Essentially, this means you should focus on eating a balanced diet instead of resorting to instant noodles, biscuits and packaged foods.<\/p>\n\n\n\n<h3><span id=\"2_Vegetables_are_Complex_Carbohydrates_Have_More_of_Them\">2. <strong>Vegetables are Complex Carbohydrates – Have More of Them<\/strong><\/span><\/h3>\n\n\n\n<figure class=\"wp-block-image size-medium img-responsive\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2019\/07\/Water-Rich-Vegetables-365x176.jpg\" alt=\"img-responsive\" class=\"wp-image-15763\"\/><\/figure>\n\n\n\n<p>They don’t just offer you energy to better handle the stressors of your everyday life, but are also chock full of essential vitamins and minerals. Opt for whatever fresh produce you can find, the more local and seasonal – the better. Don’t stress that you can’t find iceberg lettuce and kale at local vendors; instead focus on eating readily available vegetables like spinach, carrots, bottle gourd, okra, brinjal and cabbage. If possible, eat at least 2 veggies in each meal. The more green or colourful they are &#8211; the better. <\/p>\n\n\n\n<h3><span id=\"3_Dont_Forget_to_Eat_Healthy_Proteins_Each_Day\">3. <strong>Don’t Forget to Eat Healthy Proteins Each Day<\/strong><\/span><\/h3>\n\n\n\n<figure class=\"wp-block-image size-medium img-responsive\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Protiens-365x176.jpg\" alt=\"\" class=\"wp-image-15995\"\/><\/figure>\n\n\n\n<p>Proteins help your body build antibodies to fight infections and also\nbuild haemoglobin. Also, they are calorie dense foods that help you feel full\nfor longer, keeping cravings at bay. Add a good source of protein to every\nmeal. Dals, chana, rajma, eggs, chicken and fish are all good options. <\/p>\n\n\n\n<p>Pls Note: The coronavirus is very different from bird flu. As of date, there is no evidence that chicken or other poultry items transmit the virus. So chicken is safe. Additionally, it’s easier to store chicken and eggs in the fridge\/freezer to cook a balanced meal on days fresh produce isn’t easily available. <\/p>\n\n\n\n<h3><span id=\"4_Add_Good_Fats_to_Every_Meal\">4. <strong>Add Good Fats to Every Meal<\/strong><\/span><\/h3>\n\n\n\n<figure class=\"wp-block-image size-medium img-responsive\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2018\/06\/Nuts-and-seeds-365x176.jpg\" alt=\"\" class=\"wp-image-15148\"\/><\/figure>\n\n\n\n<p>Yes, I know\nyou are sitting at home all day and probably want to eat a low-fat diet. But\nFats DON’T make you fat!!! Instead, fats are a dense source of energy. In fact,\nthey have 2.25 times more energy as compared to carbs and protein. In these\nstressful times when we are constantly worrying and also handling all household\nchores along with work pressure, we can do with a little extra energy! A small\namount of good fats can help keep you satisfied for longer.<\/p>\n\n\n\n<ul><li>Add ghee to rice, roti and paranthas.<\/li><li>Put butter on your toast. <\/li><li>Snack on a handful of nuts – almonds, cashews and walnuts are all good options. <\/li><li>Cook with coconut oil, or grate some fresh coconut on your sabji. <\/li><\/ul>\n\n\n\n<h3><span id=\"5_Limit_Wheat_Rice\">5. <strong>Limit Wheat &amp; Rice<\/strong><\/span><\/h3>\n\n\n\n<figure class=\"wp-block-image size-medium img-responsive\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Wheat-and-Rice-365x176.jpg\" alt=\"\" class=\"wp-image-15999\"\/><\/figure>\n\n\n\n<p>While wheat\nand rice are the most widely available and consumed grains in India, remember\nthat these are simple carbs. Simple carbohydrates get digested very quickly and\nlead to a rapid post-meal sugar drop. If you are working from home and need to\nstay at your computers post a meal, you are likely to feel more sleepy and\ntired after a big meal containing rice and roti. So what can you do?<\/p>\n\n\n\n<ul><li>Cut back on the quantity you eat. &nbsp;Reduce your portion size by one roti less or ½ bowl of rice at lunch. This doesn’t mean that you should starve yourself. So instead, increase your quality of dal, sabji or dahi to make up.<\/li><li>An even better idea is to swap your afternoon rice meal for more complex grains, if and when possible. Opt for millets, ragi or nachni, jowar, amaranth or even quinoa. If you live in colder climate, bajra is another good option, but avoid bajra if you live in warmer climate as this grain is very warming to the body. <\/li><\/ul>\n\n\n\n<h3><span id=\"6_Try_and_keep_dinner_as_light_as_possible\"><strong>6. Try and keep dinner as light as possible<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"aligncenter size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Light-Dinner-365x176.jpg\" alt=\"Light Dinner\" class=\"wp-image-15998\"\/><\/figure><\/div>\n\n\n\n<p>Ayurveda says\nthat our digestive fire is highest at noon, but wanes or drops as the evening\nprogresses. When you stay at home all day with limited movement, this digestion\nprocess is likely to be even lower. When you just aren’t burning enough calories,\nthere is no need to eat a heavy dinner. Our recommendation: Have just a soup n\nsubzi for dinner, or a fresh salad when possible. Avoid grain if you can.<\/p>\n\n\n\n<h3><span id=\"7_Tap_into_the_power_of_spices\">7. <strong>Tap into the power of spices <\/strong><\/span><\/h3>\n\n\n\n<figure class=\"wp-block-image size-medium img-responsive\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Spices-365x176.jpg\" alt=\"\" class=\"wp-image-15996\"\/><\/figure>\n\n\n\n<p>This is to not\njust add more flavour to your food, but also boost your immunity. Every Indian\nhome is stocked with spices, herbs and masalas that are great for health.\nTurmeric, garlic, ginger, cinnamon, clove, dhaniya seeds and ajwain (carom\nseed)<br>\nare just a few great examples. &nbsp;In times\nof the coronavirus scare, these spices play a star role in your diet. <\/p>\n\n\n\n<p>Spices are high\nin antioxidants which help fight infections. Many boost digestive health and\noffer anti-inflammatory benefits as well. Haldi (or turmeric) for example helps\nrelease mucus. How can we have them? <\/p>\n\n\n\n<ul><li>Sip on a homemade herbal tea: hot or warm. Personally, I don’t have regular tea with milk and sugar anymore. Instead, I start my day with a cup of herb and spice tea. To make &#8211; boil plenty of ginger, pudina or mint, and lemongrass. Strain and drink this. This super energising, fantastic pick me up ensures you put all the good stuff into your body first thing in the morning.<\/li><li>Use spices to flavour all dry subjis, curries and gravies. The added flavour makes your meal super satiating.  <\/li><li>Sip on cinnamon flavoured water to keep cravings at bay. <\/li><li> Try a few recipes for Indian\/desi soups with spices: Just fry cloves jaiphal, cinnamon, ginger &amp; garlic in a pan. Add tomatoes and whatever veggies you have in your kitchen. Boil until cooked. Add salt to taste. You can either serve this as a simple clear soup, or blend the soup for a thicker consistency. <\/li><\/ul>\n\n\n\n<h3><span id=\"8_Cook_One_Pot_Meals\">8. <strong>Cook One Pot Meals<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"alignright size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/One-Pot-Meal1-365x176.jpg\" alt=\"\" class=\"wp-image-16000\"\/><\/figure><\/div>\n\n\n\n<p>In these times\nwhen we have limited groceries and time (hello, mothers trying to feed a full\nhouse while also working from home!), the smartest thing to do is to make One\nPot Meals. One Pot Meals are both nutritious and convenient. You can add a\nvariety of healthy nutrients to a single pot meal that cooks fast, and you have\nfewer utensils to wash later!<\/p>\n\n\n\n<p>Our recommendations:<\/p>\n\n\n\n<ul><li>Make a Khichdi with veggies by rotating the dals: tuvar, chana, moong. <\/li><li>Try a one pot Chicken and Rice meal – an easier alternative to chicken biryani. <\/li><li>Make some spicy Bisibele bath – the sambar rice &amp; vegetable combo from Karnataka. <\/li><li>A simple yet fresh Millet pulao with mint leaves is an amazing healthy option. <\/li><li> Get in proteins with a Kala Chana pulao.  <\/li><\/ul>\n\n\n\n<p>Honestly, I\nalways feel Indian should make their cooking simpler by opting for one pot\nmeals. And there is no dearth of options! Get creative!<\/p>\n\n\n\n<h3><span id=\"9_Beware_of_the_5pm_Hunger_8211_a_Big_Villain\">9. <strong>Beware of the 5pm Hunger &#8211; a Big Villain<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"alignright size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Hunger-Pangs-365x176.jpg\" alt=\"Evening hunger pangs\" class=\"wp-image-16001\"\/><\/figure><\/div>\n\n\n\n<p>It’s worse\nwhen everyone is at home. And honestly, the task becomes more challenging with\nkids and adults – all at home. Avoid succumbing to the comforting delights of\npakoras or onion bhajiyas. This doesn’t mean you can’t have your favourite\nfried foods at all – but make sure these are only occasional treats and don’t\nbecome an everyday affair. Since our focus is to build immunity, pick on\nseveral healthy options instead. <\/p>\n\n\n\n<p>Some easy tips:<\/p>\n\n\n\n<ul><li>Avoid biscuits, however easy they seem. They are just baked maida, butter and sugar, and don’t really offer any real nutrition. Instead, have few almonds with evening chai.<\/li><li> If you have leftover chapati from lunch – make khakras.<\/li><li>Take Peanuts\/boiled chana &amp; toss with onions &amp; tomatoes for a quick snack.<\/li><li>For kids, Fruit &amp; dahi or Cheese cubes &amp; nuts can be an exciting snack.<\/li><li>Roasted Makhana or Foxnuts make for a quick snack when tossed with fresh herbs or spices. <\/li><\/ul>\n\n\n\n<h3><span id=\"10_Avoid_Eating_or_Drinking_anything_Cold\">10. <strong>Avoid Eating or Drinking anything Cold<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"alignright size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Cold-Foods-365x176.jpg\" alt=\"Cold Foods\" class=\"wp-image-16002\"\/><\/figure><\/div>\n\n\n\n<p>This is one\nBIG caution. Do not lower your immunity by damaging your throat or stressing\nthe respiratory system. Avoid chilled water and keep away from ice-creams and\nsodas. Opt for room <strong>temperature water at all times.<\/strong><strong><\/strong><\/p>\n\n\n\n<h3><span id=\"11_Keep_Your_Weight_In_Check\">11. <strong>Keep Your Weight In Check<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"alignright size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2018\/08\/Weight-Control-and-Hypothyroid-365x176.jpg\" alt=\"\" class=\"wp-image-15243\"\/><\/figure><\/div>\n\n\n\n<p>And that\nbrings us to an important point &#8211; How to avoid putting on weight when\nhousebound? Here are some tricks to keep moving and avoid mindless snacking:<\/p>\n\n\n\n<ul><li>Take 100 steps after each meal. Do this in the house. Walk in the living room, around the dining table or go from one room to room. If you are quarantined in a room, just walk around the bed. You need to move what you’ve just eaten to aid digestion.<\/li><li> Avoid stress eating. It’s the easiest way to pile on unwanted calories.&nbsp; When you feel like snacking, ask yourself a simple question &#8211; am I really hungry? Or am I just bored? <\/li><li>If you’re working from home (where you have easy access to the kitchen and all the snacks in it!) adopt a simple technique to cut back snacking. Keep a bottle of flavoured water next to you and take frequent sips. Believe it or not, many a times the human brain mistakes thirst for hunger. Infusing lemon, mint or even a slice of orange in water tricks your brain into feeling satiated, and keeps you from reaching out for that packet of namkeen. <\/li><\/ul>\n\n\n\n<h3><span id=\"12_Manage_Sugar_Cravings\">12. <strong>Manage Sugar Cravings<\/strong><\/span><\/h3>\n\n\n\n<div class=\"wp-block-image img-responsive\"><figure class=\"alignright size-medium\"><img src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Sugar-365x176.jpg\" alt=\"Sugar Cravings\" class=\"wp-image-15997\"\/><\/figure><\/div>\n\n\n\n<p>Many of us\nexperience sugar cravings. And it’s much easier to succumb to it when you’re at\nhome, and the kitchen is within your reach. At a time when our focus should be\non building immunity, sugar is a villain. Sugar raises blood sugar levels and\nalso triggers an inflammatory response in the body.<\/p>\n\n\n\n<p>So, what can you do to\nkeep sugar cravings at bay?<\/p>\n\n\n\n<ul><li>Sip on cinnamon flavoured water through the day. Infuse a stick of cinnamon into a bottle of water. It has a sweet taste without the downside of sugar.<\/li><li> Sip on a cup of green tea after a meal.<\/li><li>Chew really well on teaspoon of saunf or fennel seeds after a meal. This works brilliantly for me. <\/li><li>And if you’re still going crazy with the craving: have 1 small piece of dark chocolate or chikki. JUST one. Skip the mithai.  <\/li><\/ul>\n\n\n\n<p>At\nSepalika, we believe Food is Medicine. And our hope is that in such vulnerable\ntimes, this is what each of us can do &#8211; USE food to protect ourselves. <\/p>\n\n\n\n<p>I will\nsign off with one advice I give each and every client we work with: 5 deep\nbelly breaths before each meal. In…&amp; Out…In…&amp; Out…This Gets the body\ninto parasympathetic state where foods digest well and is absorbed better. <\/p>\n\n\n\n<p>Stay\nCalm. Stay Safe. Stay Healthy.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Why Are These Diet Changes Necessary?2 12 Simple Diet Tips To Follow At Home2.1 1. Eat Nutrient Dense Foods2.2 2. Vegetables are Complex Carbohydrates – Have More of Them2.3 3. Don’t Forget to Eat Healthy Proteins Each Day2.4 4. Add Good Fats to Every Meal2.5 5. Limit Wheat &amp; Rice2.6 6. Try [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":16407,"comment_status":"open","ping_status":"closed","sticky":true,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[69],"tags":[96,97],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>COVID 19 - What to Eat to Boost Your Immunity | Sepalika<\/title>\n<meta name=\"description\" content=\"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"COVID 19 - What to Eat to Boost Your Immunity | Sepalika\" \/>\n<meta property=\"og:description\" content=\"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/sharda.agarwal.944\" \/>\n<meta property=\"article:published_time\" content=\"2020-05-27T04:14:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-26T08:30:56+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Corona-Virus.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@ShardaAgarwal\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sharda Agarwal\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/\",\"name\":\"COVID 19 - What to Eat to Boost Your Immunity | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#primaryimage\"},\"datePublished\":\"2020-05-27T04:14:00+00:00\",\"dateModified\":\"2021-04-26T08:30:56+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c\"},\"description\":\"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"COVID-19: What Should You Eat To Boost Your Immunity?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c\",\"name\":\"Sharda Agarwal\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g\",\"caption\":\"Sharda Agarwal\"},\"description\":\"Sharda Agarwal is a qualified Functional Nutrition Therapy Practitioner &amp; a Certified Blood Chemistry Analyst. She first used dietary supplements to overcome a debilitating migraine she suffered for years. Since then she has studied the subjects of nutrition and nutrients extensively. She uses this to manage the health of her family at home and with Sepalika.\",\"sameAs\":[\"https:\/\/www.sepalika.com\",\"https:\/\/www.facebook.com\/sharda.agarwal.944\",\"https:\/\/twitter.com\/ShardaAgarwal\"],\"url\":\"https:\/\/www.sepalika.com\/author\/sharda-agarwal\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"COVID 19 - What to Eat to Boost Your Immunity | Sepalika","description":"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/","og_locale":"en_US","og_type":"article","og_title":"COVID 19 - What to Eat to Boost Your Immunity | Sepalika","og_description":"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.","og_url":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/sharda.agarwal.944","article_published_time":"2020-05-27T04:14:00+00:00","article_modified_time":"2021-04-26T08:30:56+00:00","og_image":[{"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2020\/03\/Corona-Virus.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@ShardaAgarwal","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Sharda Agarwal","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#primaryimage","url":"","contentUrl":""},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#webpage","url":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/","name":"COVID 19 - What to Eat to Boost Your Immunity | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#primaryimage"},"datePublished":"2020-05-27T04:14:00+00:00","dateModified":"2021-04-26T08:30:56+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c"},"description":"The best way to fight a virus infection is to boost immunity with nutrient dense foods, good fats and low carbs. When confined to the home, eat sensibly. Cut the sugar. Use spices. Focus on veggies.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/covid-19-eat-boost-immunity\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"COVID-19: What Should You Eat To Boost Your Immunity?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/db602f68a14fc56f00153a11e8f6968c","name":"Sharda Agarwal","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/acefdd784ffe94fada1afacf174ced14?s=96&d=mm&r=g","caption":"Sharda Agarwal"},"description":"Sharda Agarwal is a qualified Functional Nutrition Therapy Practitioner &amp; a Certified Blood Chemistry Analyst. She first used dietary supplements to overcome a debilitating migraine she suffered for years. Since then she has studied the subjects of nutrition and nutrients extensively. She uses this to manage the health of her family at home and with Sepalika.","sameAs":["https:\/\/www.sepalika.com","https:\/\/www.facebook.com\/sharda.agarwal.944","https:\/\/twitter.com\/ShardaAgarwal"],"url":"https:\/\/www.sepalika.com\/author\/sharda-agarwal\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/15993"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=15993"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/15993\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16407"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=15993"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=15993"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=15993"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}