{"id":16251,"date":"2021-01-07T16:20:56","date_gmt":"2021-01-07T16:20:56","guid":{"rendered":"https:\/\/www.sepalika.com\/?p=16251"},"modified":"2022-03-08T12:29:35","modified_gmt":"2022-03-08T06:59:35","slug":"doctors-now-show-how-type-2-diabetes-is-fully-reversible","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/","title":{"rendered":"Doctors Now Show How Type 2 Diabetes Is Fully Reversible"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Mantra_1_For_Reversing_Diabetes_Low_Carbohydrate_High_Fat_LCHF_Diet\"><span class=\"toc_number toc_depth_1\">1<\/span> Mantra #1 For Reversing Diabetes: Low Carbohydrate High Fat (LCHF) Diet<\/a><ul><li><a href=\"#Why_Eat_Healthy_Fats_Arent_They_Just_As_Bad_For_Diabetics\"><span class=\"toc_number toc_depth_2\">1.1<\/span> Why Eat Healthy Fats? Aren’t They Just As Bad For Diabetics?<\/a><\/li><\/ul><\/li><li><a href=\"#Mantra_2_For_Reversing_Diabetes_Intermittent_Fasting\"><span class=\"toc_number toc_depth_1\">2<\/span> Mantra #2 For Reversing Diabetes: Intermittent Fasting<\/a><\/li><li><a href=\"#Reversing_Diabetes_The_Mini_Mantras\"><span class=\"toc_number toc_depth_1\">3<\/span> Reversing Diabetes: The Mini Mantras<\/a><\/li><li><a href=\"#Remission_Of_Diabetes_Making_It_Last\"><span class=\"toc_number toc_depth_1\">4<\/span> Remission Of Diabetes: Making It Last<\/a><\/li><\/ul><\/div>\n\n<p><strong>Today, medical doctors say that Type 2 diabetes is completely reversible.<\/strong><\/p>\n\n\n\n<p>In a video titled “The Two Big Lies of Type 2 Diabetes”, Jason Fung, M.D. makes a very bold assertion. He says “Diabetes is not a chronic, progressive disease. It is completely reversible; not only that, it is very quickly reversible.”<\/p>\n\n\n\n<p>Take a minute. Let that sink in.<\/p>\n\n\n\n<p><strong>“TYPE-2-DIABETES-IS-COMPLETELY-REVERSIBLE”<\/strong><\/p>\n\n\n\n<p>A doctor with a mainstream medical degree who claims complete reversal of diabetes should attract debate, discussion and curiosity, right? Unfortunately, the video itself is quite technical in parts because it’s a presentation at a medical conference. So, that might have held back some popularity.<\/p>\n\n\n\n<p>Equally, if not more importantly, maybe it is because his assertion flies in the face of everything we have been taught about T2D. We all believe that:<\/p>\n\n\n\n<p>A.Diabetes is a disease for life<\/p>\n\n\n\n<p>B.All one can do is progressively increase their medication to control the blood sugar (even as diabetes complications continue to affect other organ systems – from the kidneys to the nerves to the eyes and the heart.)<\/p>\n\n\n\n<p>Those, according to Dr. Fung, are the Two Big Lies of Type 2 Diabetes. He’s taking on the American Diabetes Association with these assertions.<\/p>\n\n\n\n<p>Luckily, he’s not the only M.D. who believes this. Dr. Mark Hyman, Dr. Joseph Mercola, Dr. Mehmet Oz and Dr. Andrew Weil are just a few of the heavyweights in the small, but growing, pack of<a href=\"https:\/\/www.deathtodiabetes.com\/doctors-admit-diabetes-reversible.php#List%20of%20Doctors\">&nbsp;functional medicine doctors<\/a>&nbsp;who are not just stating that Type 2 Diabetes is reversible, but are actually proving this at their clinics!<\/p>\n\n\n\n<h2><span id=\"Mantra_1_For_Reversing_Diabetes_Low_Carbohydrate_High_Fat_LCHF_Diet\">Mantra #1 For Reversing Diabetes: Low Carbohydrate High Fat (LCHF) Diet<\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"779\" height=\"309\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/Low-Carbohydrate-High-Fat-LCHF-Diet.webp\" alt=\"diabetes\" class=\"wp-image-21271\"\/><figcaption>Low Carbohydrate High Fat (LCHF) Diet<\/figcaption><\/figure>\n\n\n\n<p>Dr. Fung defines diabetes as a “curable dietary disease.” If the disease is dietary, it stands to reason that the cure would be dietary too.<\/p>\n\n\n\n<p>The LCHF diet is the first pillar of the diabetes reversal. Here’s why:<\/p>\n\n\n\n<p>All prescription medications given to diabetics have a single, self-stated goal, which is to bring down blood sugar levels. The carbohydrates you’ve ingested turn into sugar after digestion. The more the carbs, the higher the sugar content in the blood. This results in more insulin being required to push them into your cells.<\/p>\n\n\n\n<p>The liver is one of the primary places where excess sugar is stored as, both, sugar and fats. The excess carbs that you consume turn into excess sugar. Continue this repetitive process of putting excess carbs into your body, and your cells will begin to “resist” the insulin from shoving more sugar into them.<\/p>\n\n\n\n<p>Soon, the pancreas begins to turn fatty too. These organs just don’t have room to do their other tasks, since all of it is taken up by excess sugar. Before you know it, you’re saying hello to insulin resistance, fatty liver and fatty pancreas, all of which are precursors of full blown type 2 diabetes.<\/p>\n\n\n\n<p>Ideally, excess sugar and fats in the liver should be used up by the body during periods of fasting. That’s how the fatty liver becomes “not so fatty” again.<\/p>\n\n\n\n<p>So, it should be obvious by now that&nbsp;<strong>if you cut your intake of carbs drastically, your body will be forced to use the sugar and fats stored in the liver<\/strong>. That is the “Low Carb” part of the LCHF diet.<\/p>\n\n\n\n<h3><span id=\"Why_Eat_Healthy_Fats_Arent_They_Just_As_Bad_For_Diabetics\">Why Eat Healthy Fats? Aren’t They Just As Bad For Diabetics?<\/span><\/h3>\n\n\n\n<p>So you say, “OK, I got it. I need to eat little or no carbs, because they turn into sugar in my blood. But wait, you’re also asking me to eat more saturated fat? My doctor says I have to cut down on fats and keep them to the minimum, to protect my heart!”<\/p>\n\n\n\n<p>Sadly, we’ve all been misled by the processed food and sugar lobby. Natural saturated fats have been projected as villains over the last 60-70 years. Back then, when the processed food lobby realized that carbs and sugars were the likeliest cause of widespread chronic disease, they needed a scapegoat.<\/p>\n\n\n\n<p>And there stood butter, olive oil, ghee, natural fats found in fish and meat, the things we had safely eaten for millennia. But, they had no organized lobby to fight back, unlike the newly discovered vegetable oil and processed food industry. There was too much money to be made with sugars, processed carbs, vegetable oils and trans fats. A zillion things could be created at a low cost and sold to the unsuspecting public. From Dunkin Donuts to Twinkies to just plain bread and sweetened breakfast cereal, this industry was all set to eliminate natural saturated fats from the minds of the public.<\/p>\n\n\n\n<p>Soon, research was “produced” to brand natural saturated fats as the black sheep. Nation after nation took to hydrogenated vegetable oils, processed breakfast cereal, toast and egg whites as “health food”. In the meantime, they shunned butter and egg yolks and fatty fish since they were believed to be artery-chokers.<\/p>\n\n\n\n<p>But, nothing could be further from the truth.<\/p>\n\n\n\n<p>Once again, it is the good M.Ds, the ones with a conscience, who have blown the lid off the cholesterol scam. Dr. Malcolm Kendrick, a Scottish doctor and medical investigator, wrote his&nbsp;<a href=\"https:\/\/drmalcolmkendrick.org\/books-by-dr-malcolm-kendrick\/the-great-cholesterol-con\/\">best seller<\/a>&nbsp;“The Great Cholesterol Con” in 2007.&nbsp; As more and more practicing doctors have come out in defense of good fats being the bedrock of good health, the U.S government has relented and taken cholesterol off the “naughty list” just&nbsp;<a href=\"http:\/\/edition.cnn.com\/2015\/02\/19\/health\/dietary-guidelines\/\">last year<\/a>.<\/p>\n\n\n\n<p>But, what do good fats really do?<\/p>\n\n\n\n<ul><li>They help you feel fuller sooner.<\/li><li>They give you real nutrition (including the fat-soluble vitamins K, E, D and A and the Omega 3 fatty acids DHA and EPA.)<\/li><li>They form a steady, slow burning and reliable source of fuel that your body can use in place of sugars (which are volatile and cause highs and lows.)<\/li><li>These fats also contribute positively to your cardiac health, keeping your arteries flexible and younger for longer.<\/li><\/ul>\n\n\n\n<p>So, while you lower your intake of carbs to reduce your diabetes, you need to work with your doctor to add more good fats to your diet. Also, learn to include fresh vegetables, seasonal fruits and correctly soaked and sprouted whole grains to your diet. You can easily understand these concepts through the&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-food-pyramid-build-your-health-back-up\/\">new diabetes food pyramid<\/a>. We’ve also put together a whole bunch of&nbsp;<a href=\"https:\/\/www.sepalika.com\/diet\/lunch-and-dinner\/\">recipes&nbsp;<\/a>that conform to the LCHF way of eating. This way, you can completely rewire the way your body handles food and blood sugar.<\/p>\n\n\n\n<h2><span id=\"Mantra_2_For_Reversing_Diabetes_Intermittent_Fasting\">Mantra #2 For Reversing Diabetes: Intermittent Fasting<\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"779\" height=\"415\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/intermittent-fasting.webp\" alt=\"diabetes\" class=\"wp-image-21270\"\/><figcaption>intermittent fasting<\/figcaption><\/figure>\n\n\n\n<p>Actually, this could well be Mantra #1, since the LCHF diet kicks in after this first step, which is&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-to-reverse-type-2-diabetes\/\"><strong>intermittent fasting<\/strong><\/a>.<\/p>\n\n\n\n<p>The human physiology has evolved over millennia for periods of feasting and fasting. When you feast, insulin peaks to remove excess sugars and fats that you consume from the blood stream. It stores them away in the liver and in fat tissue for future use.<\/p>\n\n\n\n<p>When you fast, insulin levels go down and these fats gets pulled out of the liver and the fat cells to be used as energy. This is the natural cycle of human life.<\/p>\n\n\n\n<p>When we used to hunt and gather food, this cycle was supported naturally. We went with little or no food during hunting periods or wandered in search of food because our hunger peaked. When we found food, we feasted for a good few days.<\/p>\n\n\n\n<p>As agricultural societies replaced hunting and gathering, our forefathers understood that we would lose this natural, healthy practice of fasting. Anthropologists feel that this may be why every religion and community in the world has periods of fasting built into it, that is, to&nbsp;<a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC2995774\/\">foster good health<\/a>.<\/p>\n\n\n\n<p><strong>To begin with, eating only 3 meals a day, instead of 6, is the first step of simple intermittent fasting.<\/strong>&nbsp;The habit of having a 12-hour break between dinner and breakfast can reduce your fasting blood sugar levels, and more importantly, your insulin resistance.<\/p>\n\n\n\n<p>Then, working with a qualified practitioner, you could increase your fasting periods, slowly. You could build up to whole-day fasts and gradually go up to several days. As impossible as that sounds, most diabetics who have learnt to fast will tell you that your hunger pangs disappear after Day 2. Your body simply begins to pull sugar and fats out of its storage to run your system.<\/p>\n\n\n\n<p>I’ve done up to 3-day long fasts and can personally vouch for the amazing clarity and energy one feels after doing it correctly.<\/p>\n\n\n\n<p>Dr. Fung’s video, which we’ve attached at the end of this piece, has patient testimonials to this effect. People explain how fasting helped them get off their medications, turn non-diabetic and enjoy their life.<\/p>\n\n\n\n<h2><span id=\"Reversing_Diabetes_The_Mini_Mantras\">Reversing Diabetes: The Mini Mantras<\/span><\/h2>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"779\" height=\"309\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/The-Mini-Mantras.webp\" alt=\"diabetes\" class=\"wp-image-21268\"\/><figcaption>The Mini Mantras<\/figcaption><\/figure>\n\n\n\n<p>The first two mantras are at the core of reversing diabetes. They require you to work with a qualified medical practitioner since you, also, need to wean you off your medications. However, there are a few other mini mantras that can help support you during this journey. They are:<\/p>\n\n\n\n<ol><li><strong>Exercise:<\/strong>&nbsp;Getting the&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/type-2-diabetes-exercise\/\">right exercise<\/a>, proven by research, is a great way to reduce insulin resistance. Both, aerobic exercise and weight training, can help. A&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-does-exercise-help-diabetes\/\">good exercise plan<\/a>&nbsp;will always start slow and build up strength and ability.<\/li><li><strong>Yoga:<\/strong>&nbsp;We’re making this a separate point because&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/yoga-for-diabetes\/\">yoga<\/a>&nbsp;has been shown to work on, both, the body and the mind. There are specific&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/top-5-yoga-asanas-for-diabetes\/\">yoga poses<\/a>, or asanas, that have been researched upon as being specifically beneficial to diabetics. You can find<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-exercise\/\">&nbsp;video demonstrations<\/a>&nbsp;by an expert here. Yoga also benefits the nervous system since several&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/alternate-nostril-breathing-benefits\/\">breathing exercises&nbsp;<\/a>(called pranayama) have shown to reduce systemic stress and consequent sudden sugar demands.<\/li><li><strong>Meditation:<\/strong>&nbsp;Stress is a huge contributor to modern day chronic diseases, including diabetes. By adding a&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/stress-meditation-type-2-diabetes\/\">simple meditation technique<\/a>&nbsp;to your daily routine, you can smoothen adrenaline-driven sugar surges and dips.<\/li><li><strong>Dietary Supplements:<\/strong>&nbsp;Don’t mistake these for medications that you will need to be on for life. They are to be used for a specific period at specific doses to help support you on the journey of becoming non-diabetic. Diabetics are often found to have&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/vitamins-for-diabetics\/\">low levels of vitamins<\/a>, especially water-soluble vitamins like Vitamin C and the B Vitamins. This is because they pass too much urine and these vitamins get washed off. What’s more is that the very diabetic medicines they are put on<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/type-2-diabetes-drugs-side-effects\/\">&nbsp;steal nutrients<\/a>&nbsp;from their body. They cause side effects that lead to several<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/type-2-diabetes-complications\/\">&nbsp;diabetic complications<\/a>. Putting them back can help rebuild their nutritional status.&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/14-amazing-herbs-that-lower-blood-sugar\/\">Certain herbs&nbsp;<\/a>have also been used in traditional medicine systems for thousands of years to help diabetics. These can be used under supervision to help them heal faster too.<\/li><li><strong>Gastric surgery<\/strong>: If you’ve been clinically certified as being morbidly obese, you might benefit from gastric banding or bariatric surgery. In such a surgery, the volume of the stomach is reduced to that of a walnut. Do remember that it comes with severe portion restrictions for the rest of your life.&nbsp;<strong>So, consider this option only if you are clinically very obese<\/strong>. Otherwise,&nbsp;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-weight-loss-type-2\/\">losing weight<\/a>&nbsp;through the right diet can also make a huge difference on your journey to becoming non-diabetic again.<\/li><\/ol>\n\n\n\n<h2><span id=\"Remission_Of_Diabetes_Making_It_Last\">Remission Of Diabetes: Making It Last<\/span><\/h2>\n\n\n\n<p>Diabetes is said to be in remission when A1c and fasting blood glucose levels are normal for more than a year, without any diabetes medication. Remission of diabetes can occur, with a holistic approach to reversing the condition. Through diet, exercise, lifestyle changes and stress management, you are reversing your diabetes. Throughout this article, we use the term “reversal” and not “treat.” This is because if you go back to your old lifestyle, your diabetes will likely come back; meaning, if you stop doing all the good things you did, you come out of remission. So stick with the reversal plan and you can make your remission last.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 Mantra #1 For Reversing Diabetes: Low Carbohydrate High Fat (LCHF) Diet1.1 Why Eat Healthy Fats? Aren’t They Just As Bad For Diabetics?2 Mantra #2 For Reversing Diabetes: Intermittent Fasting3 Reversing Diabetes: The Mini Mantras4 Remission Of Diabetes: Making It Last Today, medical doctors say that Type 2 diabetes is completely reversible. In [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":16422,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[112],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika\" \/>\n<meta property=\"og:description\" content=\"In This Article1 Mantra #1 For Reversing Diabetes: Low Carbohydrate High Fat (LCHF) Diet1.1 Why Eat Healthy Fats? Aren’t They Just As Bad For Diabetics?2 Mantra #2 For Reversing Diabetes: Intermittent Fasting3 Reversing Diabetes: The Mini Mantras4 Remission Of Diabetes: Making It Last Today, medical doctors say that Type 2 diabetes is completely reversible. In [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:author\" content=\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-07T16:20:56+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-03-08T06:59:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"350\" \/>\n\t<meta property=\"og:image:height\" content=\"350\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Mahesh Jayaraman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg\",\"width\":350,\"height\":350,\"caption\":\"diabetes\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/\",\"name\":\"Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#primaryimage\"},\"datePublished\":\"2021-01-07T16:20:56+00:00\",\"dateModified\":\"2022-03-08T06:59:35+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\"},\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Doctors Now Show How Type 2 Diabetes Is Fully Reversible\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4\",\"name\":\"Mahesh Jayaraman\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g\",\"caption\":\"Mahesh Jayaraman\"},\"description\":\"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.\",\"sameAs\":[\"http:\/\/sepalika.com\",\"https:\/\/www.facebook.com\/profile.php?id=100009879845215\",\"sepalika-adm\"],\"url\":\"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/","og_locale":"en_US","og_type":"article","og_title":"Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika","og_description":"In This Article1 Mantra #1 For Reversing Diabetes: Low Carbohydrate High Fat (LCHF) Diet1.1 Why Eat Healthy Fats? Aren’t They Just As Bad For Diabetics?2 Mantra #2 For Reversing Diabetes: Intermittent Fasting3 Reversing Diabetes: The Mini Mantras4 Remission Of Diabetes: Making It Last Today, medical doctors say that Type 2 diabetes is completely reversible. In [&hellip;]","og_url":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_author":"https:\/\/www.facebook.com\/profile.php?id=100009879845215","article_published_time":"2021-01-07T16:20:56+00:00","article_modified_time":"2022-03-08T06:59:35+00:00","og_image":[{"width":350,"height":350,"url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Mahesh Jayaraman","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2021\/01\/blog-image-7.jpg","width":350,"height":350,"caption":"diabetes"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#webpage","url":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/","name":"Doctors Now Show How Type 2 Diabetes Is Fully Reversible - Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#primaryimage"},"datePublished":"2021-01-07T16:20:56+00:00","dateModified":"2022-03-08T06:59:35+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4"},"breadcrumb":{"@id":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/doctors-now-show-how-type-2-diabetes-is-fully-reversible\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Doctors Now Show How Type 2 Diabetes Is Fully Reversible"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/50bdce7d81a95476b9cb87dd186a89d4","name":"Mahesh Jayaraman","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b9a641d58e9a1d4d16059e686b9e9306?s=96&d=mm&r=g","caption":"Mahesh Jayaraman"},"description":"Mahesh is a hormone health counsellor &amp; holistic health expert. He has a Mastery Certification in Functional Blood Chemistry Analysis from the US, is certified in Functional Nutrition from Washington State University and uses a wide array of healing modalities to guide his clients to vibrant health and well-being.","sameAs":["http:\/\/sepalika.com","https:\/\/www.facebook.com\/profile.php?id=100009879845215","sepalika-adm"],"url":"https:\/\/www.sepalika.com\/author\/mahesh-jayaraman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/16251"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=16251"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/16251\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/16422"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=16251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=16251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=16251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}