{"id":2898,"date":"2016-11-14T12:07:48","date_gmt":"2016-11-14T12:07:48","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=2898"},"modified":"2021-12-15T13:18:25","modified_gmt":"2021-12-15T07:48:25","slug":"diabetes-diet-myths-busted","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/","title":{"rendered":"9 Common Diabetic Diet Myths Busted!"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#1_Rice_Is_Bad_for_Diabetes_Not_True\"><span class=\"toc_number toc_depth_1\">1<\/span> 1. Rice Is Bad for Diabetes: Not True\n<\/a><\/li><li><a href=\"#2_Six_Meals_Are_Better_Than_Three_Meals_Not_True\"><span class=\"toc_number toc_depth_1\">2<\/span> 2. Six Meals Are Better Than Three Meals: Not True<\/a><\/li><li><a href=\"#3_Fasting_Is_Not_Good_for_Diabetes_Not_True\"><span class=\"toc_number toc_depth_1\">3<\/span> 3. Fasting Is Not Good for Diabetes: Not True<\/a><\/li><li><a href=\"#4_Calories_Are_What_Matter_You_Can_Get_it_from_Carbs_Or_Fats_Not_True\"><span class=\"toc_number toc_depth_1\">4<\/span> 4. Calories Are What Matter; You Can Get it from Carbs Or Fats: Not True<\/a><\/li><li><a href=\"#5_Sugar_Substitutes_Are_A_Great_Way_to_Replace_Sugar_Not_True\"><span class=\"toc_number toc_depth_1\">5<\/span> 5. Sugar Substitutes Are A Great Way to Replace Sugar: Not True<\/a><\/li><li><a href=\"#6_Wheat_Is_Safe_As_Long_As_its_Whole_Not_True\"><span class=\"toc_number toc_depth_1\">6<\/span> 6. Wheat Is Safe As Long As its Whole: Not True<\/a><\/li><li><a href=\"#7_Diet_Sodas_Are_Okay_to_Consume_Not_True\"><span class=\"toc_number toc_depth_1\">7<\/span> 7. Diet Sodas Are Okay to Consume: Not True<\/a><\/li><li><a href=\"#8_Fats_Are_Bad_for_Diabetes_Not_True\"><span class=\"toc_number toc_depth_1\">8<\/span> 8. Fats Are Bad for Diabetes: Not True<\/a><\/li><li><a href=\"#9_Granola_Bars_Are_Good_for_Everyone_Not_True\"><span class=\"toc_number toc_depth_1\">9<\/span> 9. Granola Bars Are Good for Everyone: Not True<\/a><\/li><\/ul><\/div>\n<p>According to the 2014 Diabetes Statistics Report from the Center for Disease Control (CDC), 29.1 million Americans are diabetic. That could explain the ton of information out there about what diabetics can and cannot eat, how many times they should eat, and so on.<\/p>\n<p>There are many theories of what causes diabetes. We believe that <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/can-you-reverse-type-2-diabetes\/\">Type 2 Diabetes<\/a> is a dietary disorder, born of too much insulin and resistance to this excess supply. If the cause is dietary, it seems logical that <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-diet-plan\/\">diet <\/a>should play a huge role in curing it too.<\/p>\n<p>We take a look at some popular myths and explain why they’re not true. We will keep adding to this section, so your questions and suggestions are very welcome.<\/p>\n<h2><span id=\"1_Rice_Is_Bad_for_Diabetes_Not_True\">1. Rice Is Bad for Diabetes: Not True<strong><br \/>\n<\/strong><\/span><\/h2>\n<div id=\"attachment_18687\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18687\" class=\"size-full wp-image-18687\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/uncookedbowlofrice_1220185.webp\" alt=\"rice good for diabetics\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18687\" class=\"wp-caption-text\">rice good for diabetics<\/p><\/div>\n<p>All rice is not bad rice. In a 2010 study, high brown rice intake was associated with a lower risk of type 2 diabetes while higher intake of white rice was associated with a higher risk of type 2 diabetes.<\/p>\n<p>The wheat that we eat today has far more gluten content than its ancient counterpart and is far more hybridized than rice. A double-blind study conducted in 2014 published in the British Journal of Nutrition compared ancient wheat products and modern wheat products in participants who had Irritable Bowel Syndrome (IBS). During the course of the study, participants who consumed the ancient wheat products showed significant improvements in both IBS symptoms and the inflammatory profile while participants who consumed modern wheat products showed worse symptoms in IBS and inflammation in their body.<\/p>\n<p>Dr. William Davis in his book “Wheat Belly” explains that modern wheat is a mixture of a grain called einkorn and wild grasses and is the result of human hybridization which in 50 years produced 25,000 varieties of wheat. Modern wheat is responsible for a number of degenerative diseases those are related directly to visceral fat. This visceral fat, also known as ‘belly fat’, produces its own hormones and messages that cause diseases.<\/p>\n<p>So, although white rice may convert into sugar faster in the body, it is far more hypo-allergenic than wheat. Brown rice, slow-cooked rice, and organic rice all release sugars in your body slowly. The International Rice Research Institute (IRRI) and the University of Queensland analyzed 235 types of rice around the world and found that the GI of rice ranges from 48 (qualified as low G.I) to 92 (high). The rice grown in China called Shen Huang Zhin 2 was found to have the lowest GI (around 45) and Basmati having a mid-level G.I score of around 60. The chief researcher Dr. Fitzgerald said, “We now know rice isn&#8217;t that evil. It does not cause diabetes. However, this study will help diabetics to select rice wisely. Brown rice does not have higher nutritional content than white rice and is also not as palatable. However, brown rice has higher vitamin and mineral content”<\/p>\n<h2><span id=\"2_Six_Meals_Are_Better_Than_Three_Meals_Not_True\">2. Six Meals Are Better Than Three Meals: Not True<\/span><\/h2>\n<div id=\"attachment_18688\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18688\" class=\"size-full wp-image-18688\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/smallVs_largemeal-1.webp\" alt=\"3 meals are better than 6 meals for diabetics\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18688\" class=\"wp-caption-text\">3 meals are better than 6 meals for diabetics<\/p><\/div>\n<p>Eating frequent meals may curb highs and <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/14-amazing-herbs-that-lower-blood-sugar\/\">lows of blood sugar<\/a> and help you feel more stable, especially if you’re on diabetes medication, but this will ensure that you remain diabetic for the rest of your life. Think of it like this: if you keep giving your body a constant supply of food (that it can get glucose from), it will learn to depend on it for life. It will never feel the need to use up reserves stored as fat in your body.<\/p>\n<p>If you eat a snack between breakfast and lunch, your body will try to first use that snack, instead of reaching for the energy reserves already present in your body. You lose your built-in ability to tolerate any gaps between meals. Each time a meal brings in sugar, the pancreas has to work overtime to produce insulin to push it into cells. Over time, the cells don’t like so much insulin muscling sugar into them and get more “insulin-resistant”.<\/p>\n<p>There are two phases of insulin secretion. In phase 1, the pancreas creates and store insulin, in preparation for a meal. This goes on for about 10 minutes and then insulin is released. In phase 2, the pancreas produces more insulin to deal with the full meal. The insulin now stays in the bloodstream for 2-3 hours after the meal is consumed. Eating frequently puts a strain on the pancreas because it is not given a gap to produce and store insulin for phase 1 of secretion. The pancreatic beta cells are working nonstop, which is a sure way to develop type 2 diabetes.<\/p>\n<p>The reasoning for ‘six meals a day’ is rooted in the fear of ‘hypoglycemia’, or low blood sugar. This is far more likely when you are on medications to <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/lower-blood-sugar-levels-naturally\/\">control your blood sugar<\/a>. That’s why hypoglycemia is listed among the top side effects of most diabetes medications. So in effect, your doctor asks you to have six meals a day so that there is always a steady supply of sugar in your blood for the medicines to control!<\/p>\n<p>In a 2014 study, researchers in the Czech Republic found that eating two large meals each day may be better for controlling blood glucose levels and weight. One of the accepted measures of diabetes, the levels of fasting plasma glucagon (a hormone that promoted glucose secretion by the liver) had fallen in those individuals eating two meals a day but increased in those eating six meals a day.<\/p>\n<p>In a report published by the New York Academy of Sciences, it was stated that all-day grazing can put one at risk of type 2-diabetes, heart disease and stroke. This risk increases when insulin levels spike after eating foods that have high glycemic values. Victor Zammit, head of cell biochemistry at Hannah Research Institute, Ayr, Scotland, says that when eating three meals a day (even high G.I ones), the insulin levels have sufficient time to even out throughout the day.<\/p>\n<p><strong><u>Important Note:<\/u> <\/strong>If you are on diabetic medications, you must involve your doctor\/diabetes educator before starting to eat fewer meals a day, to avoid any low blood sugar or hypoglycemia episodes.<\/p>\n<h2><span id=\"3_Fasting_Is_Not_Good_for_Diabetes_Not_True\">3. Fasting Is Not Good for Diabetes: Not True<\/span><\/h2>\n<div id=\"attachment_18689\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18689\" class=\"size-full wp-image-18689\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/IF-1.webp\" alt=\"Fasting helps reducing the insulin sensitivity\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18689\" class=\"wp-caption-text\">Fasting helps reducing the insulin sensitivity<\/p><\/div>\n<p>Every religion in the world encourages periodic fasting. Beyond the spiritual benefits, modern research is proving that there are clear health benefits to such practices, especially <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-to-reverse-type-2-diabetes\/\">intermittent fasting<\/a>. Fasting allows the body to burn off excess fat. Here’s how. When you eat food, a part of it is stored away for later use and insulin is the key hormone which enables storage of food energy. Insulin levels rise when you eat, and the excess (glucose) can be stored in your liver as glycogen or as body fat. When you fast, the insulin levels fall, and the brain starts signaling the body to burn stored energy, since no more food is coming in.<\/p>\n<p>Dr. Julian Whitaker, M.D. says “As your glycogen stores are progressively exhausted, your liver starts converting fat into ketones, which the brain and other tissues use as fuel. This fat-burning state is called ketosis.”<\/p>\n<p>Remember that it is too much insulin that feeds insulin resistance and diabetes. By fasting between meals, or, as your ability to go without food improves, by fasting for even longer periods of time, you reduce the level of circulating insulin in your blood and train your cells to get more “sensitive” to the available insulin.<\/p>\n<p>Working with a trained medical practitioner \/ nutritionist, you can plan your meals and your fasting such that you not only control your diabetes, but begin to reverse it. If you eat 6-7 meals a day, you can transition gradually to fewer meals. A 12-hour fast between dinner and breakfast is often the easiest goal to accomplish (since most of it will be spent sleeping). This can have a dramatic impact on your fasting blood sugar levels.<\/p>\n<p>A 2005 study published in the Journal of Applied Physiology showed that intermittent fasting increased insulin sensitivity at the whole body level. Insulin resistance or poor insulin sensitivity is now being thought of as the key cause for not just type 2 diabetes but many other chronic diseases as well.<\/p>\n<p><strong><u>Important note:<\/u><\/strong> If you are on diabetic medications, you must involve your doctor\/diabetes educator before experimenting with intermittent fasting. This is critical, because lack of regular blood sugar, when combined with medications, that lower blood sugar can lead to low blood sugar or hypoglycemia.<\/p>\n<h2><span id=\"4_Calories_Are_What_Matter_You_Can_Get_it_from_Carbs_Or_Fats_Not_True\">4. Calories Are What Matter; You Can Get it from Carbs Or Fats: Not True<\/span><\/h2>\n<div id=\"attachment_18690\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18690\" class=\"size-full wp-image-18690\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Low-carb-3-1.webp\" alt=\"Processed carbs cause severe problems for diabetics\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18690\" class=\"wp-caption-text\">Processed carbs cause severe problems for diabetes<\/p><\/div>\n<p>Foods are not created equal. Carbs are suggested as a part of a diabetic diet because of the fear of fatty foods. But grain carbs, often processed, cause severe problems for diabetics. A 2005 study in the Annals of Internal Medicine showed that high-starch, high-carbohydrate diets stimulate appetite excessively and disturb energy balance in patients with the metabolic syndrome and type 2 diabetes. A reduction of carbohydrates normalizes the balance, reduces insulin concentrations and favors utilization of stored fat as fuel and significantly reduces insulin resistance.<\/p>\n<p>Another study in the Journal of Endocrinology and Medicine showed that participants who were on a low-carb diet as opposed to those on a low-fat diet showed a significant decrease in circulating insulin. This translated into a significant decrease in insulin to glucose ratio, a possible indicator of improved insulin sensitivity.<\/p>\n<p>A 2012 study showed that participants on a low-carb diet were able to reduce insulin doses significantly than those who were put on a <a href=\"https:\/\/www.sepalika.com\/living-well\/low-carb-high-fat-myths\/\">low-fat diet<\/a>.<\/p>\n<h2><span id=\"5_Sugar_Substitutes_Are_A_Great_Way_to_Replace_Sugar_Not_True\">5. Sugar Substitutes Are A Great Way to Replace Sugar: Not True<\/span><\/h2>\n<div id=\"attachment_18691\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-18691\" class=\"size-full wp-image-18691\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Sugar-2.webp\" alt=\"Sugar substitutes do more harm than good.\" width=\"779\" height=\"309\" \/><p id=\"caption-attachment-18691\" class=\"wp-caption-text\">Sugar substitutes do more harm than good.<\/p><\/div>\n<p>Since diabetics are asked not to eat sugar or sugar products, they reach out for sugar substitutes. Sadly, most of these do more harm than good. Research shows that artificial sweeteners often encourage cravings and dependence.<\/p>\n<p>A study in the Journal of Physiological Behavior showed that aspartame, acesulfame potassium, and saccharin were all associated with a heightened desire to eat and that too, a greater number of items on a food preference list.<\/p>\n<p>A 2007 study published in the journal of Diabetes Care found that aspartame breakfast showed a similar rise in glucose and insulin levels at baseline than the sucrose meal.<\/p>\n<p>When it comes to sweeteners, there are no safe options. It is better to omit them completely from your diet and avoid foods that contain them. One study published in the journal Diabetes Care found that the sucralose (the sweet component in Splenda) which was thought to have no metabolic effect, changes the way the body handles sugar. The blood sugar levels of participants peaked higher after drinking sucralose than when they drank just water.<\/p>\n<h2><span id=\"6_Wheat_Is_Safe_As_Long_As_its_Whole_Not_True\">6. Wheat Is Safe As Long As its Whole: Not True<\/span><\/h2>\n<div id=\"attachment_18692\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Legumes-1-1.webp\"><img aria-describedby=\"caption-attachment-18692\" class=\"size-full wp-image-18692\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Legumes-1-1.webp\" alt=\"Cereals and Legumes are more effective in managing type 2 diabetes and hypertension.\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18692\" class=\"wp-caption-text\">Cereals and Legumes are more effective in managing type 2 diabetes and hypertension.<\/p><\/div>\n<p>Carbohydrates are an important part of every diet including a diabetic’s diet. Slow-release carbohydrate foods in low G.I diets have been shown to reduce the risk of diabetes. However, things are slightly different with modern day hybridized wheat. Dr. William Davis, cardiologist and author of the New York Times bestseller, <em>Wheat Belly,<\/em> points out that, “The amylopectin A – the complex carbohydrate of wheat, given its unusual susceptibility to digestion by the salivary and stomach enzyme, amylase, raises blood sugar to sky-high levels”.<\/p>\n<p>Having high blood glucose damages the pancreatic cells that produce insulin and this is often known as ‘glucotoxicity’. Repetitive high blood sugars lead to insulin resistance which put more pressure on the pancreas to produce insulin. This insulin resistance triggers the accumulation of visceral fat –muffin tops, love handles, or a protruding belly. And, as a vicious cycle, visceral fat is inflammatory fat that worsens insulin resistance.<\/p>\n<p>Grains are not the only source of carbohydrates. You can use legumes, starchy vegetables and heritage grains as viable substitutes. In a 2009 study published in the Journal of Medicinal Food, 10 Peruvian Andean grains (5 cereals, 3 pseudo cereals, and 2 legumes) were found to be effective in managing type 2 diabetes and hypertension.<\/p>\n<h2><span id=\"7_Diet_Sodas_Are_Okay_to_Consume_Not_True\">7. Diet Sodas Are Okay to Consume: Not True<\/span><\/h2>\n<div id=\"attachment_18693\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Diet-Soda-1.webp\"><img aria-describedby=\"caption-attachment-18693\" class=\"size-full wp-image-18693\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Diet-Soda-1.webp\" alt=\"consumption of diet soda has a greater relative risk of type 2 diabetes.\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18693\" class=\"wp-caption-text\">consumption of diet soda has a greater relative risk of type 2 diabetes.<\/p><\/div>\n<p>Diabetics should avoid all types of sweets. Of all the sweet food groups that can cause damage, <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/can-diabetics-drink-diet-soda\/\">diet sodas<\/a> that are often packed with artificial sweeteners are the worst. This has been found time and again in research studies.<\/p>\n<p>In a study published in Diabetes Care Journal, daily consumption of diet soda was associated with a 67% greater relative risk of type 2 diabetes.<\/p>\n<p>In a 2014 study published in the European Journal of Nutrition, consumption of diet soda was significantly associated with an increased risk of diabetes in Japanese men.<\/p>\n<p>In a 2010 study, consumption of SSBs (Sugar-Sweetened Beverages), which includes soft drinks, fruit drinks, energy drinks, and vitamin water drinks, was shown to result in rapid and dramatic increases in blood glucose and insulin concentration. Due to the habit-forming nature of these products, they also lead to a much higher overall glycemic load or GL. High-GL diets stimulate appetite, promote weight gain and induce glucose intolerance and insulin resistance.<\/p>\n<h2><span id=\"8_Fats_Are_Bad_for_Diabetes_Not_True\">8. Fats Are Bad for Diabetes: Not True<\/span><\/h2>\n<div id=\"attachment_18694\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Dairy-1-1.webp\"><img aria-describedby=\"caption-attachment-18694\" class=\"size-full wp-image-18694\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Dairy-1-1.webp\" alt=\"Consuming full-fat dairy lowers the risk of developing type 2 diabetes \" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18694\" class=\"wp-caption-text\">Consuming full-fat dairy lowers the risk of developing type 2 diabetes<\/p><\/div>\n<p>Fats reduce cravings, give feelings of satiation and are an essential component for the body to be able to function well. Trans-fats, often derived from fried food, are the fats that cause trouble.<\/p>\n<p>After painting fats as the villain for nearly 6 decades, the FDA revealed in 2016 that this propaganda was a result of the sugar lobby “massaging” research data to prove this false accusation!<\/p>\n<p>A study conducted at the Institute of Internal Medicine and Metabolic Diseases in Italy showed that a high-monounsaturated-fat (MUFA)\/low carbohydrate (CHO) diet was effective in reducing blood glucose levels in non-insulin-dependent patients. (There was a decrease in both postprandial glucose and plasma insulin levels).<br \/>\nAnother study, published in the Annals of Internal Medicine in 2010 proposed that the palmitoleic acid, which occurs naturally in full-fat dairy products, protects against insulin resistance and diabetes.<\/p>\n<p>People who consumed full-fat dairy had higher levels of trans-palmitoleate in their blood, and this translated to a two-thirds lower risk of developing type 2 diabetes compared to people with lower levels.<\/p>\n<p>Another recent 2015 study published in the American Journal of Nutrition concluded that there was a decreased incidence of type 2 diabetes at high intake of high-fat dairy products but not low-fat dairy products. The study indicated a protective role of fat from dairy and suggest that dairy fat may also have played a contributing factor to previously observed protective associations between dairy intake and type 2 diabetes.<br \/>\nSo, switch to good fats. Particularly <a href=\"https:\/\/www.sepalika.com\/living-well\/omega-3-fatty-acids-types-benefits\/\">Omega-3 fats<\/a> which are found in flaxseed oil and walnut oil. And, fats from food sources like avocados, organic ghee, grass-fed and organic butter, virgin cold pressed olive oil, virgin cold pressed coconut oil are great for diabetics.<\/p>\n<h2><span id=\"9_Granola_Bars_Are_Good_for_Everyone_Not_True\">9. Granola Bars Are Good for Everyone: Not True<\/span><\/h2>\n<div id=\"attachment_18695\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Granola-1.webp\"><img aria-describedby=\"caption-attachment-18695\" class=\"size-full wp-image-18695\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Granola-1.webp\" alt=\"Granola Bars are mostly loaded with sugar, canola oil, and highly toxic fructose corn syrup.\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18695\" class=\"wp-caption-text\">Granola Bars are mostly loaded with sugar, canola oil, and highly toxic fructose corn syrup.<\/p><\/div>\n<p>Granola bars are considered as one of the healthy snacks you can munch on when you have a time-crunch. Sadly, they are mostly loaded with sugar, canola oil, and highly toxic fructose corn syrup.<\/p>\n<p>Dr. Charles H. Booras, MD says, “Granola tends to be a high-fat, high sugar cereal. It should be used more as a garnish by sprinkling a little of it on unsweetened cereal. Many granola bars are simply high-calorie cookies! The latest version &#8211; the granola candy bars &#8211; are no better for you than a Milky Way or Snickers, and they cost more too!”<\/p>\n<p>Other so-called ‘healthy foods’ to avoid are fruit-on-the-bottom yogurt, smoothies, flavored oatmeal, fruit juice or protein\/energy bars.<\/p>\n<p>Just one cup of fruit-on-the-bottom (mixed berry fruit) yogurt has 200 calories with 36 grams of sugar while a plain cup of full-fat yogurt contains 149 calories and has 11 grams of sugar.<\/p>\n<p>Flavored oatmeal is full of sugar and salt, plus they also have less soluble fiber which makes it bad for you.<\/p>\n<p>Helen Bond, a dietician and spokesperson for the British Dietetic Association, comparing energy\/protein bars showed that an Eat Natural bar contains more sugar than a two-finger Kit Kat. Many protein and energy bars contain high amounts of sugar, so always make sure to read labels, and create your own <strong>&#8220;<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/simple-diabetic-diet\/\">type 2 diabetes foods <\/a>to avoid&#8221; list<\/strong>.<\/p>\n<p>Now that you know the truth about these myths, make your choices wisely. On this site, you&#8217;ll find mouth-watering, yet healthy, <strong>type 2 diabetes recipes<\/strong> that you can use to create your very own diet plan. Here’s wishing you fantastic health.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In This Article1 1. Rice Is Bad for Diabetes: Not True 2 2. Six Meals Are Better Than Three Meals: Not True3 3. Fasting Is Not Good for Diabetes: Not True4 4. Calories Are What Matter; You Can Get it from Carbs Or Fats: Not True5 5. Sugar Substitutes Are A Great Way to Replace [&hellip;]<\/p>\n","protected":false},"author":37,"featured_media":18696,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[63,112],"tags":[90],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Diabetes 9 Common Diet Myths Busted! | Sepalika<\/title>\n<meta name=\"description\" content=\"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Diabetes 9 Common Diet Myths Busted! | Sepalika\" \/>\n<meta property=\"og:description\" content=\"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-11-14T12:07:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-15T07:48:25+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Rachelle Chandraan\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"15 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp\",\"width\":400,\"height\":115,\"caption\":\"Diabetes Diet Myths\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/\",\"name\":\"Diabetes 9 Common Diet Myths Busted! | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#primaryimage\"},\"datePublished\":\"2016-11-14T12:07:48+00:00\",\"dateModified\":\"2021-12-15T07:48:25+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/7ab60bec837ebf1954ec09d286f32f37\"},\"description\":\"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"9 Common Diabetic Diet Myths Busted!\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/7ab60bec837ebf1954ec09d286f32f37\",\"name\":\"Rachelle Chandraan\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Rachelle Chandraan\"},\"description\":\"Rachelle is a writer who has a deep appreciation of the way the human body works. She has authored more than two thousand articles in the area of health for both online and print publications.\",\"sameAs\":[\"riddhi\"],\"url\":\"https:\/\/www.sepalika.com\/author\/rachelle-1\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Diabetes 9 Common Diet Myths Busted! | Sepalika","description":"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/","og_locale":"en_US","og_type":"article","og_title":"Diabetes 9 Common Diet Myths Busted! | Sepalika","og_description":"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.","og_url":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2016-11-14T12:07:48+00:00","article_modified_time":"2021-12-15T07:48:25+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Rachelle Chandraan","Est. reading time":"15 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-4.webp","width":400,"height":115,"caption":"Diabetes Diet Myths"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#webpage","url":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/","name":"Diabetes 9 Common Diet Myths Busted! | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#primaryimage"},"datePublished":"2016-11-14T12:07:48+00:00","dateModified":"2021-12-15T07:48:25+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/7ab60bec837ebf1954ec09d286f32f37"},"description":"People with Diabetes can eat rice. They must have fats. And diet sodas are not ok even if they have no sugar. Know the facts from myths.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/diet-guide-principles\/diabetic-diet-myths-busted\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"9 Common Diabetic Diet Myths Busted!"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/7ab60bec837ebf1954ec09d286f32f37","name":"Rachelle Chandraan","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Rachelle Chandraan"},"description":"Rachelle is a writer who has a deep appreciation of the way the human body works. She has authored more than two thousand articles in the area of health for both online and print publications.","sameAs":["riddhi"],"url":"https:\/\/www.sepalika.com\/author\/rachelle-1\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2898"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/37"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=2898"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/2898\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18696"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=2898"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=2898"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=2898"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}