{"id":5246,"date":"2016-11-24T16:23:22","date_gmt":"2016-11-24T16:23:22","guid":{"rendered":"http:\/\/www.sepalika.com\/?p=2951"},"modified":"2021-12-15T14:05:02","modified_gmt":"2021-12-15T08:35:02","slug":"side-effects-insulin-shots","status":"publish","type":"post","link":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/","title":{"rendered":"What Are The Side Effects of Insulin Shots?"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">In This Article<\/p><ul class=\"toc_list\"><li><a href=\"#Introduction\"><span class=\"toc_number toc_depth_1\">1<\/span> Introduction<\/a><\/li><li><a href=\"#Mechanism_of_Action\"><span class=\"toc_number toc_depth_1\">2<\/span> Mechanism of Action<\/a><\/li><li><a href=\"#Most_Prescribed_Names_In_This_Category_of_Drugs_Include\"><span class=\"toc_number toc_depth_1\">3<\/span> Most Prescribed Names In This Category of Drugs Include<\/a><\/li><li><a href=\"#Side_Effects_That_Could_Occur_As_Soon_As_You_Start_Taking_Insulin_Shots\"><span class=\"toc_number toc_depth_1\">4<\/span> Side Effects That Could Occur As Soon As You Start Taking Insulin Shots<\/a><ul><li><a href=\"#Low_Blood_Sugar_Hypoglycemia_or_High_Blood_Sugar_Hyperglycemia\"><span class=\"toc_number toc_depth_2\">4.1<\/span> Low Blood Sugar (Hypoglycemia) or High Blood Sugar (Hyperglycemia)<\/a><\/li><li><a href=\"#Weight_Gain\"><span class=\"toc_number toc_depth_2\">4.2<\/span> Weight Gain<\/a><\/li><li><a href=\"#Other_Common_Symptoms\"><span class=\"toc_number toc_depth_2\">4.3<\/span> Other Common Symptoms<\/a><\/li><li><a href=\"#What_You_Can_Do_To_Reduce_These_Side_Effects\"><span class=\"toc_number toc_depth_2\">4.4<\/span> What You Can Do To Reduce These Side Effects<\/a><\/li><\/ul><\/li><li><a href=\"#Should_You_Be_Using_Insulin_On_A_Long_Term_Basis\"><span class=\"toc_number toc_depth_1\">5<\/span> Should You Be Using Insulin On A Long Term Basis?<\/a><\/li><li><a href=\"#What_Special_Precautions_Should_You_Follow\"><span class=\"toc_number toc_depth_1\">6<\/span> What Special Precautions Should You Follow?<\/a><\/li><li><a href=\"#What_Should_You_Do_if_You_Forget_a_Dose\"><span class=\"toc_number toc_depth_1\">7<\/span> What Should You Do if You Forget a Dose?<\/a><\/li><li><a href=\"#How_Should_This_Medicine_Be_Used\"><span class=\"toc_number toc_depth_1\">8<\/span> How Should This Medicine Be Used?<\/a><\/li><li><a href=\"#How_Do_I_Inject_Insulin\"><span class=\"toc_number toc_depth_1\">9<\/span> How Do I Inject Insulin?<\/a><\/li><li><a href=\"#What_You_Should_Know_About_The_Storage_And_Disposal_of_This_Medication\"><span class=\"toc_number toc_depth_1\">10<\/span> What You Should Know About The Storage And Disposal of This Medication<\/a><\/li><li><a href=\"#Some_Dietary_Considerations_To_Keep_In_Mind_While_On_Medication\"><span class=\"toc_number toc_depth_1\">11<\/span> Some Dietary Considerations To Keep In Mind While On Medication<\/a><\/li><li><a href=\"#Who_Should_Not_Take_Insulin\"><span class=\"toc_number toc_depth_1\">12<\/span> Who Should Not Take Insulin?<\/a><\/li><li><a href=\"#Parting_Thoughts_On_Insulin_Shots_and_Their_Side_Effects\"><span class=\"toc_number toc_depth_1\">13<\/span> Parting Thoughts On Insulin Shots and Their Side Effects<\/a><\/li><\/ul><\/div>\n<h2 id=\"Introduction\"><span id=\"Introduction\">Introduction<\/span><\/h2>\n<p>Insulin is at the center of the diabetes problem. In people with <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/basics\/\">type 2 diabetes<\/a>, the body does not use insulin effectively. The pancreas compensates by overproducing insulin, and in time, it simply cannot keep up with the demands of the body to keep glucose levels down. To provide enough insulin to the body to manage blood glucose levels, many diabetics are advised to take insulin shots.<\/p>\n<p>The insulin in these injections is a chemical that is produced artificially to resemble the insulin made in our pancreas. This insulin works just like natural insulin by escorting sugar from our blood into our cells. Type 2 diabetics deal with a condition known as <a href=\"https:\/\/en.wikipedia.org\/wiki\/Insulin_resistance\">insulin resistance<\/a>. It is a phenomenon where cells aren’t sensitive to the action of insulin (escorting blood glucose into cells) and hence, do not respond to it. This leads to the accumulation of glucose in the blood and is called hyperglycemia. Supplemental insulin given to Type 2 diabetics helps the body ‘muscle’ sugar out of the bloodstream and into cells.<\/p>\n<p>Insulin injections are used to <a href=\"https:\/\/medlineplus.gov\/druginfo\/meds\/a682611.html\">regulate blood sugar<\/a> differently for the different diabetes-types:<\/p>\n<ul>\n<li>For people who have type 1 diabetes &#8211; Their bodies cannot make insulin and therefore they aren’t able to regulate the amount of glucose in their bloodstream.<\/li>\n<li>For people who have type 2 diabetes &#8211; Their bodies aren’t able to produce enough insulin, or use it effectively.<\/li>\n<\/ul>\n<p>The insulin shots are used because the blood sugar cannot be regulated with oral medications alone.<\/p>\n<div class=\"col-md-12 arti-subsc\">\n<div class=\"subscriberow\">[mc4wp_form id=&#8221;12950&#8243;]<\/div>\n<\/div>\n<p>They also stop the liver from producing more sugar. Every type of insulin available in a drug store works in this way.<\/p>\n<p>They, mainly, differ in two ways –<\/p>\n<ul>\n<li>How quickly they begin to work<\/li>\n<li>For how long they can regulate blood sugar levels<\/li>\n<\/ul>\n<h2 id=\"Mechanism_of_Action\"><span id=\"Mechanism_of_Action\">Mechanism of Action<\/span><\/h2>\n<p>Regulating the process in which<a href=\"http:\/\/www.accessdata.fda.gov\/drugsatfda_docs\/label\/2013\/020563s115lbl.pdf\"> glucose is broken down <\/a>is the primary activity of insulin and <a href=\"http:\/\/www.diabetes.co.uk\/insulin\/analogue-insulin.html\">insulin analogs<\/a>. Insulin decreases blood glucose by –<\/p>\n<ul>\n<li>Stimulating glucose uptake by muscles and fat cells<\/li>\n<li>Inhibiting the production of glucose by the liver<\/li>\n<\/ul>\n<h2 id=\"Most_Prescribed_Names_In_This_Category_of_Drugs_Include\"><span id=\"Most_Prescribed_Names_In_This_Category_of_Drugs_Include\">Most Prescribed Names In This Category of Drugs Include<\/span><\/h2>\n<ul>\n<li>Apidra<\/li>\n<li>Flexpen<\/li>\n<li>Humulin<\/li>\n<li>Novolin R<\/li>\n<li>Novolin N<\/li>\n<li>Huminsulin<\/li>\n<li>Wosulin R<\/li>\n<li>Protamine Zinc<\/li>\n<\/ul>\n<h2 id=\"Side_Effects_That_Could_Occur_As_Soon_As_You_Start_Taking_Insulin_Shots\"><span id=\"Side_Effects_That_Could_Occur_As_Soon_As_You_Start_Taking_Insulin_Shots\">Side Effects That Could Occur As Soon As You Start Taking Insulin Shots<\/span><\/h2>\n<ul>\n<li>Low Blood Sugar (Hypoglycemia)<\/li>\n<li>High Blood Sugar (Hyperglycemia)<\/li>\n<li>Weight Gain<\/li>\n<li>Skin reactions, as a result of substances added to the insulin shots<\/li>\n<\/ul>\n<h3 id=\"Low_Blood_Sugar_Hypoglycemia_or_High_Blood_Sugar_Hyperglycemia\"><span id=\"Low_Blood_Sugar_Hypoglycemia_or_High_Blood_Sugar_Hyperglycemia\">Low Blood Sugar (<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetic-hypoglycemia-causes-symptoms\/\">Hypoglycemia<\/a>) or High Blood Sugar (Hyperglycemia)<\/span><\/h3>\n<p>The dosage of insulin shots is decided as per the average food intake of the person. If the diabetic person eats less, it may result in their blood sugar going far lower than it should (hypoglycemia). On the other hand, if too little insulin is delivered, there will be too much blood sugar (hyperglycemia). The person may suffer from insulin overdose side effects. Either way, both conditions can be life-threatening.<\/p>\n<p>If you experience any confusion, excessive sweating, hunger, palpitations and\/or dizziness accompanied by blurred vision, you may be suffering from hypoglycemia caused due to insulin injection side effects.<\/p>\n<h3><span id=\"Weight_Gain\">Weight Gain<\/span><\/h3>\n<div id=\"attachment_18722\" style=\"width: 789px\" class=\"wp-caption aligncenter\"><a href=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Weight-check.webp\"><img aria-describedby=\"caption-attachment-18722\" class=\"size-full wp-image-18722\" src=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/Weight-check.webp\" alt=\"Weight gain is a common side effect of insulin\" width=\"779\" height=\"309\" \/><\/a><p id=\"caption-attachment-18722\" class=\"wp-caption-text\">Weight gain is a common side effect of insulin<\/p><\/div>\n<p>Among insulin side effects, weight gain is something most diabetics are quite wary of. Insulin causes the body to store fat. It also helps to retain fluids and utilize glucose better. All of these factors play a vital role in diabetics gaining weight.<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/diabetes-and-weight-loss-type-2\/\">Diabetes And Weight Loss For Type 2<\/a><\/div>\n<h3 id=\"Other_Common_Symptoms\"><span id=\"Other_Common_Symptoms\">Other Common Symptoms<\/span><\/h3>\n<p>Some people have allergic reactions, not to the insulin itself, but to stuff added to the insulin, like preservatives (protamine, zinc etc.) and other substances.<\/p>\n<h3 id=\"What_You_Can_Do_To_Reduce_These_Side_Effects\"><span id=\"What_You_Can_Do_To_Reduce_These_Side_Effects\">What You Can Do To Reduce These Side Effects<\/span><\/h3>\n<p>Your doctor can check these adverse effects by:<\/p>\n<ul>\n<li>Checking insulin compatibility with other medications, before initiating therapy.<\/li>\n<li>Checking for allergic reactions to the injection.<\/li>\n<\/ul>\n<p>The insulin shots may need to be combined with another drug called amylin analogs to help the body handle the insulin better.<\/p>\n<h2 id=\"Should_You_Be_Using_Insulin_On_A_Long_Term_Basis\"><span id=\"Should_You_Be_Using_Insulin_On_A_Long_Term_Basis\">Should You Be Using Insulin On A Long Term Basis?<\/span><\/h2>\n<p>Insulin gives excellent results in sugar control, when used along with amylin analogs. However, unless the beta cells of the pancreas are totally destroyed, going on insulin should be a carefully considered decision. Once you choose to regulate your blood sugar with insulin, it may be difficult to get off it.<\/p>\n<p>There is an increasing number of doctors who are, now, questioning the role of insulin as a cause of diabetes. They feel that other ways of ‘reversing’ diabetes need to be adopted instead.<\/p>\n<p>Meanwhile, research shows that<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/supplements-for-type-2-diabetes\/\"> dietary supplements<\/a> can also help reduce the burden of prescription drugs and their side effects.<\/p>\n<h2 id=\"What_Special_Precautions_Should_You_Follow\"><span id=\"What_Special_Precautions_Should_You_Follow\">What Special Precautions Should You Follow?<\/span><\/h2>\n<p>Before the <a href=\"https:\/\/medlineplus.gov\/druginfo\/meds\/a682611.html#precautions\">use of insulin<\/a>,<\/p>\n<ul>\n<li>Inform your physician if you are allergic to insulin of any kind, or to any other medications.<\/li>\n<li>Inform your doctor about any prescription and non-prescription medications, vitamins, dietary supplements and natural products you might be taking or are planning to take.<\/li>\n<li>Inform your physician if you have or have previously had nerve damage caused by diabetes\/heart failure or any disease associated with the heart, adrenal, pituitary, thyroid, liver or kidney.<\/li>\n<li>Inform your doctor in case you are pregnant, plan to become pregnant or are breastfeeding. If you become pregnant whilst using insulin, consult your healthcare practitioner immediately. Insulin side effects experienced during pregnancy may prove life-threatening for both, the mother and the child.<\/li>\n<li>Alcohol may cause a decrease in blood sugar. Ask your healthcare practitioner about the consumption of alcoholic beverages while you are using insulin.<\/li>\n<li>Ask your doctor what to do if you get sick, are stressed, plan to travel or wish to change your exercise regimen. It is likely that these modifications may affect your blood sugar and the amount of insulin you will need.<\/li>\n<li>Ask your doctor how often you should test your blood sugar. You should understand that hypoglycemia may affect your capacity to perform certain tasks, like driving. Do  confirm whether you need to check your blood sugar before driving or operating any kind of machinery.<\/li>\n<\/ul>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/metformin-side-effects\/\">Metformin Side Effects And How To Deal With Them<\/a><\/div>\n<h2 id=\"What_Should_You_Do_if_You_Forget_a_Dose\"><span id=\"What_Should_You_Do_if_You_Forget_a_Dose\">What Should You Do if You Forget a Dose?<\/span><\/h2>\n<p>Missing an insulin shot is a frustrating thing. It can lead to a lot of stress and more pain than the injection itself. There are <a href=\"http:\/\/www.diabetes.co.uk\/insulin\/missing-insulin-injection.html\">no hard and fast guidelines <\/a>for what one should do if they’ve missed a dose. Ideally, you should contact your healthcare adviser if you do happen to miss a dose.<\/p>\n<p><strong>If you missed taking the long term \/ basal insulin and you realize it within two hours<\/strong> from the time you should have taken the shot, it shouldn’t be a problem if you inject your usual dose. But, you also need to understand that this carries the risk of hypoglycemia. So, it is better to talk to your healthcare adviser about it, beforehand.<\/p>\n<p><strong>If it has been more than two hours since you missed the dose, you will need to take a rapid acting insulin. Otherwise, the excess glucose that has been accumulating in your blood might make you hyperglycemic.  <\/strong><\/p>\n<h2 id=\"How_Should_This_Medicine_Be_Used\"><span id=\"How_Should_This_Medicine_Be_Used\">How Should This Medicine Be Used?<\/span><\/h2>\n<p>Insulin is <a href=\"http:\/\/www.novonordisk.com.au\/content\/dam\/australia\/affiliate\/www-novonordisk-au\/Patients\/Documents\/Actrapid%20Vial%20PIL%203.pdf\">injected subcutaneously under the skin<\/a>. Always vary injection sites within the same region to reduce the risk of developing lumps.<\/p>\n<ul>\n<li>The best places to inject insulin are the abdomen, buttocks, thighs and upper arms.<\/li>\n<li>The insulin will work rapidly if it has been injected around the waist.<\/li>\n<li>Insulin may also be administered intravenously by healthcare professionals, in special situations.<\/li>\n<\/ul>\n<h2 id=\"How_Do_I_Inject_Insulin\"><span id=\"How_Do_I_Inject_Insulin\">How Do I Inject Insulin?<\/span><\/h2>\n<ul>\n<li>Firstly, make sure you have the correct syringe. Syringes for injecting insulin have specific gradations.<\/li>\n<li>Draw air into the syringe (injection) in the same amount as the dose of insulin you need.<\/li>\n<li>Push the needle into the stopper and push the plunger down. The air in the syringe goes into the bottle and will replace the amount of insulin you’ll withdraw.<\/li>\n<li>Inject the insulin under the skin, in the subcutaneous region. Use the injection technique advised by your doctor or nurse.<\/li>\n<li>Keep the needle under your skin for at least 6 seconds to make sure that the full dose has been delivered.<\/li>\n<\/ul>\n<p>(A slightly more descriptive procedure could be written, if need be.)<\/p>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/sglt2-inhibitors-side-effects\/\">Side Effects Of SGLT2 Inhibitors<\/a><\/div>\n<h2 id=\"What_You_Should_Know_About_The_Storage_And_Disposal_of_This_Medication\"><span id=\"What_You_Should_Know_About_The_Storage_And_Disposal_of_This_Medication\">What You Should Know About The Storage And Disposal of This Medication<\/span><\/h2>\n<ul>\n<li>You don’t need to refrigerate in-use insulin products. Just store them at a cool, dry place, preferably at 77-82°F.<\/li>\n<li>You can store insulin at room temperature for 4 weeks, when in use, as long as the temperature mentioned on it is not exceeded.<\/li>\n<li>All open vials, cartridges or pre-filled pens that you use every day must be discarded after 28 days.<\/li>\n<li>Packed insulin products (intended for future use) should be stored in a refrigerator at 2-8°C (or 36 to 46°F) untilthey are used. Do not store any insulin in the freezer compartment. Also, avoid keeping insulin in contact with the internal walls of a refrigerator.<\/li>\n<\/ul>\n<h2 id=\"Some_Dietary_Considerations_To_Keep_In_Mind_While_On_Medication\"><span id=\"Some_Dietary_Considerations_To_Keep_In_Mind_While_On_Medication\">Some Dietary Considerations To Keep In Mind While On Medication<\/span><\/h2>\n<p>Be sure to follow all exercise and dietary plans created by your healthcare practitioner or dietitian. It is important to eat a healthy diet. Ideally, you should eat the same amounts and same kinds of foods at the same time every day. Skipping, delaying meals or changing the quantity or kind of food you eat can cause problems with your blood sugar control.<\/p>\n<p>Drug interactions (drug on drug side effects):<\/p>\n<ul>\n<li>Beta-blockers, clonidine and reserpine may mask some of the signs and symptoms of hypoglycemia.<\/li>\n<li>Corticosteroids, thyroid supplements, estrogens, isoniazid, niacin, phenothiazines and rifampin may increase insulin requirements.<\/li>\n<li>Alcohol, ACE inhibitors, MAO inhibitors, octreotide, oral hypoglycemic agents and salicylates may decrease insulin requirements.<\/li>\n<li>Concurrent use with pioglitazone or rosiglitazone may increase the risk of fluid retention and worsen heart failure.<\/li>\n<\/ul>\n<h2 id=\"Who_Should_Not_Take_Insulin\"><span id=\"Who_Should_Not_Take_Insulin\">Who Should Not Take Insulin?<\/span><\/h2>\n<p>Do not use insulin if &#8211;<\/p>\n<ul>\n<li>You are having an episode of low blood sugar (hypoglycemia).<\/li>\n<li>You have an allergy to insulin.<\/li>\n<li>The protective cap is loose or missing. Each vial has a protective, tamper-proof plastic cap. If it is not in perfect condition when you receive the vial, return the vial to your supplier.<\/li>\n<li>It has not been stored correctly or has been frozen.<\/li>\n<li>The insulin does not appear clear and colorless.<\/li>\n<\/ul>\n<div class=\"arti-addon\">RELATED: <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/sulfonylureas-increase-risk-cancer-diabetics\/\">Do Sulfonylureas Increase Risk Of Cancer In Diabetics?<\/a><\/div>\n<h2 id=\"Parting_Thoughts_On_Insulin_Shots_and_Their_Side_Effects\"><span id=\"Parting_Thoughts_On_Insulin_Shots_and_Their_Side_Effects\">Parting Thoughts On Insulin Shots and Their Side Effects<\/span><\/h2>\n<p>Diabetes takes its toll on the mental and physical health of an individual. But, being a dietary disorder,<a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/can-you-reverse-type-2-diabetes\/\"> it is reversible<\/a>. It may be difficult, but it’s surely not impossible. Reversing diabetes requires patience, perseverance and emotional strength.<\/p>\n<p><a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/type-2-diabetes-drugs-side-effects\/\">Anti-diabetic drugs<\/a> often do more harm than good because they rob the body of certain vital nutrients. If these same nutrients are brought back in the body, it is possible to reduce the side effects and long-term health complications from both, diabetes and its medication. To do this, dietary supplements play an important role.<\/p>\n<p>A healthy lifestyle, that incorporates a holistic diet, intermittent fasting, yoga, <a href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/how-does-exercise-help-diabetes\/\">exercise<\/a>, meditation and weight loss is the key to fighting and reversing diabetes, effectively.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If too much insulin is delivered or the person eats less than he or she dosed for, it may result in the blood sugar going far lower than it should be. <\/p>\n","protected":false},"author":39,"featured_media":18724,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false},"categories":[115,112],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Side Effects of Insulin Shots and What Precautions to Take? | Sepalika<\/title>\n<meta name=\"description\" content=\"Insulin gives excellent results in sugar control, when used along with amylin analogs. However, there are side effects of insulin shots.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Injecting Insulin? Here Are Some Side Effects of Insulin Shots\" \/>\n<meta property=\"og:description\" content=\"These are potential reactions your body could have to insulin injections\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-11-24T16:23:22+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-12-15T08:35:02+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp\" \/>\n<meta name=\"twitter:creator\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Nachiket Rajadhyaksha\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#primaryimage\",\"url\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp\",\"contentUrl\":\"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp\",\"width\":400,\"height\":193,\"caption\":\"side effects of insulin shots\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/\",\"name\":\"Side Effects of Insulin Shots and What Precautions to Take? | Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#primaryimage\"},\"datePublished\":\"2016-11-24T16:23:22+00:00\",\"dateModified\":\"2021-12-15T08:35:02+00:00\",\"author\":{\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/6d4337ecc306a2c6faf5be48115a6170\"},\"description\":\"Insulin gives excellent results in sugar control, when used along with amylin analogs. However, there are side effects of insulin shots.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"What Are The Side Effects of Insulin Shots?\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/6d4337ecc306a2c6faf5be48115a6170\",\"name\":\"Nachiket Rajadhyaksha\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g\",\"caption\":\"Nachiket Rajadhyaksha\"},\"description\":\"Nachiket holds a first class degree in Pharmacy and is passionate about writing. He believes that subject experts must simplify medical concepts to make them interesting and accessible to everyone.\",\"sameAs\":[\"logicalsteps21@gmail.com\"],\"url\":\"https:\/\/www.sepalika.com\/author\/nachiket-rajadhyaksha\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Side Effects of Insulin Shots and What Precautions to Take? | Sepalika","description":"Insulin gives excellent results in sugar control, when used along with amylin analogs. However, there are side effects of insulin shots.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/","og_locale":"en_US","og_type":"article","og_title":"Injecting Insulin? Here Are Some Side Effects of Insulin Shots","og_description":"These are potential reactions your body could have to insulin injections","og_url":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_published_time":"2016-11-24T16:23:22+00:00","article_modified_time":"2021-12-15T08:35:02+00:00","twitter_card":"summary_large_image","twitter_image":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp","twitter_creator":"@SepalikaHealth","twitter_site":"@SepalikaHealth","twitter_misc":{"Written by":"Nachiket Rajadhyaksha","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#primaryimage","url":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp","contentUrl":"https:\/\/www.sepalika.com\/wp-content\/uploads\/2016\/11\/admin-ajax-8.webp","width":400,"height":193,"caption":"side effects of insulin shots"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#webpage","url":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/","name":"Side Effects of Insulin Shots and What Precautions to Take? | Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#primaryimage"},"datePublished":"2016-11-24T16:23:22+00:00","dateModified":"2021-12-15T08:35:02+00:00","author":{"@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/6d4337ecc306a2c6faf5be48115a6170"},"description":"Insulin gives excellent results in sugar control, when used along with amylin analogs. However, there are side effects of insulin shots.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/type-2-diabetes\/side-effects-insulin-shots\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"What Are The Side Effects of Insulin Shots?"}]},{"@type":"Person","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/6d4337ecc306a2c6faf5be48115a6170","name":"Nachiket Rajadhyaksha","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.sepalika.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/6840fbd8f47ac7f840c7baec8512fc13?s=96&d=mm&r=g","caption":"Nachiket Rajadhyaksha"},"description":"Nachiket holds a first class degree in Pharmacy and is passionate about writing. He believes that subject experts must simplify medical concepts to make them interesting and accessible to everyone.","sameAs":["logicalsteps21@gmail.com"],"url":"https:\/\/www.sepalika.com\/author\/nachiket-rajadhyaksha\/"}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/5246"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/39"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=5246"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/posts\/5246\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media\/18724"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=5246"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/categories?post=5246"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/tags?post=5246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}