{"id":16227,"date":"2021-01-07T09:58:18","date_gmt":"2021-01-07T09:58:18","guid":{"rendered":"https:\/\/www.sepalika.com\/?page_id=16227"},"modified":"2021-05-18T11:22:48","modified_gmt":"2021-05-18T11:22:48","slug":"terms-and-conditions","status":"publish","type":"page","link":"https:\/\/www.sepalika.com\/terms-and-conditions\/","title":{"rendered":"Terms And Conditions"},"content":{"rendered":"\n<p>“Agreement” means the terms and conditions as detailed herein including all schedules, appendices, annexures, Privacy Policy, and will include the references to this Agreement as amended, supplemented, varied or replaced from time to time.<\/p>\n\n\n\n<p>“Member”\/ “You” means and includes you and\/or any person or an entity using or accessing the services provided on this Site.<\/p>\n\n\n\n<p>“Site” means the online transaction platform owned and operated by Moonjur Healthcare Private Limited which provides a venue to the members of Sepalika to subscribe to programs listed on www.sepalika.com<\/p>\n\n\n\n<p>“Services” connotes Pay \/ Part Pay for the Forms that appears in our website i.e. www.sepalika.com where the member can fill the form online and services displayed on the Site and offered for any use.<\/p>\n\n\n\n<p>“Medical Practitioner” means a registered medical professional with license to practice in India.<\/p>\n\n\n\n<h2>Eligibility<\/h2>\n\n\n\n<p>You represent and warrant that you are competent and eligible to enter into legally binding agreement and have the requisite authority to bind the other party to this Agreement. You shall not use this Site if you are not competent to contract under the applicable laws, rules and regulations.<\/p>\n\n\n\n<h2>Acceptance Of Terms And Conditions<\/h2>\n\n\n\n<p>All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.<\/p>\n\n\n\n<p>All the terms and conditions must be read very carefully. If you do not agree to any of the terms and conditions, you should not use this service. Your use of the Site and consequent subscription to any of our programs shall constitute your acceptance of these terms and you also agree to be bound by any such changes\/revisions. By using this facility, you accept that this will form a legal binding agreement between you and Moonjur Healthcare Private Limited.<\/p>\n\n\n\n<h2>Modification Of Terms &amp; Conditions<\/h2>\n\n\n\n<p>Moonjur Healthcare Private Limited may at any time modify the terms and conditions of the Service without any prior notification to you. You can access the latest version of the terms at any given time. You should regularly review the terms. In the event wherein the modified terms are not acceptable to you, you should discontinue using the service. However, if you continue to use the service, you agree to accept and abide by the modified terms. Your use of a Site after any amendment to the Terms of Use shall constitute your acceptance of these terms and you also agree to be bound by any such changes \/ revisions.<\/p>\n\n\n\n<h2>Electronic Communication<\/h2>\n\n\n\n<p>When you visit www.sepalika.com or send e-mails to us or give us your feedback, you are communicating with us electronically. You consent to receive communications from us electronically. We will communicate with you by e-mail or by telephone calls\/messages. You agree that all agreements, notices, disclosures and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing.<\/p>\n\n\n\n<h2>Payment Details<\/h2>\n\n\n\n<p>To avail of and use our Services you will have to register with Moonjur Healthcare Private Limited with details of your information like email-id, name, mobile \/ telephone number, date of birth etc. and then you have the option to submit the form with online payment option by net banking or PayTM.<\/p>\n\n\n\n<p>You acknowledge and agree that Moonjur Healthcare Private Limited may preserve content and the said information will not be utilized and shared or disclosed by Moonjur Healthcare Private Limited with any third party unless required to do so by law or in good faith or honest belief that such preservation or disclosure is reasonably necessary to:<br>(a) comply with legal process, law, regulation or court order;<br>(b) enforce the Terms and Conditions of this agreement;<br>(c) respond to your requests for customer service.<\/p>\n\n\n\n<h2>Rights Of Admission<\/h2>\n\n\n\n<p>Moonjur Healthcare Private Limited (Sepalika) reserves the right to unilaterally determine the eligibility of a member to participate in any of its programs after examination of blood test reports and\/or medical condition and\/or from the telephonic consultation with a medical expert. The member is expected to make full disclosures in utmost good faith of all information in her power and control with respect to her eligibility to participate in the Sepalika programs.<\/p>\n\n\n\n<p>Moonjur Healthcare Private Limited reserves the right to unilaterally terminate the participation of a member either upon receipt of advice that the Sepalika program is not suited to or suitable for any reason whatsoever to the member or upon receipt of advice from a medical expert in that regard or in the event of it being discovered at any stage of the implementation of the program that the member has not disclosed any material information which is deemed to be relevant.<\/p>\n\n\n\n<p>Moonjur Healthcare Private Limited reserves its right to alter or change the terms of eligibility or to prescribe additional terms for eligibility to participate in a program without prior notice to a member. Members undertake to appraise themselves of the terms and conditions of the program from time to time from the website of Sepalika.<\/p>\n\n\n\n<p>Any payment received from the member towards subscription charges will be refunded in full or in proportion, as the case may be, to a member within ten working days from notice of termination of subscription issued to the member. Sepalika will not be required to provide any reasons whatsoever for their decision to terminate the subscription of any member. In the event of such refund, in part or in full, no claim for payment of any interest or any compensation of any nature whatsoever will be entertained.&nbsp; The decision by Moonjur Healthcare Private Limited to refund the subscription charges, in part or in full, will be final and binding upon the member.<\/p>\n\n\n\n<p>In the event of termination of subscription and refund of payment made, the amount will be remitted to the bank account of the member which was used to make the payment. In case of payment gateway (PayTM), the refund amount will be remitted to the account from which payment was received.<\/p>\n\n\n\n<h2>Revision Of Charges\/Services<\/h2>\n\n\n\n<p>Moonjur Healthcare Private Limited reserves a right to revise the fees or other charges, or withdraw \/ suspend \/ cancel \/ discontinue any or all of the services without prior notice, make modifications and alterations in any or all of the content, products and services contained on the site without prior notice and at its sole discretion.<\/p>\n\n\n\n<h2 id=\"Refund\">Refund And Cancellation Policy<\/h2>\n\n\n\n<p>Our focus is complete customer satisfaction. In the event, if you are displeased with the services provided, we will refund back the money, provided the reasons are genuine and proved after investigation. The decision of Moonjur Healthcare Pvt Ltd will be final.<\/p>\n\n\n\n<p>Our Policy for the cancellation and refund will be as follows: Once payment is made, Sepalika (Moonjur Healthcare) will not entertain any request for cancellation.<\/p>\n\n\n\n<p>Refund Policy (3-month Subscription Program):<\/p>\n\n\n\n<p>a. When you pay for the first 3 months: Should you be dissatisfied with the program protocol, you can request for a refund. Requests must be received within 7 (seven) days of payment to qualify for a refund. Any request received after the seventh day will not qualify for a refund. Refund amount to be paid will be determined after deducting any costs incurred by Moonjur Healthcare on servicing you thus far. The decision of Moonjur Healthcare Pvt Ltd will be final.<\/p>\n\n\n\n<p>If paid through Net banking facility, refunds will be issued to the original bank account provided at the time of purchase and in case of payment gateway, refund will be made to the same account of the payment gateway.<\/p>\n\n\n\n<p>b. When you pay for the renewal pack after first three months: Once paid, there is no refund or cancellation policy on this option.<\/p>\n\n\n\n<p>Refund and Cancellation Policy (Monthly Subscription Programs):<\/p>\n\n\n\n<p>Once payment is made, Sepalika (Moonjur Healthcare) will not entertain any request for refund or cancellation.<\/p>\n\n\n\n<h2>Disclaimers<\/h2>\n\n\n\n<p>Advice rendered by Sepalika is intended for general purposes only and is not meant to be used in emergencies\/serious illnesses requiring physical consultation. If a medical professional adjudges that a physical examination would be required and advises ‘in-person consultation’, it is the sole responsibility of the member, to undertake physical examination and in-person consultation whether the same is with the medical professional on the board of Sepalika or otherwise. Sepalika or its affiliates shall in no event be held liable in the event of a member’s failure to take timely recourse to a one-on-one physical examination\/treatment from a medical professional.<\/p>\n\n\n\n<p>Sepalika does not warrant nor assure the accuracy or success of any advice that may be rendered to a member by the medical practitioners or other affiliates of Sepalika.&nbsp; Such accuracy or success is dependent upon various factors personal to the member and may vary on a case-to-case basis.<\/p>\n\n\n\n<p>The Member agrees that by using the services of Sepalika, the Doctors\/Medical professionals will not be conducting physical examination of the members, hence they may not have or be able to derive important information that is usually obtained through a physical examination. Member acknowledges and agrees that the member is aware of this limitation and agrees to assume the complete risk of this limitation.<\/p>\n\n\n\n<p>If a member is on any medication for any illness or are undergoing any medical treatment, they must consult with their healthcare provider before undertaking Sepalika’s weight loss programme. We cannot predict how changing diet may impact the effect of their medication or the course of their medical condition. The practice of nutrition is not exact science and no guarantees will be made to members about the results of treatments, examinations, or services.<\/p>\n\n\n\n<p>A list of nutritionists \/ doctors whom a member may consult is available on our website.&nbsp; The names appearing on the list may change from time to time at the sole discretion of Sepalika.&nbsp; Sepalika does not assure nor warrant the outcome or efficacy of the professional\/ medical advice that may be rendered by such nutritionists \/ doctors to the members.<\/p>\n\n\n\n<h2>Relationship<\/h2>\n\n\n\n<p>None of the provisions of the User Agreement shall be deemed to constitute a partnership or agency between you and Moonjur Healthcare Private Limited and you shall have no authority to bind Moonjur Healthcare Private Limited in any manner, whatsoever.<\/p>\n\n\n\n<h2>Governing Law And Jurisdiction<\/h2>\n\n\n\n<p>This agreement and the relationship between you and Moonjur Healthcare Private Limited shall be governed and construed in accordance with the Laws of India without regard to its conflict of law provisions. You hereby irrevocably consent to the exclusive jurisdiction and venue of courts in Mumbai, India, in all disputes arising out of or relating to the use of the sites\/services.<\/p>\n\n\n\n<h2>Settlement Of Disputes<\/h2>\n\n\n\n<p>Without prejudice to any provisions in the terms and conditions herein, any dispute or difference arising out of or touching this agreement shall be settled amicably in the first instance. Unresolved disputes or differences shall be referred to a Sole Arbitrator to be appointed\/nominated by Moonjur Healthcare Private Limited. The arbitration shall be governed by the (Indian) Arbitration and Conciliation Act, 1996 and any modifications thereon and rules made thereunder and the law governing the same shall be Indian Laws. The seat of arbitration shall be at Mumbai or at the sole discretion of Moonjur Healthcare Private Limited.<\/p>\n\n\n\n<h2>Force Majeure<\/h2>\n\n\n\n<p>Moonjur Healthcare Private Limited shall have no liability to you for any interruption or delay in access to the Site and service irrespective of the nature of the cause.<\/p>\n\n\n\n<h2>Waiver And Severability<\/h2>\n\n\n\n<p>The failure of Moonjur Healthcare Private Limited to exercise or enforce any right or provision of the Agreement shall not constitute a waiver of such right or provision. If any provision of the Agreement is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties’ intentions as reflected in the provision, and the other provisions of the Agreement remain in full force and effect.<\/p>\n\n\n\n<h2>Indemnity<\/h2>\n\n\n\n<p>You shall indemnify and hold harmless Moonjur Healthcare Private Limited and its respective officers, directors, agents, and employees, from any claim or demand, or actions including reasonable attorneys’ fees, made by any third party or penalty imposed due to or arising out of your breach of these terms and conditions.<\/p>\n\n\n\n<h2>Acceptance Of Privacy Policy<\/h2>\n\n\n\n<p>By using www.sepalika.com and services provided therein, you signify your acceptance of this “Terms and Conditions”. If you do not agree or are not comfortable with any policy \/ terms described in this document, your only remedy is to discontinue use of the website. We reserve the right to modify this Privacy Statement at any time.<\/p>\n\n\n\n<h2>Entire Agreement<\/h2>\n\n\n\n<p>These Terms of Service constitute the entire agreement between the parties with respect to the subject matter hereof and supersedes and replaces all prior or contemporaneous understandings or agreements, written or oral, regarding such subject matter.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Agreement” means the terms and conditions as detailed herein including all schedules, appendices, annexures, Privacy Policy, and will include the references to this Agreement as amended, supplemented, varied or replaced from time to time. “Member”\/ “You” means and includes you and\/or any person or an entity using or accessing the services provided on this Site. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"inline_featured_image":false},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Terms and conditions: Sepalika<\/title>\n<meta name=\"description\" content=\"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.sepalika.com\/terms-and-conditions\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Terms and conditions: Sepalika\" \/>\n<meta property=\"og:description\" content=\"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.sepalika.com\/terms-and-conditions\/\" \/>\n<meta property=\"og:site_name\" content=\"Sepalika\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/sepalikahealth\/\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-18T11:22:48+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@SepalikaHealth\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.sepalika.com\/#website\",\"url\":\"https:\/\/www.sepalika.com\/\",\"name\":\"Sepalika\",\"description\":\"Women&#039;s Hormonal Health Clinic\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.sepalika.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.sepalika.com\/terms-and-conditions\/#webpage\",\"url\":\"https:\/\/www.sepalika.com\/terms-and-conditions\/\",\"name\":\"Terms and conditions: Sepalika\",\"isPartOf\":{\"@id\":\"https:\/\/www.sepalika.com\/#website\"},\"datePublished\":\"2021-01-07T09:58:18+00:00\",\"dateModified\":\"2021-05-18T11:22:48+00:00\",\"description\":\"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.sepalika.com\/terms-and-conditions\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.sepalika.com\/terms-and-conditions\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.sepalika.com\/terms-and-conditions\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Terms And Conditions\"}]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Terms and conditions: Sepalika","description":"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.sepalika.com\/terms-and-conditions\/","og_locale":"en_US","og_type":"article","og_title":"Terms and conditions: Sepalika","og_description":"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.","og_url":"https:\/\/www.sepalika.com\/terms-and-conditions\/","og_site_name":"Sepalika","article_publisher":"https:\/\/www.facebook.com\/sepalikahealth\/","article_modified_time":"2021-05-18T11:22:48+00:00","twitter_card":"summary_large_image","twitter_site":"@SepalikaHealth","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.sepalika.com\/#website","url":"https:\/\/www.sepalika.com\/","name":"Sepalika","description":"Women&#039;s Hormonal Health Clinic","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.sepalika.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.sepalika.com\/terms-and-conditions\/#webpage","url":"https:\/\/www.sepalika.com\/terms-and-conditions\/","name":"Terms and conditions: Sepalika","isPartOf":{"@id":"https:\/\/www.sepalika.com\/#website"},"datePublished":"2021-01-07T09:58:18+00:00","dateModified":"2021-05-18T11:22:48+00:00","description":"All information and services displayed on the www.sepalika.com constitute an “invitation to offer”. Your request for availment constitutes your offer which shall be subject to the terms and conditions as listed below. All the terms and conditions form an Agreement regulating our relationship with regard to use of online transactions.","breadcrumb":{"@id":"https:\/\/www.sepalika.com\/terms-and-conditions\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.sepalika.com\/terms-and-conditions\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.sepalika.com\/terms-and-conditions\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Terms And Conditions"}]}]}},"_links":{"self":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages\/16227"}],"collection":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/comments?post=16227"}],"version-history":[{"count":0,"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/pages\/16227\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.sepalika.com\/wp-json\/wp\/v2\/media?parent=16227"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}